[
  {
    "title": "Algorithmique - Niveau Débutant",
    "description": "Plongez dans les bases absolues de l'algorithmique. Maîtrisez la séquentialité, la mémoire, les décisions et les itérations. Ce cours fondateur est conçu avec la plus grande rigueur académique pour forger votre esprit analytique.",
    "category": "Théorie",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1516116216624-98e6e351d85e?w=800&q=80",
    "rating": 4.9,
    "students": 12050,
    "language": "french",
    "isFree": true,
    "tags": [
      "algorithme",
      "logique",
      "débutant",
      "bases",
      "fondations"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Philosophie et Pensée Algorithmique",
        "description": "Comprendre la genèse de l'informatique avant de toucher à la moindre ligne de code.",
        "order": 1,
        "duration": "5 heures",
        "content": "L'informatique ne consiste pas à taper sur un clavier, mais à apprendre à penser. Un algorithme est, formellement défini, un ensemble fini et non ambigu d'instructions exécutables, visant à résoudre un problème donné en un temps fini. Nous allons ici déconstruire la notion d'état, de transition, de donnée d'entrée (input) et de donnée de sortie (output). Vous apprendrez à 'penser comme une machine' : de manière séquentielle, déterministe, et sans aucune ambiguïté. C'est ici que réside la différence entre un bricoleur et un ingénieur logiciel.",
        "objectives": [
          "Définir formellement un algorithme",
          "Comprendre le déterminisme",
          "Séparer le problème de son implémentation",
          "Modéliser un problème de la vie réelle mathématiquement"
        ],
        "exercises": [
          {
            "title": "Modélisation : La Tour de Hanoï",
            "description": "Écrivez les étapes manuelles, sous forme pseudo-algorithmique stricte, pour résoudre une Tour de Hanoï à 3 disques.",
            "difficulty": "Moyen",
            "solution": "1. Déplacer Disque(1) de A vers C\n2. Déplacer Disque(2) de A vers B\n3. Déplacer Disque(1) de C vers B\n4. Déplacer Disque(3) de A vers C\n5. Déplacer Disque(1) de B vers A\n6. Déplacer Disque(2) de B vers C\n7. Déplacer Disque(1) de A vers C",
            "hints": [
              "Nommez vos piquets A, B et C.",
              "Rappelez-vous : un plus grand disque ne peut jamais reposer sur un plus petit."
            ]
          },
          {
            "title": "Le Distributeur Automatique",
            "description": "Créez un algorithme séquentiel qui décrit le comportement d'un distributeur de boisson : insertion de monnaie, vérification du stock, rendu de monnaie.",
            "difficulty": "Facile",
            "solution": "1. LIRE Montant_Insere\n2. LIRE Choix_Boisson\n3. SI Stock(Choix_Boisson) == 0 ALORS Rendre Montant_Insere ET Terminer\n4. SI Montant_Insere < Prix(Choix_Boisson) ALORS Rendre Montant_Insere ET Signaler Erreur ET Terminer\n5. Distribuer Choix_Boisson\n6. Rendre (Montant_Insere - Prix(Choix_Boisson))\n7. Reduire_Stock(Choix_Boisson, 1)",
            "hints": [
              "N'oubliez pas les états d'erreurs (pas de stock, pas assez d'argent)."
            ]
          }
        ],
        "resources": [
          {
            "title": "Histoire de l'Algorithmique par Al-Khwarizmi",
            "type": "article",
            "url": "https://fr.wikipedia.org/wiki/Al-Khw%C3%A2rizm%C3%AE"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Mémoire, Variables et Typage Rigoureux",
        "description": "Domptez la gestion de la mémoire, les types de données primitifs et l'allocation.",
        "order": 2,
        "duration": "7 heures",
        "content": "Une machine manipule de la mémoire vive (RAM). Pour notre algorithme, cela se traduit par la déclaration de 'variables'. Mais attention : une variable n'est pas magique. Elle a une taille (en octets), une adresse (où elle est stockée), un Nom (identificateur), un Type (entier, flottant, pointeur, caractère, booléen) et une Valeur. Nous allons voir pourquoi le typage rigoureux est essentiel. Vous apprendrez la différence entre l'affectation (=) et l'égalité (==), ainsi que les principes de portée (scope local vs global).",
        "objectives": [
          "Maîtriser les types primitifs",
          "Comprendre la représentation binaire en mémoire",
          "Éviter les erreurs d'affectation et d'effets de bord"
        ],
        "exercises": [
          {
            "title": "Permutation Circulaire (A, B, C)",
            "description": "Écrivez un algorithme pour échanger les valeurs de 3 variables : la valeur de A va dans B, celle de B dans C, et celle de C dans A.",
            "difficulty": "Moyen",
            "solution": "VARIABLE Temp, A, B, C\nTemp = C\nC = B\nB = A\nA = Temp",
            "hints": [
              "Utilisez au moins une variable de sauvegarde."
            ]
          },
          {
            "title": "Conversions de Types",
            "description": "Que se passe-t-il si vous tentez d'additionner un Entier(5) et une Chaîne('10') dans un langage fortement typé ?",
            "difficulty": "Moyen",
            "solution": "Une erreur de compilation ou une exception au runtime est levée (ex: Type Mismatch), car le compilateur refuse de mélanger aveuglément des types mathématiques et textuels sans fonction de 'cast' explicite.",
            "hints": [
              "Pensez à la différence entre concaténation et addition mathématique."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Structures de Contrôle et Algèbre de Boole",
        "description": "Le cerveau de l'algorithme : branchements conditionnels et opérateurs logiques complexes.",
        "order": 3,
        "duration": "8 heures",
        "content": "Les conditions transforment une simple calculatrice en une machine intelligente. Nous plongeons ici dans l'Algèbre de Boole : opérateurs ET (AND), OU (OR), NON (NOT), OU Exclusif (XOR). Vous apprendrez à construire des tables de vérité pour prouver formellement la justesse de vos conditions. Nous aborderons les structures conditionnelles imbriquées (IF, ELSE IF, ELSE) et le fameux Switch (Selon). Savoir simplifier une condition via les lois de De Morgan est une compétence d'ingénieur indispensable.",
        "objectives": [
          "Construire une table de vérité complete",
          "Appliquer les Lois de De Morgan",
          "Maîtriser les branchements décisionnels multiples"
        ],
        "exercises": [
          {
            "title": "Loi de De Morgan Appliquée",
            "description": "Simplifiez l'expression logique suivante : NON(A ET B) OU NON(A).",
            "difficulty": "Difficile",
            "solution": "Par De Morgan : NON(A ET B) = NON(A) OU NON(B).\nDonc l'expression devient : (NON(A) OU NON(B)) OU NON(A).\nCe qui se simplifie en : NON(A) OU NON(B).",
            "hints": [
              "Révisez les tables de vérité. NON(A ET B) n'est pas NON(A) ET NON(B)."
            ]
          },
          {
            "title": "L'Année Bissextile",
            "description": "Un classique mondial. Écrivez la condition logique absolue pour déterminer si une année 'A' est bissextile.",
            "difficulty": "Moyen",
            "solution": "SI (A modulo 4 == 0 ET A modulo 100 != 0) OU (A modulo 400 == 0) ALORS\n  AFFICHER 'Bissextile'\nSINON\n  AFFICHER 'Non Bissextile'\nFIN SI",
            "hints": [
              "Une année divisible par 4 est bissextile, SAUF si elle l'est par 100, AUQUEL CAS elle doit aussi l'être par 400."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : La Puissance de l'Itération (Boucles)",
        "description": "Maîtriser la répétition algorithmique : Boucles déterministes et indéterministes.",
        "order": 4,
        "duration": "10 heures",
        "content": "La véritable puissance des ordinateurs réside dans leur capacité à répéter des milliards d'opérations sans erreur. Nous analysons en profondeur : 1) La boucle POUR (FOR), itération déterministe avec compteur d'initialisation, borne et pas d'incrémentation. 2) La boucle TANT QUE (WHILE), itération conditionnelle. 3) La boucle REPETER... JUSQU'A (DO... WHILE), s'exécutant au moins une fois. Nous traiterons des pièges mortels en entreprise : les boucles infinies, les effets de bord dans les itérateurs, et l'optimisation des sauts (Break, Continue).",
        "objectives": [
          "Sélectionner la boucle optimale pour chaque situation",
          "Prouver la terminaison d'une boucle (Variant de boucle)",
          "Maîtriser les compteurs, accumulateurs et drapeaux (flags)"
        ],
        "exercises": [
          {
            "title": "La Suite de Fibonacci (Itérative)",
            "description": "Générez les N premiers termes de la célèbre suite de Fibonacci en utilisant uniquement une boucle.",
            "difficulty": "Difficile",
            "solution": "LIRE N\nPrev1 = 0, Prev2 = 1\nSI N >= 1 ALORS AFFICHER Prev1\nSI N >= 2 ALORS AFFICHER Prev2\nPOUR i ALLANT DE 3 A N FAIRE\n  Nouveau = Prev1 + Prev2\n  AFFICHER Nouveau\n  Prev1 = Prev2\n  Prev2 = Nouveau\nFIN POUR",
            "hints": [
              "La suite commence par 0, 1. Ensuite, chaque nombre est la somme des deux précédents. Maintenez toujours la trace des deux derniers !"
            ]
          },
          {
            "title": "Nombres Premiers (Recherche Exhaustive)",
            "description": "Écrivez un algorithme algorithmique pour vérifier si un nombre X est premier en testant ses diviseurs avec une boucle WHILE optimisée.",
            "difficulty": "Difficile",
            "solution": "LIRE X\nSI X <= 1 ALORS RETOURNER Faux\ndiviseur = 2\nTANT QUE diviseur * diviseur <= X FAIRE\n  SI X modulo diviseur == 0 ALORS\n    RETOURNER Faux\n  FIN SI\n  diviseur = diviseur + 1\nFIN TANT QUE\nRETOURNER Vrai",
            "hints": [
              "Il n'est pas nécessaire de tester jusqu'à X. S'arrêter à la racine carrée de X (diviseur * diviseur <= X) est la preuve mathématique d'optimisation."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "Algorithmique - Niveau Intermédiaire",
    "description": "Élevez votre niveau. L'heure n'est plus à la syntaxe, mais à la structuration avancée des données et à la modularisation via les Fonctions. Ce module est le rempart pour devenir un vrai développeur complet.",
    "category": "Théorie",
    "level": "Intermédiaire",
    "duration": "40 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 4.8,
    "students": 8540,
    "language": "french",
    "isFree": true,
    "tags": [
      "algorithme",
      "tableaux",
      "tris",
      "fonctions",
      "intermédiaire"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Vecteurs, Tableaux Unidimensionnels et Parcourabilité",
        "description": "Le fondement des collections de données, l'accès mémoire séquentiel et la manipulation d'index.",
        "order": 1,
        "duration": "10 heures",
        "content": "Les variables simples trouvent vite leurs limites. Un Tableau (Array) permet l'agrégation de N éléments contigus en mémoire sous une même entité. C'est l'un des concepts les plus cruciaux de l'ingénierie logicielle. Nous décortiquons l'allocation statique vs dynamique, le dépassement d'index (Buffer Overflow - la plus grave faille de sécurité historique), ainsi que les techniques de balayage complet (Maps, Folds, accumulatrices). L'élève devra être capable d'inverser un tableau en place, de supprimer un élément par décalage, et d'y insérer une donnée au détriment de l'optimisation coûtante O(n).",
        "objectives": [
          "Contrôler les limites (Out of Bounds)",
          "Réaliser des opérations 'In-Place' (sans utiliser de second tableau)",
          "Maîtriser la recherche séquentielle (Linear Search)"
        ],
        "exercises": [
          {
            "title": "Inversion d'un Tableau en Place (In-Place Reversal)",
            "description": "Inversez tous les éléments d'un tableau T de taille N sans déclarer de nouveau tableau (mémoire O(1)).",
            "difficulty": "Difficile",
            "solution": "gauche = 0\ndroite = N - 1\nTANT QUE gauche < droite FAIRE\n  Temp = T[gauche]\n  T[gauche] = T[droite]\n  T[droite] = Temp\n  gauche = gauche + 1\n  droite = droite - 1\nFIN TANT QUE",
            "hints": [
              "Utilisez le concept de 'Two Pointers' (deux curseurs) se dirigeant l'un vers l'autre."
            ]
          },
          {
            "title": "Décalage d'Éléments (Shift)",
            "description": "Supprimez l'élément à l'index K d'un tableau et décalez toute la suite d'un cran vers la gauche.",
            "difficulty": "Moyen",
            "solution": "POUR i ALLANT DE K A N - 2 FAIRE\n  T[i] = T[i + 1]\nFIN POUR\nN = N - 1",
            "hints": [
              "Si j'efface la case 3, je dois y mettre le contenu de la case 4, et ainsi de suite."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Sous-programmes, Fonctions et Procédures (DRY)",
        "description": "La modularisation du code : paramètres, retours, portées, et passage par valeur vs référence.",
        "order": 2,
        "duration": "10 heures",
        "content": "Un code 'Spaghetti' monolithique est indébuggable. L'art de l'ingénieur réside dans l'encapsulation de blocs logiques autonomes : les sous-programmes. Nous définirons avec intransigeance la différence entre : Les Paramètres Formels (dans la définition) et les Paramètres Effectifs ou Arguments (lors de l'appel). Nous étudierons le 'Passage par Valeur' (copie de la donnée, aucune altération globale) et le 'Passage par Référence' (pointeur brut de mémoire, altération profonde redoutable). La compréhension de la portée (Scope lexical) et du masquage de variables est exigée.",
        "objectives": [
          "Écrire des fonctions pures",
          "Maîtriser le Call Stack (Pile d'exécution)",
          "Distinguer Valeur et Référence"
        ],
        "exercises": [
          {
            "title": "Danger du Passage par Référence",
            "description": "Si T est un tableau passé à une procédure 'ViderTableau(Tab)', le tableau d'origine T est-il impacté ? Pourquoi ?",
            "difficulty": "Moyen",
            "solution": "Oui. Historiquement et techniquement, les tableaux sont généralement passés par référence (ou pointeur vers leur adresse mémoire initiale) pour éviter le coût exorbitant de la copie de milliers d'éléments. La procédure modifie l'adresse d'origine.",
            "hints": [
              "Copier un tableau de 1 Gigaoctet à chaque appel ralentirait le PC."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Les Algorithmes de Tri Quadratiques (O(n²))",
        "description": "Comprendre comment remettre de l'ordre dans le chaos, brique par brique.",
        "order": 3,
        "duration": "10 heures",
        "content": "Le Tri est le défi par excellence de la Computer Science. L'apprentissage débute par les tris naïfs, dont le temps d'exécution croît de façon quadratique avec le nombre d'éléments. Nous étudierons : 1. Le Tri par Sélection (Chercher le plus petit, le mettre au début). 2. Le Tri par Insertion (Comme ranger sa main aux cartes). 3. Le Tri à Bulles (Faire remonter les plus grandes valeurs comme des bulles d'air). Nous décortiquerons ligne par ligne l'imbrication fatale de leurs boucles générant la complexité de O(N²).",
        "objectives": [
          "Implémenter de mémoire le Tri par Sélection",
          "Comprendre visuellement le Tri Insertion",
          "Compter le nombre d'opérations exactes requises"
        ],
        "exercises": [
          {
            "title": "L'Algorithme du Tri Insertion",
            "description": "Écrivez le pseudo-code absolu du tri par insertion.",
            "difficulty": "Difficile",
            "solution": "POUR i ALLANT DE 1 A N-1 FAIRE\n  cle = T[i]\n  j = i - 1\n  TANT QUE j >= 0 ET T[j] > cle FAIRE\n    T[j + 1] = T[j]\n    j = j - 1\n  FIN TANT QUE\n  T[j + 1] = cle\nFIN POUR",
            "hints": [
              "On sauvegarde l'élément actuel (cle). On décale vers la droite tous les éléments plus grands que 'cle', puis on l'insère dans le vide créé."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Manipulation de Chaînes de Caractères (Strings)",
        "description": "L'analyse lexicale, les tables ASCII et la gestion fine du texte.",
        "order": 4,
        "duration": "10 heures",
        "content": "L'humanité communique par le texte, les machines par les nombres. Une Chaîne (String) n'est fondamentalement qu'un tableau de caractères codés en nombres (ASCII, UTF-8). Nous verrons des algorithmes de NLP (Natural Language Processing) de base : vérifier un palindrome, chercher des sous-chaînes (Pattern Matching naïf), effacer les espaces redondants, et convertir en Majuscule/Minuscule sans utiliser de fonctions intégrées (par soustraction arithmétique de la table ASCII).",
        "objectives": [
          "Manipuler la table ASCII",
          "Comprendre un String comme un Array inhérent",
          "Dédoubler des mots et analyser du texte brut"
        ],
        "exercises": [
          {
            "title": "Le Détecteur de Palindromes Parfait",
            "description": "Écrivez un algorithme pour déterminer si un mot est un palindrome (ex: KAYAK, RADAR) en ignorant les espaces et en temps O(N).",
            "difficulty": "Difficile",
            "solution": "gauche = 0\ndroite = Longueur(MOT) - 1\nTANT QUE gauche < droite FAIRE\n  SI MOT[gauche] == ESPACE ALORS gauche = gauche + 1\n  SINON SI MOT[droite] == ESPACE ALORS droite = droite - 1\n  SINON SI Majuscule(MOT[gauche]) != Majuscule(MOT[droite]) ALORS RETOURNER Faux\n  SINON\n    gauche = gauche + 1\n    droite = droite - 1\nFIN TANT QUE\nRETOURNER Vrai",
            "hints": [
              "Utilisez le pattern Two-Pointers (gauche et droite). Ignorez les caractères spéciaux en demandant à vos pointeurs d'avancer s'ils en croisent."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "Algorithmique - Niveau Expert Mondiale (Avancé)",
    "description": "Bienvenue dans l'antichambre des géants de la Tech (FAANG). Ce module terminal enseigne les fondations qui distinguent les codeurs ordinaires des ingénieurs Senior. O, Arbres, Graphes, Backtracking et Programmation Dynamique.",
    "category": "Théorie",
    "level": "Avancé",
    "duration": "60 heures",
    "image": "https://images.unsplash.com/photo-1504384308090-c894fdcc538d?w=800&q=80",
    "rating": 5,
    "students": 4200,
    "language": "french",
    "isFree": true,
    "tags": [
      "algorithme",
      "avancé",
      "récursivité",
      "arbres",
      "complexité",
      "graphes",
      "dynamic_programming"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : L'Analyse Asymptotique et Notation Big O",
        "description": "Apprenez à prouver mathématiquement qu'un code est optimisé.",
        "order": 1,
        "duration": "8 heures",
        "content": "Lorsqu'Amazon traite 1 milliard d'articles, un algorithme en O(N²) crashe l'entreprise. L'outil suprême de l'ingénieur est la notation asympotique de Landau (Big O). Elle mesure non pas le 'temps' en secondes, mais le Taux de Croissance des opérations selon la taille N de la donnée. Nous distinguerons O(1) (Magie constante), O(log N) (Dichotomie redoutable), O(N) (Linéaire saine), O(N log N) (Tri optimal), O(N²) (Dangereux), et les catastrophiques O(2^N) / O(N!). Vous ne pourrez plus jamais coder sans calculer mentalement votre Big O.",
        "objectives": [
          "Calculer la complexité Temporelle de tout algorithme",
          "Comprendre la Complexité Spatiale (Mémoire)",
          "Identifier le pire cas, le cas moyen et le meilleur cas"
        ],
        "exercises": [
          {
            "title": "Alerte de Complexité Spatiale",
            "description": "Quelle est la particularité mortelle du Merge Sort concernant sa complexité spatiale par rapport au Quick Sort ?",
            "difficulty": "Difficile",
            "solution": "Le Merge Sort nécessite O(N) mémoire supplémentaire (création de sous-tableaux temporaires lors de la fusion). Le Quick Sort, si implémenté In-Place, opère en O(log N) mémoire (strictement limité à la profondeur de la Call Stack récursive). En environnement embarqué très limité, le Merge Sort peut générer un Memory Exhaustion, justifiant le tri In-Place.",
            "hints": [
              "Pensez à l'impact des créations de nouveaux tableaux à chaque division du divide and conquer."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Divide and Conquer & La Recherche Dichotomique",
        "description": "Diviser pour régner, ou comment pulvériser les données colossales en un temps O(log N).",
        "order": 2,
        "duration": "10 heures",
        "content": "Face à une botte de foin gigantesque, chercher l'aiguille brin par brin (O(N)) est inacceptable. Le paradigme Divide and Conquer exige la division du spectre par des fractions massives à chaque réflexion. La Recherche Dichotomique (Binary Search) incarne ce miracle : dans un annuaire trié de 1 milliard de personnes, la recherche séquentielle mettrait 1 milliard de tentatives. La recherche dichotomique trouve la cible ou conclut l'échec en seulement 30 opérations (car 2^30 > 1 Milliard). L'élève devra coder aveuglément cette méthode et repérer ses failles (le dépassement d'Entier 'overflow' pendant le calcul du (debut+fin)/2).",
        "objectives": [
          "Coder la Recherche Dichotomique sans Overflow",
          "Comprendre la récursivité du Divide",
          "Maîtriser les conditions aux limites (Off-by-one errors)"
        ],
        "exercises": [
          {
            "title": "Vraie Implémentation de la Dichotomie (Sans Overflow)",
            "description": "Écrivez le code d'une recherche dichotomique qui évite complètement le bug historique du Stack Overflow qui existait même dans l'API Java originelle.",
            "difficulty": "Difficile",
            "solution": "debut = 0, fin = N - 1\nTANT QUE debut <= fin FAIRE\n  // Au lieu de (debut + fin) / 2 qui peut dépasser la limite INTEGER_MAX si tableau gigantesque\n  milieu = debut + (fin - debut) / 2\n  SI T[milieu] == CIBLE ALORS RETOURNER milieu\n  SI T[milieu] < CIBLE ALORS debut = milieu + 1\n  SINON fin = milieu - 1\nFIN TANT QUE\nRETOURNER -1",
            "hints": [
              "Rappelez-vous que 'debut + fin' peut produire un nombre plus grand que les 32 bits de la machine si le tableau est massif. Pensez autrement..."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Récursion, Call Stack et Tris Avancés (Quick Sort & Merge Sort)",
        "description": "Les algorithmes complexes et l'architecture mémoire interne : La beauté vertigineuse des fonctions auto-appellantes.",
        "order": 3,
        "duration": "15 heures",
        "content": "La récursion survient lorsqu'une fonction s'appelle elle-même avec un sous-problème plus petit. L'ingénieur doit visualiser mentalement la Call Stack du processeur. Nous utiliserons la récursion pour bâtir les deux tris professionnels mondiaux en O(n log n). Le Merge Sort (Tri Fusion), algorithme de type Out-of-place très puissant pour les listes géantes ; et surtout le Quick Sort (Tri Rapide), de sir Tony Hoare, très rapide en In-Place, dont la performance totale dépend d'un Pivot savamment choisi, sinon quoi il chute fatalement en O(N²).",
        "objectives": [
          "Implémenter formellement le partitionnement QuickSort",
          "Fusionner deux tableaux (Merge)",
          "Eviter les Stack Overflows Recursifs"
        ],
        "exercises": [
          {
            "title": "Concept du Tri Fusion (Merge)",
            "description": "Comment fusionner deux tableaux A et B DÉJÀ triés en un seul tableau C trié, en temps linéaire O(N) ?",
            "difficulty": "Difficile",
            "solution": "i = 0, j = 0, k = 0\nTANT QUE i < Taille(A) ET j < Taille(B) FAIRE\n  SI A[i] <= B[j] ALORS\n    C[k] = A[i]; i++\n  SINON\n    C[k] = B[j]; j++\n  k++\nFIN TANT QUE\nAjouter le reste de A (si i < Taille(A)) dans C\nAjouter le reste de B (si j < Taille(B)) dans C",
            "hints": [
              "Imaginez devoir zipper deux piles de cartes ordonnées. Regardez la première de chaque, prenez la plus petite."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Data Structures Ultimates — Pointeurs, Listes, Arbres et Graphes",
        "description": "Créer des structures dynamiques complexes non-contiguës.",
        "order": 4,
        "duration": "15 heures",
        "content": "Nous quittons le confort chaleureux des tableaux. La réalité informatique demande des structures dynamiques. Vous plongerez dans la création de structures via des **Pointeurs** (adresses mémoire) : Listes simplement et doublement chaînées (O(1) en insertion/suppression), Piles (LIFO) et Files (FIFO). Le cœur de la modélisation informatique : Les Arbres Binaires de Recherche (BST), qui lient la flexibilité des listes avec la vitesse du niveau log N. Enfin, introduction théâtrale à la Théorie des Graphes (Sommets, Arêtes) pour la modélisation des réseaux routiers et sociaux : le BFS (Parcours en largeur), le DFS (Parcours en profondeur), et l'algorithme mythique du plus court chemin de Dijkstra.",
        "objectives": [
          "Maîtriser les pointeurs logiques Node/Next/Root",
          "Implémenter une Pile (Stack)",
          "Parcourir un Arbre Binaire complet (InOrder, PreOrder)"
        ],
        "exercises": [
          {
            "title": "Récupération dans une Pile (Stack)",
            "description": "Une pile contient {A, B, C} où C a été ajouté en dernier. Quel élément sera retiré au premier Dépiler (Pop) ?",
            "difficulty": "Facile",
            "solution": "L'élément C. C'est le principe du Last-In-First-Out (LIFO).",
            "hints": [
              "LIFO. Le dernier posé, le premier sorti."
            ]
          },
          {
            "title": "Algorithme de l'Arbre Binaire de Recherche",
            "description": "Décrivez la règle d'insertion mathématique pour un nœud dans un BST (Binary Search Tree).",
            "difficulty": "Difficile",
            "solution": "Pour tout nœud Parent :\n- Toutes les valeurs du sous-arbre gauche doivent être strictement INFÉRIEURES à celle du Parent.\n- Toutes les valeurs du sous-arbre droit doivent être strictement SUPÉRIEURES à celle du Parent.",
            "hints": [
              "Tout doit être triable et recherchable naturellement de chaque côté de la balance."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 5 : Programmation Dynamique (Dynamic Programming) et Backtracking",
        "description": "Les armes absolues. Résoudre l'insoluble via la mémoïsation et la théorie des essais/erreurs.",
        "order": 5,
        "duration": "12 heures",
        "content": "Une fois expert en Graphes et en Récursivité, vous êtes prêt pour la consécration de l'intelligence artificielle : la Programmation Dynamique et le Backtracking. La Programmation Dynamique (de Richard Bellman) enseigne l'optimisation par la conservation des calculs : 'Ceux qui ne se souviennent pas du passé sont condamnés à le répéter'. Éviter des arbres de calculs titanesques de O(2^N) grâce à la Mémoïsation (Top-Down) et la Tabulation (Bottom-Up). Le Backtracking, ou algorithme d'exploration systématique (Ex: Résoudre un Sudoku, problème des N-Reines), pour annuler élégamment des tentatives vouées à l'échec et explorer un arbre d'état monstrueux. Vous êtes arrivés à la fin du voyage. Vous êtes devenus de véritables Ingénieurs Logiciels d'Élite ! 🥂",
        "objectives": [
          "Comprendre la 'Memoization'",
          "Résoudre le problème du Rendu de Monnaie Optimisé",
          "Implémenter une matrice de programmation dynamique"
        ],
        "exercises": [
          {
            "title": "L'Explosion de Fibonacci",
            "description": "Pourquoi faire un calcul récursif pur F(50) = F(49) + F(48) bloque-t-il l'ordinateur, et comment la mémoïsation sauve-t-elle le désastre ?",
            "difficulty": "Difficile",
            "solution": "Le calcul pur est en O(2^N). F(48) ou F(30) est recalculé des millions et des millions de fois inutilement comme des racines redondantes. La Mémoïsation (Dynamic Programming) force la fonction à sauvegarder F(X) dans un tableau T la première fois qu'il le calcule. La fois suivante, au lieu d'ouvrir un arbre entier, il le lit dans le tableau en O(1), abaissant la complexité totale à O(N).",
            "hints": [
              "Réfléchissez au nombre de fois où Fib(5) sera appelé lors du calcul récursif de Fib(8). C'est vertigineux."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "C - Niveau Débutant : Les Fondations Système",
    "description": "Plongez dans le langage le plus fondamental de l'informatique moderne. Comprenez la compilation, les types natifs, et la rudesse de la gestion de mémoire sans filet de sécurité.",
    "category": "Programmation",
    "level": "Débutant",
    "duration": "35 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 4.8,
    "students": 8500,
    "language": "c",
    "isFree": true,
    "tags": [
      "c",
      "backend",
      "system",
      "débutant",
      "compilation"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Philosophie du C et Chaine de Compilation",
        "description": "Le C n'est pas un langage, c'est un assembleur portable. Comprendre la traduction du code à l'exécutable.",
        "order": 1,
        "duration": "6 heures",
        "content": "Créé par Dennis Ritchie en 1972 pour réécrire UNIX, le C est l'épine dorsale du monde. Avant d'écrire 'Hello World', vous devez comprendre la Chaine de Compilation (GCC/Clang) : 1) Le Préprocesseur (#include, #define) qui copie-colle du texte, 2) Le Compilateur qui transforme le C en Assembleur, 3) L'Assembleur qui crée le code objet (binaire pur), 4) L'Éditeur de Liens (Linker) qui relie votre objet aux bibliothèques système (libc). En C, il n'y a pas de magie, pas de Garbage Collector. Si vous allouez de la mémoire, vous en êtes l'unique responsable.",
        "objectives": [
          "Comprendre les 4 étapes de compilation",
          "Distinguer le Header (.h) de l'implémentation (.c)",
          "Écrire, compiler et exécuter un programme robuste"
        ],
        "exercises": [
          {
            "title": "Analyse du Préprocesseur",
            "description": "Écrivez un programme avec une macro `#define MAX 100`. Comment utiliseriez-vous GCC pour voir uniquement le résultat de l'étape du préprocesseur (avant compilation) ?",
            "difficulty": "Moyen",
            "solution": "Il faut exécuter `gcc -E programme.c`. Cette commande s'arrête après le préprocesseur. Le code affiché montrera que toutes les occurrences de MAX ont été littéralement remplacées par 100.",
            "hints": [
              "Cherchez le flag gcc utilisé spécifiquement pour le 'preprocessing' (--help)."
            ]
          },
          {
            "title": "Le Linker et les Bibliothèques",
            "description": "Pourquoi un programme utilisant `math.h` (ex: fonction `sqrt`) nécessite-t-il souvent de rajouter `-lm` à la compilation (ex: `gcc prog.c -lm`) ?",
            "difficulty": "Difficile",
            "solution": "Faire `#include <math.h>` ne fait que copier la *déclaration* (la signature) de la fonction pour rassurer le compilateur. Mais le vrai code binaire de `sqrt` est compilé dans une bibliothèque séparée (`libm`). Le `-lm` ordonne au Linker (Éditeur de Liens) de lier virtuellement `libm` à votre exécutable final.",
            "hints": [
              "Différenciez la compilation (vérification syntaxique) de l'édition de liens (agrégation des binaires)."
            ]
          }
        ],
        "resources": [
          {
            "title": "L'Histoire de UNIX et du C",
            "type": "article",
            "url": "https://fr.wikipedia.org/wiki/Histoire_d%27Unix"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Types Primitifs, Tailles Mémorielles et Transtypage",
        "description": "La taille compte. Un octet de trop et votre système embarqué explose.",
        "order": 2,
        "duration": "8 heures",
        "content": "Le C est statiquement et faiblement typé (on peut feinter le compilateur). Vous étudierez les types : `char` (généralement 1 octet), `short` (2 octets), `int` (4 octets), `long` (8 octets en 64-bit), `float` et `double`. Vous apprendrez l'opérateur fondamental `sizeof()` pour déterminer dynamiquement l'empreinte mémoire d'une donnée selon l'architecture de la machine. Nous verrons les dangers du dépassement de capacité (Integer Overflow) et la promotion entière (Casting) explicite vs implicite. En C, un booléen (`bool`) n'existait pas historiquement : 0 est Faux, tout le reste est Vrai.",
        "objectives": [
          "Mesurer l'encombrement RAM via sizeof",
          "Maîtriser les limites (INT_MAX, INT_MIN)",
          "Comprendre la représentation en complément à deux formellement"
        ],
        "exercises": [
          {
            "title": "Le Danger du Dépassement Intégral (Integer Overflow)",
            "description": "Si `unsigned char x = 255;`, que se passe-t-il après `x = x + 1;` ?",
            "difficulty": "Moyen",
            "solution": "La valeur devient 0. Un `unsigned char` fait 1 octet (8 bits). 255 en binaire est 11111111. Ajouter 1 modifie la valeur en (1)00000000. Le 9ème bit est perdu (tronqué), donc x revient à 0. C'est le principe du modulo.",
            "hints": [
              "Visualisez 8 bits remplis de 1, et l'effet de l'addition d'une retenue infinie."
            ]
          },
          {
            "title": "Transtypage Explicite (Cast)",
            "description": "Expliquez pourquoi `float moyenne = 5 / 2;` donne `2.000` au lieu de `2.500`, et fournissez le correctif exact.",
            "difficulty": "Difficile",
            "solution": "L'opérateur de division `/` entre deux entiers effectue une division euclidienne stricte, générant l'entier `2`. Ce `2` est ensuite casté implicitement en `float` (2.0) pour l'affection. Le correctif est de forcer au moins un des opérandes en flottant : `float moyenne = (float)5 / 2;` ou `... = 5.0 / 2;`.",
            "hints": [
              "En C, le type de sortie dépend avant tout du type des membres de l'opération, pas du type de destination de l'affectation."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Structuration, Boucles et Sécurité des Saisies",
        "description": "Le flux de contrôle brutal. Scanf et ses failles béantes de sécurité.",
        "order": 3,
        "duration": "10 heures",
        "content": "Maîtrise des blocs logiques (if, else, switch) et itérateurs (for, while, do-while). Nous nous concentrerons particulièrement sur la fonction d'entrée standard `scanf`. `scanf` est l'une des fonctions les plus dangereuses jamais écrites, causant des milliers de failles 'Buffer Overflow' si elle est mal encadrée. Nous verrons comment le buffer d'entrée du clavier (`stdin`) conserve des sauts de lignes fantômes (`\\n`) qui corrompent les saisies suivantes, et de quelle manière les ingénieurs senior utilisent `fgets()` couplé à `sscanf` pour une robustesse industrielle absolue.",
        "objectives": [
          "Vider le buffer clavier (fflush/fpurge logic)",
          "Remédier aux pièges de scanf()",
          "Capter les signaux d'EOF"
        ],
        "exercises": [
          {
            "title": "Le Déni de Scanf",
            "description": "Pourquoi `scanf(\"%s\", mot)` est-il un danger critique de sécurité dans un programme d'entreprise ?",
            "difficulty": "Difficile",
            "solution": "Si `mot` est défini comme `char mot[10];`, un hacker peut taper 500 caractères. `scanf` n'impose aucune limite de base et écrasera aveuglément la mémoire au-delà du tableau, détruisant l'intégrité de la pile d'exécution (Smashing the stack for fun and profit). Il FAUT écrire : `scanf(\"%9s\", mot);`.",
            "hints": [
              "Que se passe-t-il si l'utilisateur saisit un roman pour un nom_limite à 10 lettres ?"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : La Table ASCII, Les Chaînes et l'Absence d'Objets",
        "description": "Une chaîne de caractères n'est qu'une illusion mathématique masquant de la mémoire contiguë.",
        "order": 4,
        "duration": "11 heures",
        "content": "Le C ne connaît pas le texte. Une chaîne (string) est obligatoirement un tableau unidimensionnel de type `char`, obligatoirement terminé par le caractère Nul `\\0` (ASCII 0). Sans ce `\\0`, toutes les fonctions comme `printf` ou `strlen` liront la RAM indéfiniment jusqu'à un crash 'Segmentation Fault'. Nous étudierons la bibliothèque `<string.h>` (`strcpy`, `strcmp`, `strcat`), mais surtout pourquoi il faut toujours leur préférer leurs versions sécurisées (`strncpy`, `strncat`).",
        "objectives": [
          "Comprendre l'impératif du pointeur nul de fin de chaine",
          "Créer des tableaux de strings (Matrices de Char)",
          "Manipuler explicitement les codes ASCII par addition/soustraction"
        ],
        "exercises": [
          {
            "title": "Changement de Casse Manuel (Sans fonction native)",
            "description": "Écrivez un algorithme en C pour convertir tous les caractères minuscules d'une chaîne `T` en majuscules avec une simple addition arithmétique.",
            "difficulty": "Difficile",
            "solution": "for (int i = 0; T[i] != '\\0'; i++) {\n  if (T[i] >= 'a' && T[i] <= 'z') {\n    T[i] = T[i] - 32;\n  }\n}",
            "hints": [
              "En ASCII, la lettre 'A' vaut 65, et 'a' vaut 97. L'écart est de 32 précis."
            ]
          },
          {
            "title": "L'oubli du Backslashzéro",
            "description": "Si on initialise `char msg[3] = {'Y', 'e', 's'};` et qu'on appelle `printf(\"%s\", msg)`, que va-t-il se passer ?",
            "difficulty": "Moyen",
            "solution": "Comportement indéfini (Undefined Behavior). Le `printf` lira 'Yes' mais continuera de lire et d'imprimer la mémoire RAM adjacente (affichant des déchets ou crachant le programme) jusqu'à tomber au hasard sur un octet valant 0 (`\\0`). Le tableau DEVRAIT faire 4 cases : `{'Y', 'e', 's', '\\0'}`.",
            "hints": [
              "Toute fonction qui demande un \"%s\" est aveugle. Comment sait-elle où s'arrêter ?"
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "C - Niveau Intermédiaire : L'Enfer des Pointeurs",
    "description": "L'essence même du C. Manipulez la mémoire vive de l'ordinateur à la volée. Apprenez l'allocation dynamique et le cauchemar des fuites de mémoire (Memory Leaks).",
    "category": "Programmation",
    "level": "Intermédiaire",
    "duration": "50 heures",
    "image": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800&q=80",
    "rating": 4.9,
    "students": 6100,
    "language": "c",
    "isFree": true,
    "tags": [
      "c",
      "pointers",
      "malloc",
      "mémoire",
      "intermédiaire"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Pointeurs et Adresses (L'Éveil)",
        "description": "Le concept le plus terrifiant et puissant de la programmation. Ce qui différencie un développeur C d'un autre.",
        "order": 1,
        "duration": "10 heures",
        "content": "Un pointeur n'est rien d'autre qu'une variable. Mais au lieu de stocker un entier ou un caractère, elle stocke une Adresse Mémoire Vivante. Nous étudierons en profondeur l'Opérateur d'Adresse (`&`), qui extrait l'adresse d'une variable existante, et l'Opérateur d'Indirection ou de Déréférencement (`*`), qui ordonne au CPU d'aller voir 'ce qu'il y a à cette adresse'. Nous verrons pourquoi un pointeur doit être fortement typé (un pointeur de `int` sait qu'il doit lire 4 octets à partir de l'adresse de base). Vous construirez vos premières fonctions avec un 'passage par adresse' réel.",
        "objectives": [
          "Déclarer, initialiser et déréférencer des pointeurs",
          "Altérer la valeur de variables distantes inter-fonctions",
          "Comprendre les Déréférencement Nuls (Segfaults)"
        ],
        "exercises": [
          {
            "title": "L'Échange Absolu (Swap By Pointer)",
            "description": "Écrivez la fonction stricte `void swap(int *a, int *b)` qui modifie deux variables passées depuis le `main()`. Interdit d'utiliser `return`.",
            "difficulty": "Difficile",
            "solution": "void swap(int *a, int *b) {\n  int temp = *a; // va chercher la VAUR brute\n  *a = *b;       // remplace la valeur lointaine A par celle lointaine B\n  *b = temp;     // remet la valeur originelle\n}",
            "hints": [
              "On vous donne les clés de deux maisons (les adresses pointer). Utilisez `*` pour entrer dedans et interchanger les meubles."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Arithmétique des Pointeurs et Tableaux Réels",
        "description": "La vérité cachée : Un tableau n'a jamais existé. Il n'est qu'un sucre syntaxique pour un pointeur constant.",
        "order": 2,
        "duration": "12 heures",
        "content": "Quand vous déclarez `int T[5];`, `T` n'est pas un tableau. `T` est un 'const pointer' pointant secrètement sur la case mémoire `T[0]`. Nous allons détruire la syntaxe des crochets : vous apprendrez que écrire `T[3]` est stictement remplacé par le compilateur en `*(T + 3)`. C'est l'Arithmétique des Pointeurs : si T est un pointeur d'entiers (4 octets), faire `T + 1` ne rajoute pas 1 à l'adresse mémoire, mais bondit de 4 octets vers la case suivante ! Nous aborderons les Pointeurs sur Pointeurs (`**ptr`) (nécessaires pour les matrices d'adresses).",
        "objectives": [
          "Traverser un tableau par pure arithmétique de pointeur",
          "Comprendre que (T + i) vaut l'adresse et *(T + i) vaut la valeur",
          "Transmettre un tableau sans sa taille (et les enjeux de sécurité qui suivent)"
        ],
        "exercises": [
          {
            "title": "Équivalence stricte",
            "description": "Dans le langage C, la syntaxe autorise formellement à écrire `3[T]` au lieu de `T[3]`. Prouvez pourquoi cela fonctionne en utilisant la définition mathématique interne.",
            "difficulty": "Difficile",
            "solution": "Le compilateur traduit intrinsèquement `X[Y]` par `*(X + Y)`. L'addition étant commutative, `*(T + 3)` est strictement égal à `*(3 + T)`. Par rétro-traduction magique, `*(3 + T)` donne `3[T]`. C'est l'une des bizarreries fondatrices du langage.",
            "hints": [
              "Revenez à la définition d'un offset depuis une adresse de base via la formule d'addition du déréférencement."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Allocation Dynamique (Le Malloc) du C (Heap vs Stack)",
        "description": "La Pile ne suffit plus, invoquons le Tas (Heap). Devenez architecte des fondations RAM.",
        "order": 3,
        "duration": "15 heures",
        "content": "Toute variable normale meurt à la fin de la fonction qui l'abrite (Scope). Elle est sur la Stack (Rapide, mais très limitée en Mo). Pour charger 1 Gigaoctet de données depuis un disque dur, il faut recourir à la Heap (Le Tas) via l'Allocation Dynamique. Ce chapitre couvre les légendaires `malloc()`, `calloc()` (initialisation à 0), et `realloc()` (étirement mémoire). Le corollaire ultime : quiconque emprunte de la mémoire système DOIT la rendre. La fonction `free()` doit être invoquée scrupuleusement, sous peine d'un fatal 'Memory Leak' qui paralysera le serveur et forcera un reboot brutal.",
        "objectives": [
          "Demander de la mémoire au système l'opération malloc(sizeof(Type) * N)",
          "Rendre proprement la ram via free(ptr)",
          "Détecter avec rigueur les Pointeurs Fous / Sauvages (Dangling Pointers) et les remettre à NULL",
          "Maîtriser Valgrind, l'outil détective de fuites mémoires"
        ],
        "exercises": [
          {
            "title": "La Fuite Cataclysmique (Memory Leak)",
            "description": "Créez une fonction `void generate()` qui alloue un tableau dynamique de 100 entiers mais ne le libère pas. Quel est l'impact si cette fonction est appelée 10 millions de fois dans une boucle serveur ?",
            "difficulty": "Moyen",
            "solution": "Chaque appel prend environ 400 octets (100 * 4 octets). Sur 10 millions, cela consomme 4 Go de RAM irrécupérables en quelques secondes (Leak). Le système d'exploitation tuera le processus (OOM Killer - Out Of Memory). L'oubli de `free(tab);` est fatal.",
            "hints": [
              "Pensez à ce qui arrive quand vous louez des appartements sans jamais rendre les clés ni résilier le bail."
            ]
          },
          {
            "title": "Stabilité du Dangling Pointer",
            "description": "Pourquoi la règle d'or industrielle après un `free(ptr)` est-elle d'invoquer immédiatement `ptr = NULL;` ?",
            "difficulty": "Difficile",
            "solution": "`free(ptr)` avertit l'OS que la RAM liée peut être réutilisée, mais la variable ptr CONSERVE toujours physiquement l'adresse. Si quelqu'un d'autre tente de faire `*ptr = 10;` plus tard dans le code (Use-After-Free), c'est une corruption de mémoire atroce (Faille de Sécurité majeure de type 0-Day). Assigner `NULL` (adresse 0 invalide) garantit un crash propre et lisible en cas de réutilisation involontaire, plutôt qu'une faille pernicieuse.",
            "hints": [
              "Que se passe-t-il quand la nouvelle valeur écrase les données du prochain acheteur de cet espace RAM ?"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Structuration Complexes et Pointeurs de Fonctions",
        "description": "Construire des types de données personnalisés et l'illusion de l'Orienté Objet en C brut.",
        "order": 4,
        "duration": "13 heures",
        "content": "Une `struct` (Structure) forme l'agrégation de multiples variables sous forme de \"Mégaclasse\" primitive. Par exemple, assembler un X(float) et un Y(float) pour définir un point GPS. Nous décortiquerons l'opérateur Arrow ou flèche (`->`) : un sucre syntaxique ultra-rapide pour `(*ptr_struct).attribut`. Nous parlerons d'une des notions les plus complexes du C : les Pointeurs de Fonctions (pouvoir passer dynamiquement toute une fonction comme paramètre ou créer des dictionnaires d'exécution pour émuler un comportement Polymorphe (OOP)).",
        "objectives": [
          "Créer des structures imbriquées",
          "Maîtriser Typedef pour masquer les noms de structures longues",
          "Invoquer dynamiquement via un tableau de Pointeurs de Fonctions"
        ],
        "exercises": [
          {
            "title": "Déréférencement Stricts de Structures",
            "description": "Soit `struct Etudiant *ptr = allocEtudiant()`. Écrivez la syntaxe pure mathématique, sans sucre syntaxique avec la flèche (`->`), pour récupérer le champ 'age'.",
            "difficulty": "Moyen",
            "solution": "Il faut déréférencer le pointeur avec des parenthèses avant d'accéder à l'attribut dot (`.`) : `(*ptr).age`. La syntaxe flèche `ptr->age` a été inventée spécifiquement parce que les parenthèses de `(*ptr).age` rendaient le code trop inesthétique aux yeux de Ritchies.",
            "hints": [
              "N'oubliez pas les parenthèses de priorité pour empêcher l'opérateur Point de passer avant le Déréférencement !"
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "C - Niveau Expert Mondiale : Programmation POSIX, Threads et Noyau",
    "description": "Codez un OS, écrivez pour le réseau, forgez votre propre Multithreading de bas niveau. Un niveau réservé aux Ingénieurs de Systèmes Distribués Embaqués (IoT, Aérospatial).",
    "category": "Programmation",
    "level": "Avancé",
    "duration": "70 heures",
    "image": "https://images.unsplash.com/photo-1518770660439-4636190af475?w=800&q=80",
    "rating": 5,
    "students": 2200,
    "language": "c",
    "isFree": true,
    "tags": [
      "c",
      "posix",
      "threading",
      "expert",
      "linux",
      "sockets"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Les APIs UNIX/POSIX - Manipuler le File System (Descripteurs)",
        "description": "fopen est pour les faibles. Approfondissez l'interface OS directe via un File Descriptor pur (open/read/write).",
        "order": 1,
        "duration": "15 heures",
        "content": "Les fonctions `fopen`/`fprintf` (de `<stdio.h>`) ont un buffer et sont des abstractions 'User Level'. Le vrai développeur noyau doit utiliser les appels systèmes (System Calls - Syscalls) directs sur l'OS : Interface POSIX. Nous manipulerons les fonctions originelles `open()`, `read()`, `write()`, et `close()`. Sur Linux, « Tout est un fichier » (Everything is a file). Même votre clavier (`0`), votre écran (`1`), ou vos messages d'erreur (`2`) sont juste des descripteurs de fichiers fondamentaux. Nous programmerons des outils unix from scratch (un micro format de cat ou cp robuste en binaire natif).",
        "objectives": [
          "Ouvrir des fichiers en flag bitwise (O_RDONLY | O_CREAT)",
          "Remplir un buffer statique octet par octet par de l'I/O Syscall",
          "Tracer brutalement les erreurs internes via `errno`",
          "Comprendre /dev/null et les devices virtuels"
        ],
        "exercises": [
          {
            "title": "Appel de Write avec le Descripteur 1",
            "description": "Écrivez le code strict POSIX pour afficher 'Hello' sur la console sans utiliser aucune fonction de librairie standard (aucun `#include <stdio.h>` autorisé). Utilisez `.unistd.h`.",
            "difficulty": "Difficile",
            "solution": "`#include <unistd.h>`\n`int main() {`\n  `write(1, \"Hello\\n\", 6);`\n  `return 0;`\n`}`\nLe descripteur 1 représente 'Standard Output'. Nous disons à l'OS Système de brancher le flux d'octets sur le moniteur directement.",
            "hints": [
              "Quelle est la définition brute d'un Syscall d'impression ?"
            ]
          }
        ],
        "resources": [
          {
            "title": "Comprendre Everything Is A File (Linux)",
            "type": "article",
            "url": "https://en.wikipedia.org/wiki/Everything_is_a_file"
          }
        ]
      },
      {
        "title": "Chapitre 2 : La Bataille des Processus - Fork(), Pipe et Mémoire Partagée",
        "description": "Le CPU au bout des doigts. Créez des clones et lancez des pipelines massifs.",
        "order": 2,
        "duration": "20 heures",
        "content": "Votre programme principal peut engendrer un fils jumeau qui s'exécutera simultanément, à un temps M. L'appel système magistral `fork()` duplique tout le code, la pile, la mémoire heap d'un Process. Nous traiterons des Processus Zombies, de l'Appel Exec (`execve`) pour remplacer l'exécutable à la volée, et de la fonction `waitpid` pour imposer la loi du Processus Parent sur l'Enfant. Comment les deux processus (clones isolés hermétiquement) peuvent-ils communiquer ? Via le clonage des file descriptors avec le système originel de `pipe()` ou System V Shared Memory. Vous recréerez la ligne de commande Unix 'ls -l | grep txt'.",
        "objectives": [
          "Diagnostiquer le retour PID double typique du système Unix",
          "Détruire les processes zombies",
          "Envoyer des Data Streams asynchrones via un tube anonyme (Pipe IPC)"
        ],
        "exercises": [
          {
            "title": "L'Arbre du Fork",
            "description": "Combien de processus totaux existeront après l'exécution de cette boucle pure : `for(int i = 0; i < 3; i++) { fork(); }` ?",
            "difficulty": "Difficile",
            "solution": "Il y aura 8 processus au total (1 parent original + 7 descendants de diverses branches = 2^3 processus). Le 1er fork créer un clone. Au cycle 2, les DEUX processes exécutent indépendamment le fork et créent deux enfants. Puis 4 font de même et génèrent 4 nouveaux, soit 8. C'est une fractale exponentielle de l'exécution.",
            "hints": [
              "Pensez comme l'Hydre de Lerne. Chaque tête (process) coupe des branches qui coupent des branches récursivement."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Multithreading, Concurrence Critique et Mutexes (Pthreads)",
        "description": "Abandonnez la mémoire isolée. Exécutez 10 fonctions en parallèle qui corrompent ensemble la mémoire si vous êtes imprudents.",
        "order": 3,
        "duration": "20 heures",
        "content": "Les processus lourds coûtent de la RAM (Forking). Le système préféré dans l'Industrie de Haute Fréquence (Bourse) repose sur la norme 'POSIX Threads' ou le `<pthread.h>`. Les Threads tournent physiquement sur les cœurs séparés du CPU en même temps, ET se PARTAGENT la même mémoire Heap. L'horreur mathématique absolue du Data Race Condition intervient. Si deux Cœurs tentent d'écraser la RAM `compteur = compteur + 1` en une nano-seconde, il y a Perte Radicale d'Argent. Nous devrons modéliser de lourds coffres-forts d'exclusivité appelés Mutex (Mutual Exclusions) ou les Deadlocks (Étreinte Fatale / L'interblocage).",
        "objectives": [
          "Créer un bataillon asynchrone avec pthread_create",
          "Reconstruire séquentiellement l'exécution avec pthread_join",
          "Assassiner une Data Race de RAM par Posix Locks Mutex",
          "Résoudre la mortelle situation d'un Deadlock de deux Cœurs bloqués"
        ],
        "exercises": [
          {
            "title": "Deadlock Architecturé",
            "description": "Décrire verbalement le scénario du Dîner des Philosophes de Edsger Dijkstra et l'effet dévastateur du Locking sur des cœurs inter-dépendants.",
            "difficulty": "Difficile",
            "solution": "5 Threads (les philosophes). Et 5 ressources critiques partagés (fourchettes simples - Mutex). Thread 1 utilise son Mutex_1 et attend un temps infini le Mutex_2. Or Thread 2 utilise le Mutex_2 et attend sa voisine. Chaque Cœur CPU attend pour l'éternité une ressource bloquée pour être libérée (La situation d'étreinte mortelle ou interblocage, tuant inévitablement l'Operating System car la condition de brisure est impossible sans Terminate/KILL -9 ).",
            "hints": [
              "Le modèle de l'économie circulaire fermée et dépendante."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Implémentation Avancée Sockets C (Réseau Bas Niveau)",
        "description": "Envoyer des trames TCP/IP à la force brute C sur un serveur UDP.",
        "order": 4,
        "duration": "15 heures",
        "content": "La grande apothéose de C : Le socket réseau. Un Socket est également représenté par l'Operating System en File Descriptor. C'est l'essence du backend : Le port bind. Vous écrirez un mini serveur WEB Linux très bas niveau : 1) `socket()` (Créer le point de connexion de type Internet ou Unix), 2) `bind()` (attacher le Socket à un port précis sur votre Hardware tel le port 80/TCP), 3) `listen()` (création fil d'attente système d'appels entrants du monde extérieur), 4) `accept()` (extraction d'une requête et création d'un clone file descriptor), et enfin 5) Multithreading (envoi du client HTTP à un Thread indépendant qui retourne le String binaire d'une page HTML ou d'un JSON). Fin du cursus.",
        "objectives": [
          "Binder un port d'O.S avec C via l'API Socket",
          "Générer les Header HTTP bruts sans FrameWork et sans librairie tiers",
          "Gérer et optimiser un multiplexage d'entrée-sorties Select() / Epoll() sans Fork"
        ],
        "exercises": [
          {
            "title": "Big Endian vs Little Endian du Réseau",
            "description": "Pourquoi les développeurs Socket doivent-ils utiliser `htons(port_number)` ou `htonl` (Host TO Network Short) avant de lier le port avec the `sockaddr_in` struct ?",
            "difficulty": "Difficile",
            "solution": "Les protocoles Réseau IP exigent officiellement un alignement \"Big-Endian\" (l'octet le plus significatif en premier). Or, les puces d'ordinateur (surtout INTEL/x86) travaillent nativement en architecture locale inversée \"Little-Endian\". Cette fonction est un algorithme hyper rapide de C qui va transposer les octets dans le sens mathématique exigé par la World Wide Web Federation (IETF).",
            "hints": [
              "C'est l'histoire de la direction qu'on lit si on se lit de gauche à droite ou de droite à gauche."
            ]
          }
        ],
        "resources": [
          {
            "title": "Programmation Serveurs Bas Niveau Socket API",
            "type": "article",
            "url": "https://beej.us/guide/bgnet/html/"
          }
        ]
      }
    ]
  },
  {
    "title": "Python - Niveau Débutant : La Syntaxe Épurée",
    "description": "Apprenez le langage le plus populaire au monde. Découvrez pourquoi sa syntaxe basée sur l'indentation force l'écriture d'un code propre, et maîtrisez les structures de données intégrées.",
    "category": "Programmation",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1526379095098-d400fd0bfce8?w=800&q=80",
    "rating": 4.8,
    "students": 15400,
    "language": "python",
    "isFree": true,
    "tags": [
      "python",
      "scripting",
      "débutant",
      "syntaxe"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Philosophie du Zen of Python et Typage Dynamique Fort",
        "description": "Comprendre pourquoi Python est différent. L'indentation n'est pas qu'esthétique, elle est sémantique.",
        "order": 1,
        "duration": "6 heures",
        "content": "Créé par Guido van Rossum en 1991, Python est conçu pour maximiser la lisibilité du code. Contrairement à C ou Java, il n'y a pas d'accolades `{}`. L'indentation stricte (4 espaces) délimite les blocs. Le langage est **dynamiquement typé** (le type est résolu à l'exécution) mais **fortement typé** (il ne mixera pas implicitement `\"A\" + 5`). Nous aborderons les variables, l'absence de point-virgule, le Garbage Collector silencieux, et l'import de modules via `import math` ou `from math import sqrt`. Enfin, vous découvrirez le mantra sacré : *The Zen of Python* (`import this`).",
        "objectives": [
          "Appliquer le standard PEP 8 d'écriture de style",
          "Comprendre un langage Interprété",
          "Manipuler des chaînes formatées (f-strings)"
        ],
        "exercises": [
          {
            "title": "Le Culte du F-String",
            "description": "En Python 3.6+, comment insérer la variable `age = 25` et l'expression mathématique `age * 2` dans une seule chaîne imprimée, de la manière la plus moderne ?",
            "difficulty": "Facile",
            "solution": "`print(f\"J'ai {age} ans et le double est {age * 2}.\")`\nLes f-strings combinent lisibilité absolue et évaluation en temps réel.",
            "hints": [
              "Mettez la lettre 'f' avant les guillemets et utilisez des accolades {}."
            ]
          },
          {
            "title": "Erreur de Typage Fort",
            "description": "Que se passe-t-il si vous tentez `x = \"3\" + 4` en Python par rapport au JavaScript ?",
            "difficulty": "Moyen",
            "solution": "JavaScript fera une conversion faible impliquant le résultat `\"34\"`. Python plantera via une fatale `TypeError: can only concatenate str to str`. C'est le typage fort qui protège des erreurs d'inattention fatales en production financière.",
            "hints": [
              "Est-ce que Python tente de sauver la mise en concaténant aveuglément ?"
            ]
          }
        ],
        "resources": [
          {
            "title": "Conférence sur le PEP 8 Python",
            "type": "article",
            "url": "https://peps.python.org/pep-0008/"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Les Collections Primitives (Listes, Tuples, Sets)",
        "description": "Le cœur de la modélisation des données. Les tableaux ultra-évolutifs natifs de Python.",
        "order": 2,
        "duration": "8 heures",
        "content": "Les tableaux C rigides sont remplacés en Python par la **Liste (`[]`)**, qui est hétérogène, redimensionnable et implémentée en C (CPython) comme un tableau dynamique de pointeurs. Nous traiterons le **Tuple (`()`)**, une liste immuable qui est hashable et beaucoup plus légère en mémoire vive, ainsi que le **Set (`{}`)**, modélisant la théorie des ensembles mathématiques (sans doublons, recherche O(1)). Vous apprendrez le *Slicing* magistral (`Liste[start:stop:step]`) pour découper les données en vol, et le unpacking (`a, b = [10, 20]`).",
        "objectives": [
          "Inverser une liste via Slicing `[::-1]`",
          "Différencier Mutabilité (Liste) et Immutabilité (Tuple)",
          "Dédoublonner 100 000 entrées en invoquant O(1) via un Set"
        ],
        "exercises": [
          {
            "title": "Le Slicing Mortel",
            "description": "Soit `T = [0, 1, 2, 3, 4, 5]`. Que renvoie la syntaxe `T[1:5:2]` ?",
            "difficulty": "Moyen",
            "solution": "`[1, 3]`. Le départ est à l'index 1 (soit le chiffre 1), la fin est avant l'index 5 (soit le chiffre 4), mais avec un Pas (Step) de 2. Il prend donc 1, ignore 2, prend 3, ignore 4.",
            "hints": [
              "[DEBUT_INCLUS : FIN_EXCLUE : INTERVALLE_DE_SAUT]"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Contrôle de Flux Avancé et Compréhensions",
        "description": "Boucles for natives versus Compréhension de listes (List Comprehension).",
        "order": 3,
        "duration": "8 heures",
        "content": "En Python, la boucle for classique `for(i=0;...;i++)` n'existe pas. Le langage utilise exclusivement une boucle for-each sur itérables : `for item in collection:`. Pour avoir un index, l'ingénieur fait appel au générateur `range()` ou `enumerate()`. La véritable révolution réside dans la **Compréhension de Listes**, une syntaxe d'une ligne, importée des langages fonctionnels purs (Haskell), qui alloue et filtre les données en code C interne pour une vitesse d'exécution stupéfiante : `[x*2 for x in base if x % 2 == 0]`.",
        "objectives": [
          "Abandonner l'itération à base de compteurs incrémentés",
          "Filtrer des structures de données en 1 seule ligne ultra-optimisée",
          "Maîtriser les blocs Try / Except / Finally"
        ],
        "exercises": [
          {
            "title": "Codez la Compréhension",
            "description": "Transformez ces lignes en UNE SEULE expression de LIST COMPREHENSION : \n`res = []`\n`for i in range(10):`\n  `if i > 5:`\n    `res.append(i**2)`",
            "difficulty": "Facile",
            "solution": "`res = [i**2 for i in range(10) if i > 5]`\nLa version moderne en compréhension fait moins d'appels de méthode append() et compile donc plus vite.",
            "hints": [
              "Formule visuelle : [RÉSULTAT pour VARIABLE dans PLAGE condition FILTRE]."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : La Puissance des Dictionnaires (Hash Maps O(1))",
        "description": "JSON natif. Clés, Valeurs et Hachage.",
        "order": 4,
        "duration": "8 heures",
        "content": "Le composant le plus important de tout langage backend moderne. Le **Dictionnaire (`dict`, `{key: value}`)**. Structure implémentant une Table de Hachage, permettant d'ajouter, lire, ou supprimer n'importe quelle donnée en complexité constante O(1), quel que soit le milliard d'entrées contenues. Apprenez à itérer avec `.items()`, à définir des valeurs par défaut élégamment avec `.get(key, default)`, et à fusionner deux immenses dictionnaires en une ligne avec l'opérateur de déballage `**`.",
        "objectives": [
          "Comprendre le Mapping des JSON API en Dictionnaires",
          "Bannir les KeyError via les requêtes `get()` sécurisées",
          "Naviguer sur les `.keys()` et `.values()` indépendament"
        ],
        "exercises": [
          {
            "title": "Extraction Robuste",
            "description": "Comment extraire l'âge (`user['age']`) si l'on n'est pas certain qu'elle existe, en affectant par défaut 'Inconnu' si la clé est absente, pour éviter de crasher le serveur ?",
            "difficulty": "Moyen",
            "solution": "`user.get('age', 'Inconnu')`. C'est le design pattern standard des API REST Backend, qui empêche la fameuse exception fatale de plantage applicatif (KeyError).",
            "hints": [
              "Une fonction Get qui propose un plan B de sécurité."
            ]
          }
        ],
        "resources": [
          {
            "title": "HashMap Data Visualization",
            "type": "article",
            "url": "https://fr.wikipedia.org/wiki/Table_de_hachage"
          }
        ]
      }
    ]
  },
  {
    "title": "Python - Niveau Intermédiaire : OOP & Fonctions Avancées",
    "description": "Devenez Ingénieur Logiciel. Modélisez votre code via l'Orienté Objet, les magies des décorateurs et les fonctions de traitement de première classe.",
    "category": "Programmation",
    "level": "Intermédiaire",
    "duration": "40 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 4.9,
    "students": 7600,
    "language": "python",
    "isFree": true,
    "tags": [
      "python",
      "oop",
      "fonctions",
      "intermédiaire"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Fonctions de 1ère classe, Lambda et Packing (*args)",
        "description": "Une fonction est un objet. Elle peut créer des fonctions, renvoyer des fonctions ou accepter n'importe quoi.",
        "order": 1,
        "duration": "10 heures",
        "content": "Les fonctions (`def`) sont des Objets (First-Class Citizens). Vous pourrez les stocker dans des listes ou les passer en argument de rappels (Callbacks). Nous étudierons l'anonymat brut via les expression `lambda x: x*2` souvent utilisées dans le tri (`sort(key=...)`) et la cartographie (`map()`). Surtout, la puissance modulaire des signatures à longueurs variables : le Packing et Unpacking avec `*args` (Tuple de paramètres infinis) et `**kwargs` (Dictionnaire d'arguments nommés infinis). La structure absolue de tout framework (Django, Flask).",
        "objectives": [
          "Passer manuellement `N` arguments dynamiquement via def f(*args)",
          "Comprendre les Closures (Fonction capturant l'environnement externe)",
          "Trier des dictionnaires complexes via clé avec un oneliner lambda"
        ],
        "exercises": [
          {
            "title": "Tri sur Composant Imbrique",
            "description": "Soit `users = [{'nom':'A', 'age':30}, {'nom':'B', 'age':20}]`. Triez cette liste par l'attribut `age` en Ordre décroissant sans importer de librairie en une seule ligne.",
            "difficulty": "Difficile",
            "solution": "`users.sort(key=lambda u: u['age'], reverse=True)`\nLa fonction lambda indique au moteur de tri interne (TimSort) de comparer spécifiquement les clés 'age' pour prendre sa décision, plutôt que le dictionnaire lui-même (qui générerait une erreur stricte en Python 3).",
            "hints": [
              "Utiliser le mot clef nommé `key` et injecter une mini-fonction factive dedans."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Programmation Orientée Objet (Classes & Instances)",
        "description": "Organisez les mondes complexes en usines d'objets interchangeables et sécurisés.",
        "order": 2,
        "duration": "10 heures",
        "content": "La transition vers l'architecture en composants. Le paradigme OOP (Object-Oriented Programming). Nous définirons les termes canoniques : Classe (Le Plan de construction), Instance (La Maison concrète bâtie), Attributs d'instance vs Attributs de classe. Vous apprendrez pourquoi toute méthode en Python exige le mot divin `self` en premier argument explicite (l'instance pointeur vers elle-même). Nous implémenterons le Constructeur sacré `__init__`, et le concept d'Encapsulation avec les attributs \"privés\" masqués par le Name-Mangling du préfixe `__`. L'Héritage et l'utilisation rigoureuse de `super()` finaliseront la pyramide OOP.",
        "objectives": [
          "Contruire des schémas de données orientés métiers (ex: `class BankAccount:`)",
          "Appeler un parent direct ou distant avec le mécanisme de résolution MRO",
          "Empêcher la collision fatale de variables via _Protected et __Private"
        ],
        "exercises": [
          {
            "title": "Le Cœur de l'Instance (Self)",
            "description": "Pourquoi faire `class Chien: def aboyer(): print(nom)` génèrera une erreur fatale à l'appel `rex.aboyer()`, et comment la réparer ?",
            "difficulty": "Moyen",
            "solution": "Lorsque l'on fait `rex.aboyer()`, le runtime traduit cela mathématiquement par `Chien.aboyer(rex)`. Il passe automatiquement l'instance 'rex' dans la méthode. Or, la définition `def aboyer():` ne demande aucun paramètre ! Solution : `def aboyer(self): print(self.nom)` pour capter l'instance entrante.",
            "hints": [
              "S'il y a des milliers de chiens, comment la fonction aboyer sait-elle QUEL nom aboyer ?"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Les Méthodes Dunder (Magic Methods)",
        "description": "Subjuguez le langage C sous-jacent. Apprenez à vos propres Objets à s'additionner mathématiquement.",
        "order": 3,
        "duration": "10 heures",
        "content": "Les Dunder Methods (Double Under-score) sont le secret professionnel de Python. Quand vous faites `3 + 2`, Python exécute secrètement `int(3).__add__(2)`. En redéfinissant ces méthodes dans *vos* classes personnalisées, vous leur donnez les pouvoirs primitifs des types natifs. Nous apprendrons à redéfinir : `__str__` (pour s'afficher sous forme lisible dans les logs), `__eq__` (pour dire comment comparer `Obj1 == Obj2`), `__add__` (pour additionner vos objets entre eux), et `__len__` (pour dire si votre objet est un contenant mesurable).",
        "objectives": [
          "Surcharger les opérateurs mathématiques classiques (+, -, *)",
          "Rendre vos propres classes itérables (`__iter__`, `__next__`)",
          "Faire réagir un Objet comme un tuple via des index (`__getitem__`)"
        ],
        "exercises": [
          {
            "title": "L'Égalité Profonde vs Identité",
            "description": "Si `A = MonObjet(10)` et `B = MonObjet(10)`. En Python, formellement, `A == B` renvoie Faux, malgré la valeur intérieure identique. Pourquoi ? Et quelle méthode surcharger pour que cela devienne Vrai ?",
            "difficulty": "Difficile",
            "solution": "Sans aide manuelle, `A == B` compare leur Identité dans la RAM (leurs Pointeur-Id), qui sont obligatoirement distinctes (deux objets séparés en mémoire tas). Il faut implémenter `def __eq__(self, other): return self.val == other.val` dans la classe pour apprendre à Python à comparer leurs \"Cœurs\" plutôt que leurs \"Boîtes\".",
            "hints": [
              "Ce sont deux jumeaux distincts. Si on dit qu'ils sont pareils, on parle de leur intérieur ou de leur place physique dans l'univers ?"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : La Magie Métatrancendante des Décorateurs (@)",
        "description": "Créer des enveloppes fonctionnelles sans toucher au code original. Le Graal de Flask et FastAPI.",
        "order": 4,
        "duration": "10 heures",
        "content": "Le Décorateur ou `@nom_du_decorateur`. C'est l'évolution logique des fonctions vues au chapitre 1 (Closures & Callbacks). C'est un pattern de conception permettant de 'wrapper' ou 'd'emballer' une fonction pour modifier son comportement avant et après son exécution, *sans* modifier son code sourcre de base. Nous créerons from scratch nos propres décorateurs (ex: un `@login_required` pour bloquer une route, un `@timer` pour chronométrer le temps d'exécution Big O), comprenant la fusion fine de la fonction Englobante, la fonction Interne, avec syntaxe universelle `*args, **kwargs`.",
        "objectives": [
          "Écrire un Wrapper de log performance universel de Zero",
          "Comprendre que `@decorator` équivaut à `func = decorator(func)`",
          "Préserver les méta-données d'origine avec `@wraps` from functools"
        ],
        "exercises": [
          {
            "title": "Le Loggueur Universel Décoratif",
            "description": "Expliquez ligne par ligne le flot d'exécution formel si une fonction `hello()` est décorée avec le `@log_db`.",
            "difficulty": "Difficile",
            "solution": "Au lancement du serveur, l'interprète Python lit `@log_db`. Il prend littéralement l'objet mémoire de la fonction `hello`, et le jette (passé en argument) dans la fonction mère `log_db`. La mère fabrique alors une sous-fonction `wrapper()` qui va 1) se connecter à la DB, 2) invoquer `hello()` réelle, 3) clore la DB, et finalement la mère RENVOIE the reference of `wrapper`. Depuis lors, pour le reste de sa vie, quand on appelle `hello()`, c'est actually `wrapper()` qui tourne secrètement. Décoration accomplie !",
            "hints": [
              "Il y a un remplacement par substitution de la véritable entité pointée !"
            ]
          }
        ],
        "resources": [
          {
            "title": "Comprendre les Modèles Wrappeurs Decorators",
            "type": "article",
            "url": "https://realpython.com/primer-on-python-decorators/"
          }
        ]
      }
    ]
  },
  {
    "title": "Python - Niveau Expert Mondiale : Concurrence, GIL et Génération",
    "description": "Contournez les limitations historiques du langage. Conquérez la Data-Science avec une efficacité mémoire totale et déchirez le GIL en Processus Indépendants.",
    "category": "Programmation",
    "level": "Avancé",
    "duration": "60 heures",
    "image": "https://images.unsplash.com/photo-1518770660439-4636190af475?w=800&q=80",
    "rating": 5,
    "students": 2350,
    "language": "python",
    "isFree": true,
    "tags": [
      "python",
      "asyncio",
      "multiprocessing",
      "expert",
      "GIL",
      "architectures"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Yield, Générateurs et Évaluation Paresseuse (Lazy Eval)",
        "description": "Comment charger 100 Téraoctets de données Wikipedia dans un ordinateur ayant seulement 8 Go de RAM.",
        "order": 1,
        "duration": "15 heures",
        "content": "Les listes classiques utilisent l'évaluation stricte : elles calculent et stockent le 1 Milliard d'entités entières en RAM, déclenchant un Memory Exhaust fatal. L'ultime solution réside dans l'utilisation exclusive du mot-clé divin `yield`. Le Générateur. Il ne fabrique qu'une unique donnée qu'il expulse à l'instant `t`, stockant uniquement son 'État Actuel' en mettant sa fonction en hibernation suspendue. Il dépense 92 Octets en mémoire, quelle que soit la quantité de données calculée. C'est l'essence du concept des Streams Node.js ou des Observables Java rependues en Data pipeline Python.",
        "objectives": [
          "Contruire une fonction de suspension contenant Yields multiples",
          "Comprendre le comportement manuel via l'opérateur intégré `next()`",
          "Gérer et capter gracieusement l'exception fatale globale `StopIteration`"
        ],
        "exercises": [
          {
            "title": "Hibernation Infinie",
            "description": "Écrivez le code d'un générateur d'ID (suite entière infinie pure : 0, 1, 2... jusqu'à l'effondrement de l'univers) en C, la boucle Malloc écraserait la RAM. Comment le faire en 4 lignes Python ?",
            "difficulty": "Moyen",
            "solution": "`def generateur_infini():`\n  `i = 0`\n  `while True:`\n    `yield i`\n    `i += 1`\nLe `while True` ne plantera JAMAIS le PC car il s'arrête (se met en pause) instantanément après la ligne yield et attendra d'être dérangé par `next(id_gen)` pour tourner un seul cran supplémentaire de plus de l'horloge système.",
            "hints": [
              "La boucle while est bloquée par l'expulsion de la variable. Elle s'endort."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Contexte Sécure (With) et Gestionnaires d'État natifs (ContextManagers)",
        "description": "Libérer une base MongoDB sur une exception inattendue. Plus rien ne fuira dans un backend de production.",
        "order": 2,
        "duration": "10 heures",
        "content": "Lorsqu'un script d'entreprise backend s'effondre en plein milieu d'une écriture sur SSD ou base de données avec une erreur 500, le fichier / le port réseau n'est jamais refermé, créant une hémorragie du serveur. Implémenter le bloc d'enveloppement strict `with open(...) as f:` est obligatoire. Nous construirons de zéro des classes personnalisées qui implémentent les Dunders finaux et intimes `__enter__` (qui s'active, configure, lock) et le grandiose `__exit__` (qui dépollue l'erreur, rollback la Query SQL ou lâche la mémoire peu importe le carnage intérieur qui s'est produit dans le scope).",
        "objectives": [
          "Construire une Classe Connector possédant `__enter__` et `__exit__`",
          "Déchiffrer les arguments `exc_type, exc_value, traceback` de l'Exit pour silencer/gérer les crash",
          "Créer des Transaction SQL sécurisées via le manager"
        ],
        "exercises": [
          {
            "title": "Le Verrou de Destruction Dunder",
            "description": "Dans le bloc `__exit__`, que signifie un retour de valeur booléenne formelle `return True` en réaction à une erreur fatale attrapée ?",
            "difficulty": "Difficile",
            "solution": "Si `__exit__` renvoie `True`, cela dit formellement au compilateur/interpreteur Python : \"L'exception (l'horreur fatale) qui s'est passée dans le bloc With a bien été gobée, traitée et digérée par moi. Ne crashe PAS le programme applicatif\". L'exception est suppresée silencieusement par le bloc With (Design Exception Swallowing).",
            "hints": [
              "Souhaitez-vous tuer l'alerte rouge, ou laisser alerter le monde entier du désastre ?"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : L'Ennemie Public Numéro Un — Le GIL (Global Interpreter Lock)",
        "description": "Comprendre pourquoi Python est, au fond de son cœur implémenté par C, fondamentalement mono-tâche. Et comment les Ingénieurs contournent ce mur pour survivre au Multicœur.",
        "order": 3,
        "duration": "20 heures",
        "content": "Le CPU de votre PC a 16 Cœurs. Si vous lancez 4 Threads en Java ou C++, la machine décuple sa vitesse globale. En Python, si vous lancez 4 Threads (`threading`), ils tourneront plus lentement qu'un seul Thread Unique linéaire ! 💣 Bienvenue dans le Global Interpreter Lock (GIL). Une hérésie pour protéger le ramassage de poubelles Garbage Collector. Tant qu'un Thread agit et interprète le bytecode CPython, le GIL verrouille TOUT l'interpréteur entier empéchant un Thread rival d'arriver (Exception : Opération d'Attente ou Temps I/O). Nous décortiquerons ce verrou infernal historique mathématiquement d'un pur point de vue ingénierie informatique C.",
        "objectives": [
          "Mesurer le Temps d'horloge de CPU-Bound Tasks avec et sans Threading pour assister à l'effondrement dû au GIL Context-Switching",
          "Identifier la différence vitale architecturale entre I/O Bound (Reséau/Disque) et CPU Bound (Calcul Crypto)"
        ],
        "exercises": [
          {
            "title": "L'Arnaque du Threading CPython",
            "description": "Pourquoi l'utilisation du module `threading` Python est pourtant PARFAITE pour crawler 500 pages Webs Google en même temps, mais TERRIBLE pour trouver des Nombres Premiers Cryptographiques géants ?",
            "difficulty": "Difficile",
            "solution": "Le crawl de Google est un cas dit 'I/O Bound' ou 'limité aux Entrées-Sorties'. Quand le Thread interroge Google, il passe 99% de sa vie de milliseconde à \"Attendre le réseau\". À cet instant physique, le Lock CPython du GIL se déverouille gracieusement, laissant tous les autres cœurs et threads faire la même chose. En revanche, le calcul de la cryptographie Mathématique (CPU Bound) demande de l'effort processeur pur sans s'arrêter. Les Threads vont alors se battre férocement pour conquérir le Mutex Lock CPython unique, gaspillant un milliard de cycles d'horloge Kernel en changements de contextes (L'enfer).",
            "hints": [
              "Qui a besoin d'utiliser activement la matière grise du processeur brut ?"
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Asynchronisme Absolu — AsyncIO et Multiprocessing",
        "description": "Détruire la limitation en scindant la machine en Processus isolés via C-OS level, ou utiliser le modèle événementiel du Web Node JS : asyncio.",
        "order": 4,
        "duration": "15 heures",
        "content": "Le vrai asynchrone est l'avenir suprême de l'architecture. Vous plongerez dans le code natif de la révolution Python >= 3.5 : Le module de Event Loop et des Coroutines (`async def`, `await`). L'illusion d'une concurrence immense sur 1 seul Thread, parfaite pour la construction de micro-services backend FastAPI ou websockets colossales de type Discord avec une utilisation mémoire minimale. Pour vaincre le GIL au niveau de la Data Analysis massive NumPy / Pandas, on enseignera le sacre du module `multiprocessing` : contourner le verrou de CPython en invoquant des vrais fork UNIX OS System complets (clonage absolu de la mémoire VM), permettant de violer le système en chargeant véritablement à 100% l'intégralité des N-Cœurs du processeur Intel de la machine sur des Threads indépendants.",
        "objectives": [
          "Construire la Boucle d'Événements Async (`asyncio.gather`) et libérer la charge asynchrone des requêtes SQL lourdes",
          "Comprendre et forker au minimum 16 Work Processers Isolés du CPython GIL via Multiprocessing.Pool Map",
          "Concevoir une architecture Data Massive Industrielle"
        ],
        "exercises": [
          {
            "title": "Multiprocessing Overhead",
            "description": "Pourquoi lancer un `Pool.map` de l'API `multiprocessing` ne doit JAMAIS être testé sur un array de petite taille contenant quelques centaines d'entiers mathématiques ?",
            "difficulty": "Difficile",
            "solution": "Créer un Process Kernel UNIX (Forking, Clonage Heap/Stack mémoire virtuels, Duplication File Descriptors Python, communication IPC et Pipes d'échanges (Pickling/Unpickling serializers) coûte des millions d'opérations systèmes et plusieurs dizaines de mégaoctets réels de RAM à instancier. La charge monstrueuse de la simple Création de processus étouffera et crashera toute optimisation algorithmique pour des données faibles. C'est l'Overhead Archétectural de l'Ingénierie OS système lourde de Pickling vs Computation.",
            "hints": [
              "Ouvririez-vous 10 usines Cimentières gigantesques pour briser seulement 5 cailloux ramassés au sol ?"
            ]
          }
        ],
        "resources": [
          {
            "title": "Python AsyncIO par la Pratique",
            "type": "article",
            "url": "https://realpython.com/async-io-python/"
          }
        ]
      }
    ]
  },
  {
    "title": "C++ - Niveau Débutant : Les Fondations de Fer",
    "description": "Maîtrisez le langage des systèmes hautes performances. Comprenez la mémoire, la compilation native et la syntaxe C++ moderne (C++11 à C++20).",
    "category": "Programmation",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1628155930542-3c7a64e2c833?w=800&q=80",
    "rating": 4.8,
    "students": 18500,
    "language": "cpp",
    "isFree": true,
    "tags": [
      "cpp",
      "C++",
      "débutant",
      "syntaxe",
      "système"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Compilation, Linking et le flux I/O Standard",
        "description": "Le passage du code source au binaire. Comprenez le rôle du compilateur (GCC/Clang) et la puissance des flux.",
        "order": 1,
        "duration": "6 heures",
        "content": "C++ est un langage compilé. Le processus comporte quatre étapes : 1) Préprocesseur (directives #), 2) Compilation (translation en assembleur), 3) Assemblage (code objet binaire), 4) Linking (résolution des adresses externes). Nous utiliserons `<iostream>` pour les entrées/sorties. Contrairement au `printf` du C, `std::cout` et `std::cin` sont des flux typés et sécurisés. Vous apprendrez l'importance du `namespace std` et pourquoi l'utilisation de `using namespace std;` est une pratique risquée en milieu professionnel.",
        "objectives": [
          "Configurer un environnement de compilation (g++)",
          "Manipuler les flux de sortie avec les manipulateurs (endl, hex, scientific)",
          "Distinguer les erreurs de compilation des erreurs de link"
        ],
        "exercises": [
          {
            "title": "Salut le Monde Typé",
            "description": "Créez un programme qui demande l'âge de l'utilisateur et l'affiche en format Hexadécimal via les manipulateurs de flux.",
            "difficulty": "Facile",
            "solution": "#include <iostream>\nint main() {\n  int age;\n  std::cout << \"Age ? \";\n  std::cin >> age;\n  std::cout << \"Hex: \" << std::hex << age << std::endl;\n  return 0;\n}",
            "hints": [
              "Utilisez std::hex pour modifier le comportement du flux cout."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Types Primitifs, Références et le Typage 'auto'",
        "description": "Gestion des données et passage de paramètres. Pourquoi les références C++ sont supérieures aux pointeurs C pour la sécurité.",
        "order": 2,
        "duration": "8 heures",
        "content": "C++ est statiquement et fortement typé. Nous explorerons les types scalaires (int, double, char) et le puissant `std::string`. Mais la révolution du C++ réside dans la **Référence (`&`)**. Une référence est un alias permanent pour un objet existant. Elle permet le passage de paramètres 'par référence' (sans copie, comme un pointeur) mais sans la syntaxe complexe ni le risque de nullité. Nous aborderons également `auto` (depuis C++11) qui permet au compilateur de déduire le type à l'initialisation, rendant le code plus maintenable sans sacrifier la performance.",
        "objectives": [
          "Différencier passage par valeur et passage par référence",
          "Utiliser auto pour les types complexes",
          "Comprendre le type booléen natif"
        ],
        "exercises": [
          {
            "title": "Le Swappeur Sécurisé",
            "description": "Écrivez une fonction `void swap(int& a, int& b)` qui échange les valeurs des deux entiers passés en argument sans utiliser de pointeurs.",
            "difficulty": "Moyen",
            "solution": "void swap(int& a, int& b) {\n  int temp = a;\n  a = b;\n  b = temp;\n}",
            "hints": [
              "Le symbole & après le type indique que vous travaillez sur l'original, pas une copie."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Structures de Contrôle et Fonctions Surchargées",
        "description": "Logique, boucles for-each modernes et polymorphisme statique (Surcharge).",
        "order": 3,
        "duration": "8 heures",
        "content": "Nous étudierons les structures de contrôle classiques (if, switch, while). La nouveauté majeure est la boucle **Range-based for loop** (`for(auto x : collection)`), beaucoup plus sûre et lisible. Nous aborderons ensuite la **Surcharge de Fonctions** (Overloading) : la capacité d'avoir plusieurs fonctions ayant le même nom mais des signatures (paramètres) différentes. C'est le premier pas vers le polymorphisme, où le compilateur choisit la bonne version au moment de la compilation.",
        "objectives": [
          "Utiliser la boucle for moderne sur des tableaux statiques",
          "Surcharger une fonction de calcul pour différents types (int, float)",
          "Bannir les macro-fonctions au profit des fonctions inline"
        ],
        "exercises": [
          {
            "title": "Calculateur Surchargé",
            "description": "Écrivez deux fonctions `carre`. L'une prend un int, l'autre un double. Elles retournent respectivement le carré de la valeur.",
            "difficulty": "Facile",
            "solution": "int carre(int n) { return n * n; }\ndouble carre(double n) { return n * n; }",
            "hints": [
              "Le compilateur distingue les fonctions par leurs arguments, pas par leur nom seul."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Mémoire Statique, Tableaux et Vector (Intro STL)",
        "description": "La pile vs le tas. Pourquoi std::vector est votre meilleur ami pour la gestion de listes.",
        "order": 4,
        "duration": "8 heures",
        "content": "Les tableaux C-style (`int arr[10]`) sont dangereux car ils ne connaissent pas leur propre taille. C++ introduit `std::vector` (via `<vector>`), un tableau dynamique de la STL qui gère sa propre mémoire. Il se redimensionne tout seul, possède une méthode `.size()` et garantit l'accès sécurisé aux données. Nous explorerons également la notion de **Const-Correctness** : utiliser `const` partout où la donnée ne doit pas changer pour aider le compilateur à optimiser le code et prévenir les bugs.",
        "objectives": [
          "Remplacer les tableaux fixes par des vecteurs",
          "Utiliser const pour protéger les arguments de fonctions",
          "Ajouter et supprimer des éléments dynamiquement avec push_back()"
        ],
        "exercises": [
          {
            "title": "Sommeur de Vecteur",
            "description": "Écrivez une fonction qui prend un `std::vector<int>` constant par référence et retourne la somme de ses éléments.",
            "difficulty": "Moyen",
            "solution": "int somme(const std::vector<int>& v) {\n  int s = 0;\n  for(int x : v) s += x;\n  return s;\n}",
            "hints": [
              "Passer par référence constante évite une copie lourde tout en garantissant que le vecteur ne sera pas modifié."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "C++ - Niveau Intermédiaire : L'Architecture Orientée Objet",
    "description": "Transformez votre code en composants robustes. Maîtrisez les classes, l'encapsulation, la STL et les premiers concepts de gestion mémoire.",
    "category": "Programmation",
    "level": "Intermédiaire",
    "duration": "45 heures",
    "image": "https://images.unsplash.com/photo-1598228723793-52759bba239c?w=800&q=80",
    "rating": 4.8,
    "students": 12000,
    "language": "cpp",
    "isFree": true,
    "tags": [
      "cpp",
      "OOP",
      "classes",
      "STL",
      "intermédiaire",
      "objets"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Classes, Objets et Encapsulation Réelle",
        "description": "Modélisez le monde réel. Comprenez la différence entre structure (C) et classe (C++).",
        "order": 1,
        "duration": "10 heures",
        "content": "Une Classe est un blueprint, un Objet est une instance. L'**Encapsulation** consiste à masquer les détails internes (`private`) et à exposer une interface (`public`). Nous étudierons les **Constructeurs** (incluant la liste d'initialisation, plus performante) et les **Destructeurs** (`~NomClasse`), cruciaux pour libérer les ressources. Vous apprendrez que par défaut, les membres d'une classe sont privés, contrairement à une struct où ils sont publics.",
        "objectives": [
          "Concevoir des classes avec des données privées et des accesseurs",
          "Utiliser la liste d'initialisation du constructeur",
          "Comprendre le cycle de vie d'un objet automatique"
        ],
        "exercises": [
          {
            "title": "La Classe CompteBancaire",
            "description": "Créez une classe avec un attribut privé 'solde'. Ajoutez des méthodes 'deposer' et 'consulter' (cette dernière doit être const).",
            "difficulty": "Moyen",
            "solution": "class Compte {\nprivate: double solde = 0;\npublic:\n  void deposer(double m) { solde += m; }\n  double consulter() const { return solde; }\n};",
            "hints": [
              "Une méthode qui ne modifie rien doit être marquée const."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : La Bibliothèque Standard (STL) : Algorithmes et Itérateurs",
        "description": "N'écrivez plus jamais une boucle de tri à la main. Maîtrisez les conteneurs et les algos génériques.",
        "order": 2,
        "duration": "12 heures",
        "content": "La STL repose sur trois piliers : Conteneurs (vector, list, map), Algorithmes (sort, find, transform) et Itérateurs (le pont entre les deux). Nous apprendrons à utiliser `std::sort` avec des fonctions personnalisées, et `std::map` pour gérer des paires clé-valeur avec une complexité logarithmique O(log n). Vous découvrirez comment les itérateurs abstraient la structure de données, permettant de trier un tableau aussi facilement qu'une liste chaînée.",
        "objectives": [
          "Manipuler std::map pour des dictionnaires",
          "Utiliser std::sort avec lambda expressions basiques",
          "Parcourir un conteneur via les itérateurs auto iterator"
        ],
        "exercises": [
          {
            "title": "Dictionnaire de Mots",
            "description": "Utilisez un `std::map<std::string, int>` pour compter les occurrences d'un mot dans une liste.",
            "difficulty": "Moyen",
            "solution": "std::map<std::string, int> counts;\nfor(auto s : mots) counts[s]++;",
            "hints": [
              "std::map crée automatiquement l'entrée avec 0 si la clé n'existe pas encore."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Héritage, Polymorphisme et Fonctions Virtuelles",
        "description": "Le cœur du design pattern. Apprenez à manipuler des objets hétérogènes via une interface commune.",
        "order": 3,
        "duration": "12 heures",
        "content": "L'héritage permet de spécialiser des comportements. Mais le vrai pouvoir vient du **Polymorphisme Dynamique**. Grâce au mot-clé `virtual`, vous pouvez appeler une méthode sur un pointeur/référence de classe de base, et C++ exécutera la version de la classe dérivée au runtime (via la VTable). C'est la base de tout framework extensible. Nous aborderons également les **Classes Abstraites** (interfaces) possédant des fonctions virtuelles pures (`= 0`).",
        "objectives": [
          "Implémenter une hiérarchie de classes cohérente",
          "Utiliser le mot-clé override pour la sécurité",
          "Comprendre pourquoi un destructeur de classe de base doit être virtual"
        ],
        "exercises": [
          {
            "title": "Formes Géométriques",
            "description": "Créez une classe Forme (abstraite) avec une méthode virtuelle pure aire(). Dérivez Cercle et Rectangle.",
            "difficulty": "Difficile",
            "solution": "class Forme { public: virtual double aire() const = 0; };\nclass Cercle : public Forme {\n  double r; public: Cercle(double r) : r(r) {}\n  double aire() const override { return 3.14 * r * r; }\n};",
            "hints": [
              "Le '= 0' rend la fonction virtuelle pure et la classe abstraite."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Gestion d'Exceptions et Robustesse",
        "description": "Prévenir le crash. Apprenez le mécanisme throw / try / catch pour gérer les erreurs inattendues.",
        "order": 4,
        "duration": "11 heures",
        "content": "Les erreurs ne doivent pas être ignorées. C++ propose un système d'exceptions structuré. Nous apprendrons à lancer des exceptions (`std::runtime_error`) et à les intercepter proprement. Surtout, nous aborderons la garantie d'exception et pourquoi il ne faut JAMAIS laisser une exception s'échapper d'un destructeur. C'est l'introduction au concept fondamental du RAII que nous approfondirons au niveau expert.",
        "objectives": [
          "Créer vos propres types d'exceptions",
          "Gérer les erreurs de ressource (fichier manquant, allocation échouée)",
          "Utiliser Noexcept pour l'optimisation"
        ],
        "exercises": [
          {
            "title": "Division Sécurisée",
            "description": "Créez une fonction de division qui lance une `std::invalid_argument` si le dénominateur est zéro.",
            "difficulty": "Moyen",
            "solution": "double div(double a, double b) {\n  if(b == 0) throw std::invalid_argument(\"Zero!\");\n  return a / b;\n}",
            "hints": [
              "Incluez <stdexcept> pour utiliser les exceptions standards."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "C++ - Niveau Expert Mondiale : L'Ingénierie de Haute Précision",
    "description": "Devenez un architecte système. Maîtrisez la gestion mémoire moderne, les templates, la programmation système et les optimisations bas niveau.",
    "category": "Programmation",
    "level": "Avancé",
    "duration": "65 heures",
    "image": "https://images.unsplash.com/photo-1518770660439-4636190af475?w=800&q=80",
    "rating": 4.9,
    "students": 7600,
    "language": "cpp",
    "isFree": true,
    "tags": [
      "cpp",
      "C++20",
      "smart pointers",
      "memory",
      "templates",
      "avancé",
      "système"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : RAII et Smart Pointers (Gestion Mémoire Moderne)",
        "description": "Bannissez 'new' et 'delete' de votre vocabulaire. Apprenez la gestion automatique des ressources.",
        "order": 1,
        "duration": "15 heures",
        "content": "L'idiome **RAII** (Resource Acquisition Is Initialization) est le cœur du C++ moderne. La ressource est liée à la durée de vie de l'objet. Nous étudierons les **Smart Pointers** (C++11+) : `std::unique_ptr` pour la propriété unique (zéro coût, transfert via move semantics) et `std::shared_ptr` pour la propriété partagée (comptage de référence). Nous apprendrons pourquoi les pointeurs nus ne doivent être utilisés que pour l'observation, jamais pour la propriété.",
        "objectives": [
          "Implémenter le pattern RAII pour n'importe quelle ressource (File, Socket, Mutex)",
          "Utiliser std::make_unique et std::make_shared",
          "Comprendre et éviter les cycles de référence avec std::weak_ptr"
        ],
        "exercises": [
          {
            "title": "Le Gestionnaire de Fichier RAII",
            "description": "Créez une classe qui ouvre un fichier dans le constructeur et le ferme AUTOMATIQUEMENT dans le destructeur, garantissant zéro fuite même en cas d'exception.",
            "difficulty": "Difficile",
            "solution": "class FileWrapper {\n  FILE* f;\npublic:\n  FileWrapper(const char* n) { f = fopen(n, \"r\"); }\n  ~FileWrapper() { if(f) fclose(f); }\n};",
            "hints": [
              "Le destructeur est appelé lors de la remontée de pile (Stack Unwinding) d'une exception."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Move Semantics et Rvalue References",
        "description": "Supprimez les copies inutiles. Apprenez à 'voler' le contenu des objets temporaires pour une performance maximale.",
        "order": 2,
        "duration": "15 heures",
        "content": "Introduit en C++11, le mouvement (`std::move`) permet de transférer les ressources d'un objet temporaire vers un nouvel objet au lieu de les copier. Nous étudierons les **Rvalue References (`&&`)**, le constructeur de mouvement et l'opérateur d'affectation par mouvement. Cela permet des performances proches du C tout en gardant des objets de haut niveau (comme des vecteurs de millions d'éléments). Nous aborderons également le concept de **Rule of Five**.",
        "objectives": [
          "Implémenter la Rule of Five pour une classe gérant des ressources",
          "Utiliser std::move pour optimiser les retours de fonctions",
          "Comprendre le Perfect Forwarding avec std::forward"
        ],
        "exercises": [
          {
            "title": "Le Constructeur de Mouvement",
            "description": "Pour une classe Buffer possédant un pointeur `int* data`, écrivez le constructeur de mouvement qui transfère le pointeur et met la source à nullptr.",
            "difficulty": "Difficile",
            "solution": "Buffer(Buffer&& other) noexcept {\n  data = other.data;\n  other.data = nullptr;\n}",
            "hints": [
              "N'oubliez pas de mettre la source à un état neutre (.data = nullptr) pour éviter un double-free."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Metaprogrammation et Templates Avancés",
        "description": "Générez du code à la compilation. Maîtrisez les templates, la spécialisation et les Concepts (C++20).",
        "order": 3,
        "duration": "20 heures",
        "content": "Les templates ne servent pas qu'aux vecteurs. Nous explorerons la programmation générique avancée : spécialisation de templates, variadic templates (`...`), et la SFINAE. Nous introduirons la révolution de **C++20 : les Concepts**. Ils permettent de poser des contraintes sémantiques sur les types templates, remplaçant les erreurs nébuleuses du compilateur par des messages clairs. C'est le sommet de l'abstraction C++.",
        "objectives": [
          "Écrire des fonctions variadiques de type Print(a, b, c...)",
          "Utiliser des Concepts pour restreindre un template aux nombres",
          "Comprendre le calcul à la compilation via constexpr"
        ],
        "exercises": [
          {
            "title": "Sommeur Universel (Templates)",
            "description": "Créez une fonction template `somme(T a, T b)` qui ne fonctionne QUE si T est un type numérique (via Concept ou static_assert).",
            "difficulty": "Difficile",
            "solution": "template<typename T>\nrequires std::is_arithmetic_v<T>\nT somme(T a, T b) { return a + b; }",
            "hints": [
              "Utilisez le header <type_traits> pour les tests de type."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Multithreading, Concurrence et Lock-Free",
        "description": "Parallélisez vos calculs. Exploitez tous les cœurs de votre processeur avec std::thread et les atomiques.",
        "order": 4,
        "duration": "15 heures",
        "content": "C++ offre un support natif pour le multithreading. Nous étudierons `std::thread`, les `std::mutex` pour la synchronisation, et les `std::future`/`std::promise` pour l'asynchronisme. Nous aborderons les pièges mortels (Deadlocks, Race Conditions) et comment les éviter via `std::lock_guard`. Enfin, nous jetterons un œil aux **Atomiques**, permettant des opérations sans verrou pour une performance extrême sur les données partagées.",
        "objectives": [
          "Lancer et synchroniser des threads",
          "Protéger une ressource partagée avec un mutex",
          "Utiliser std::async pour des tâches de fond"
        ],
        "exercises": [
          {
            "title": "Le Compteur Atomique",
            "description": "Créez une variable partagée incrémentée par 10 threads simultanément. Utilisez `std::atomic` pour garantir la justesse sans utiliser de Mutex lourd.",
            "difficulty": "Difficile",
            "solution": "std::atomic<int> count(0);\n// Dans le thread:\ncount++;",
            "hints": [
              "Les atomiques utilisent des instructions CPU spéciales beaucoup plus rapides que les verrous OS."
            ]
          }
        ],
        "resources": [
          {
            "title": "C++ Concurrency in Action",
            "type": "article",
            "url": "https://en.cppreference.com/w/cpp/thread"
          }
        ]
      }
    ]
  },
  {
    "title": "HTML - Niveau Débutant",
    "description": "L'ossature fondamentale du Web. Maîtrisez la syntaxe, la sémantique de base et l'imbrication des balises pour construire des documents robustes.",
    "category": "Web",
    "level": "Débutant",
    "duration": "15 heures",
    "image": "https://images.unsplash.com/photo-1616469829581-73993eb86b02?w=800&q=80",
    "rating": 4.8,
    "students": 42000,
    "language": "french",
    "isFree": true,
    "tags": [
      "HTML",
      "Web",
      "Débutant",
      "Architecture",
      "DOM"
    ],
    "chapters": [
      {
        "title": "1. Le Gène Primordial : Structure Logique",
        "description": "Comprendre l'anatomie stricte d'un document HTML5 valide.",
        "order": 1,
        "duration": "3 heures",
        "content": "Le HTML (HyperText Markup Language) est un langage de description, non de programmation. Il dicte la hiérarchie sémantique d'un document. La déclaration `<!DOCTYPE html>` force le navigateur en mode standard, évitant le 'quirks mode'. La racine `<html>` encapsule deux entités vitales : `<head>` (le cerveau métaphysique, invisible à l'œil, contenant encodage, titre et métadonnées SEO) et `<body>` (la chair physique, rendue par le moteur de rendu du navigateur). L'encodage `<meta charset=\"UTF-8\">` est crucial pour prévenir la corruption des caractères.",
        "objectives": [
          "Écrire le boilerplate HTML5 de mémoire et sans erreur.",
          "Distinguer le périmètre de la balise head par rapport au body.",
          "Comprendre l'implication de l'encodage des caractères."
        ],
        "exercises": [
          {
            "title": "L'Anatomie Minimale",
            "description": "Créez un document HTML5 strict contenant le titre 'Fondations' dans l'onglet et 'Hello World' affiché à l'écran.",
            "difficulty": "Facile",
            "solution": "<!DOCTYPE html>\\n<html lang=\"fr\">\\n<head>\\n  <meta charset=\"UTF-8\">\\n  <title>Fondations</title>\\n</head>\\n<body>\\n  Hello World\\n</body>\\n</html>",
            "hints": [
              "N'oubliez pas l'attribut lang sur l'élément racine pour l'accessibilité."
            ]
          }
        ],
        "resources": [
          {
            "title": "Anatomie d'un document HTML (MDN)",
            "type": "article",
            "url": "https://developer.mozilla.org/fr/docs/Learn/HTML/Introduction_to_HTML/Document_and_website_structure"
          }
        ]
      },
      {
        "title": "2. Hiérarchie et Typographie Sémantique",
        "description": "Titres, paragraphes et balises d'emphase logique.",
        "order": 2,
        "duration": "4 heures",
        "content": "Le texte brut n'a aucune valeur sémantique. L'arbre du document doit être balisé : `<h1>` à `<h6>` établissent la hiérarchie de l'information (crucial pour le SEO et les lecteurs d'écran). Règle d'or : un seul `<h1>` par page. Le texte courant vit dans `<p>`. Pour l'emphase, on privilégie le poids sémantique au rendu visuel : `<strong>` indique une forte importance (souvent rendu en gras), `<em>` marque une emphase rhétorique (souvent rendu en italique), remplaçant les anciens `<b>` et `<i>` visuels dépourvus de sens logiciel.",
        "objectives": [
          "Structurer le contenu textuel de manière logicielle.",
          "Saisir l'impact des balises sur l'accessibilité logicielle.",
          "Garantir une hiérarchie de titres stricte et linéaire sans saut."
        ],
        "exercises": [
          {
            "title": "Emphase Sémantique",
            "description": "Écrivez un titre principal 'Le Web', suivi d'un paragraphe où le mot 'vital' est marqué comme fortement important.",
            "difficulty": "Facile",
            "solution": "<h1>Le Web</h1>\\n<p>Ceci est <strong>vital</strong> pour la suite.</p>",
            "hints": [
              "Oubliez la balise b, pensez au poids de l'information."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Navigation et Ressaut : Les Ancres",
        "description": "Le concept d'HyperTexte et l'art de lier des documents.",
        "order": 3,
        "duration": "4 heures",
        "content": "L'essence même du World Wide Web réside dans la balise d'ancrage `<a>`. L'attribut `href` (Hypertext Reference) pointe vers une URI. On distingue les URL absolues (pointant vers d'autres domaines) des URL relatives (naviguant dans l'arborescence locale). L'attribut `target=\"_blank\"` permet d'ouvrir le lien dans un nouvel onglet, mais doit être couplé à `rel=\"noopener noreferrer\"` pour des raisons critiques de sécurité contre le reverse tabnabbing.",
        "objectives": [
          "Maîtriser les chemins d'accès relatifs ( ./ , ../ ).",
          "Construire des liens externes sécurisés.",
          "Lier vers un point précis de la même page grâce aux ancres nommées (#id)."
        ],
        "exercises": [
          {
            "title": "Lien Sécurisé",
            "description": "Générez un lien vers 'https://exemple.com', indiquant 'Visiter', s'ouvrant dans un nouvel onglet de façon sécurisée.",
            "difficulty": "Moyen",
            "solution": "<a href=\"https://exemple.com\" target=\"_blank\" rel=\"noopener noreferrer\">Visiter</a>",
            "hints": [
              "Le 'noopener' empêche la nouvelle page de prendre le contrôle de la page originelle via l'API window.opener."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Multimédia et Embedding",
        "description": "Intégration rigoureuse d'images et notion d'accessibilité visuelle.",
        "order": 4,
        "duration": "4 heures",
        "content": "L'intégration multimédia utilise des balises orphelines (auto-fermantes) comme `<img>`. L'attribut explicite `src` définit la source, mais l'attribut `alt` (texte alternatif) est non-négociable. Il sert de fallback si la ressource est brisée, de texte pour les crawlers d'indexation (Googlebot), et est oralisé par les screen-readers. Les bonnes pratiques exigent d'allouer explicitement les attributs `width` et `height` pour prévenir les 'Cumulative Layout Shifts' (sauts de mise en page inopinés) lors du chargement réseau.",
        "objectives": [
          "Intégrer des médias graphiques sans pénaliser la performance perceptuelle.",
          "Rédiger un attribut 'alt' pertinent et descriptif.",
          "Provoquer l'isolation de contenu avec les balises de type block et inline-block."
        ],
        "exercises": [
          {
            "title": "Image Référencée",
            "description": "Créez une image issue de 'logo.png' de 200px par 100px explicitant le texte 'Logotype'.",
            "difficulty": "Moyen",
            "solution": "<img src=\"logo.png\" alt=\"Logotype\" width=\"200\" height=\"100\">",
            "hints": [
              "Les attributs dimensionnels s'écrivent sans l'unité px en HTML brut."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "HTML - Niveau Intermédiaire",
    "description": "L'ingénierie de la page Web. Sémantique HTML5, structures tabulaires, isolation et formulaires transactionnels natifs.",
    "category": "Web",
    "level": "Intermédiaire",
    "duration": "20 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 4.9,
    "students": 28000,
    "language": "french",
    "isFree": true,
    "tags": [
      "HTML5",
      "Sémantique",
      "Formulaires",
      "Tableaux",
      "Intermédiaire"
    ],
    "chapters": [
      {
        "title": "1. Structuration Sémantique HTML5",
        "description": "Éradiquer le 'div-itis' en fragmentant le DOM avec sens.",
        "order": 1,
        "duration": "5 heures",
        "content": "L'évolution HTML5 a introduit des conteneurs qui ont une sémantique lourde pour l'arbre d'accessibilité et les algorithmes de recherche. La balise `<header>` délimite la zone d'en-tête, `<nav>` est strictement réservé à la navigation globale primaire, `<main>` encapsule le contenu unique (un seul par document), `<article>` définit un contenu auto-porteur syndicable (comme un billet de blog), tandis que `<section>` regroupe des éléments thématiques et demande souvent son propre sous-titre de hiérarchie.",
        "objectives": [
          "Cartographier et wireframer une application uniquement en balises sémantiques.",
          "Saisir la frontière floue entre un <article> et une <section>.",
          "Assembler une page modulaire logique pour le Document Outline."
        ],
        "exercises": [
          {
            "title": "Main et Navigation",
            "description": "Créez une ossature contenant un Main section, et à l'intérieur, un article portant un header.",
            "difficulty": "Moyen",
            "solution": "<main>\\n  <article>\\n    <header>\\n      <h2>Mon Sujet</h2>\\n    </header>\\n    <p>Contenu principal.</p>\\n  </article>\\n</main>",
            "hints": [
              "L'article doit pouvoir vivre seul hors de son contexte actuel."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "2. Les Données Tabulaires (Tables)",
        "description": "Manipulation matricielle stricte des données à deux dimensions.",
        "order": 2,
        "duration": "5 heures",
        "content": "Historiquement (et abusivement) utilisé pour le design complet des pages (Layout), le tag `<table>` est formellement cantonné à la restitution de données multidimensionnelles, ou data sets bruts. La construction est rigoureuse : un wrapper global contenant les lignes d'en-tête (thead), le corps principal (tbody), et les pieds synthétiques (tfoot). Les lignes sont des `<tr>` (Table Row) et les cellules `<td>` (Table Data) ou `<th>` (Table Heading). Les fusions de cellules s'y opèrent via les attributs 'colspan' et 'rowspan'.",
        "objectives": [
          "Dissocier strictement thead, tbody, et tfoot.",
          "Mettre en place l'attribut scope sur les th pour lier logiquement l'index à sa valeur text-to-speech.",
          "Pratiquer le Colspan/Rowspan mathématique sur une grille irrégulière."
        ],
        "exercises": [
          {
            "title": "Tableau Simple Sémantique",
            "description": "Créez une table basique avec thead et tbody, contenant 1 ligne d'en-tête (ID, Nom) et 1 ligne de data (1, Alice).",
            "difficulty": "Difficile",
            "solution": "<table>\\n  <thead>\\n    <tr>\\n      <th>ID</th>\\n      <th>Nom</th>\\n    </tr>\\n  </thead>\\n  <tbody>\\n    <tr>\\n      <td>1</td>\\n      <td>Alice</td>\\n    </tr>\\n  </tbody>\\n</table>",
            "hints": [
              "Une omission de tr pour wrapper les th ou td causera une cassure critique du DOM."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Formulaires et Inputs (Les I/Os du Web)",
        "description": "Gérer la mécanique primitive des entrées utilisateur.",
        "order": 3,
        "duration": "6 heures",
        "content": "Le `<form>` est le pont de communication central avec un serveur backend HTTP. L'attribut 'action' dicte l'URL cible d'ingestion des datas et 'method' la verbologie HTTP (GET ou POST). Les typologies `<input>` natives s'étendent des champs bruts (text, password, hidden) aux champs qualitatifs modifiant les claviers virtuels mobiles (email, number, tel) ou l'UI du navigateur systeme (date, color, file). Tout input actif **doit obligatoirement** se voir assigner l'attribut 'name' afin de figurer dans un Payload HTTP.",
        "objectives": [
          "Différencier conceptuellement le Form Data POST et un QueryParam GET natif.",
          "Maitriser les différents Input Types (Checkbox, Radio Grouping, Select/Options).",
          "Coupler sémantiquement chaque input avec une balise <label> utilisant 'for'."
        ],
        "exercises": [
          {
            "title": "Radio Grouping",
            "description": "Créez un groupe de deux boutons radios liés par le meme nom d'attribut 'choix', un pour 'Oui' (valeur 1) un pour 'Non' (valeur 0).",
            "difficulty": "Moyen",
            "solution": "<label>\\n  <input type=\"radio\" name=\"choix\" value=\"1\"> Oui\\n</label>\\n<label>\\n  <input type=\"radio\" name=\"choix\" value=\"0\"> Non\\n</label>",
            "hints": [
              "S'ils n'ont pas la sticte même valeur d'attribut name, ils ne seront pas mutuellement exclusifs sur interface."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Isolation avec IFrame",
        "description": "Le concept d'encapsulation de documents tiers.",
        "order": 4,
        "duration": "4 heures",
        "content": "L'élément `<iframe>` permet l'inclusion d'un document HTML (ou d'une source Media tiers type Youtube/Maps) dans le document parent. Ceci est fondamental dans la sécurité Cross-Origin. Les iframes modernes requièrent l'application d'un attribut 'sandbox' pour définir une politique d'isolation stricte (empêchant la ressource enfant d'invoquer des POPUPS javascript parent ou d'interagir nativement sur le TopWindowContext).",
        "objectives": [
          "Analyser le danger lié à l'intégration tierce aveugle.",
          "Manipuler l'attribut sandbox et analyser allow-same-origin, allow-scripts, allow-popups.",
          "Comprendre le blocage X-Frame-Options côté backend émis par le serveur externe injecté."
        ],
        "exercises": [
          {
            "title": "L'Iframe Isolé",
            "description": "Générez un Iframe vers src 'widget.html' en le bloquant totalement par un sandbox ultra restreint.",
            "difficulty": "Moyen",
            "solution": "<iframe src=\"widget.html\" sandbox title=\"Widget Tierce\"></iframe>",
            "hints": [
              "Sandbox sans paramètre d'exceptions coupe tous les scripts, l'envoi de forms et confine localement."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "HTML - Niveau Expert (Avancé)",
    "description": "L'ingénierie Frontend Absolue. Optimisation SEO, A11Y ARIA Poussée, Validation complexe et APIs HTML5 natives.",
    "category": "Web",
    "level": "Avancé",
    "duration": "25 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 4.9,
    "students": 19500,
    "language": "french",
    "isFree": true,
    "tags": [
      "Accessibilité",
      "ARIA",
      "Canvas",
      "API HTML5",
      "SEO Avancé"
    ],
    "chapters": [
      {
        "title": "1. Le Métamodèle : HEAD et SEO Industriel",
        "description": "Forger la machine de guerre pour les robots d'indexation (Crawlers).",
        "order": 1,
        "duration": "5 heures",
        "content": "La balise head n'est pas limitée aux simples balises titre. Son arsenal englobe la métadonnée canonique (qui prévient la pénalité de contenu dupliqué (Duplicate Content Penalty) : `<link rel=\"canonical\">`), la définition de l'OpenGraph (og:title, og:image) pour piloter dynamiquement le comportement graphique du site posté sur Twitter, Facebook ou Linkedin, le paramétrage lourd du viewport et les Pre-loads agressifs (`<link rel=\"preload\">`) qui indiquent au navigateur de télécharger urgemment une police ou un script bloquant de rendu avant sa découverte naturelle.",
        "objectives": [
          "Assumer la direction de la politique d'indexation avec 'robots' meta tags.",
          "Ecrire la grappe exhaustive OpenGraph protocol (OG).",
          "Orchestrer le ressource-hinting manuel (dns-prefetch, preconnect)."
        ],
        "exercises": [
          {
            "title": "Meta Viewport et Canonique",
            "description": "Declarez un document avec l'url canonique 'https://site.com' et une meta viewport standard pour rendre le site mobile-responsive.",
            "difficulty": "Difficile",
            "solution": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\\n<link rel=\"canonical\" href=\"https://site.com\">",
            "hints": [
              "Width=device-width est la clé de voûte de l'intelligence artificielle du scaling et média-queries."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "2. Validation Native Complexe (Regex HTML5)",
        "description": "Le bouclier Frontend sans JavaScript via pattern attr.",
        "order": 2,
        "duration": "6 heures",
        "content": "HTML5 inclut nativement une machine de validation de données lourdes sans l'intervention d'aucun EventListener Javascript. En couplant l'attribut 'pattern' avec une expression régulière syntaxique sur un input de type texte, nous forçons le contrôle côté client local. Associé avec 'minlength', 'maxlength' et les contraintes step/min/max sur les Input Numeriques, ainsi qu'a la pseudo-classe CSS :invalid, on génère une UI robuste avec des messages API pseudo-customs gérés par le navigateur natif OS.",
        "objectives": [
          "Manipuler une validation RegEx dans un attribut patten='\\[a-z]{3}'.",
          "Coupler un Input text invalidé avec un message d'altération en bulle UI",
          "Maîtriser logiciellement les inputs inactifs (disabled vs readonly) pour validation finale server-side."
        ],
        "exercises": [
          {
            "title": "Le TextField sous Regex Strict",
            "description": "Créez un Input de type texte ne permettant d'entrer STRICTEMENT QUE 3 chiffres, en le rendant requis.",
            "difficulty": "Difficile",
            "solution": "<input type=\"text\" pattern=\"[0-9]{3}\" required>",
            "hints": [
              "Pensez à utiliser le pattern d'expression rationelle native et le flag required natif."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Accessibilité Avancée : ARIA Roles & États",
        "description": "Régir l'arbre d'Accessibilité via WAI-ARIA.",
        "order": 3,
        "duration": "8 heures",
        "content": "Si le HTML sémantique fait défaut (ex: un <div> artificiellement grimé comme un bouton avec JS), spécification WAI-ARIA comble le trou cognitif pour les screen-readers. Les rôles (ex: `role=\"button\"`, `role=\"alert\"`) et les états polymorphes (`aria-expanded=\"true\"`, `aria-hidden=\"true\"`) informent dynamiquement un logiciel vocal des métamorphoses d'une IHM moderne. `aria-live=\"polite\"` indique au lecteur écraniel qu'un fragment a varié en arrière-plan et doit être articulé à la fin de la phrase en cours.",
        "objectives": [
          "Comprendre le fonctionnement d'un logiciel de synthèse vocale ScreenReader/TalkBack",
          "Redéfinir le bouton Div artificiel avec role et le Focus State TabIndex attr.",
          "Saisir la subtilité absolue entre role=\"alert\" et aria-live=\"polite\"."
        ],
        "exercises": [
          {
            "title": "L'Alerte Live",
            "description": "Créez une Div qui annoncera urgemment son text (Error 500) à un screen reader sans attendre la fin d'une phrase (assertive), avec le role alert.",
            "difficulty": "Difficile",
            "solution": "<div role=\"alert\" aria-live=\"assertive\">Error 500</div>",
            "hints": [
              "Assertive force le screenreader à couper toute activité pour hurler votre erreur critique logicielle."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Les APIs HTML5 Brutes (Data, Dialog, Canvas)",
        "description": "S'interfacer avec l'écosystème interactif JavaScript.",
        "order": 4,
        "duration": "6 heures",
        "content": "Le balisage se complexifie en apportant de la meta-logic en isolation. L'utilisation du `dataset` (les attributs standards commençants par `data-*` tels que `data-user-id=\"42\"`) permet d'encrypter l'état dans l'Architecture DOM statique sans enfreindre la validation W3C. Pour du rendering 2D/3D GPU accéléré brut en JS direct, `<canvas>` détient la clé. Finalement, la balise de pointe `<dialog>` standardise les modalités natives modales (overlay), éliminant de gigantesques librairies JS pour une solution Browser Backend en un claquement de doigt, invocable nativement via Element.showModal()",
        "objectives": [
          "Manipuler des attributs de donnée isolants W3C-Stricts 'data-*'.",
          "Instancier un élément Canvas standard paramétré en dimension absolue vs relative.",
          "Construire la balise <dialog> pour invoquer des Overlays et gérant l'emprisonnement de contexte (Focus Trap) naturel."
        ],
        "exercises": [
          {
            "title": "Data Attribut et Modal",
            "description": "Créez une balise dialog, avec une div possédant l'attribut data-id=\"99\" à l'intérieur.",
            "difficulty": "Difficile",
            "solution": "<dialog>\\n  <div data-id=\"99\">Donnée interne</div>\\n</dialog>",
            "hints": [
              "L'attribut prend le nom prefixe conventionel de 'data-'"
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "CSS - Niveau Débutant",
    "description": "Peignez et sculptez le Web. Comprenez la cascade, l'héritage, et le modèle de boîte fondamental pour donner vie à vos structures HTML.",
    "category": "Web",
    "level": "Débutant",
    "duration": "18 heures",
    "image": "https://images.unsplash.com/photo-1507721999472-8ed4421c4af2?w=800&q=80",
    "rating": 4.8,
    "students": 35000,
    "language": "french",
    "isFree": true,
    "tags": [
      "CSS",
      "Design",
      "Débutant",
      "Box Model",
      "Typographie"
    ],
    "chapters": [
      {
        "title": "1. La Cascade et le Ciblage (Sélecteurs)",
        "description": "Le principe fondamental de CSS : cibler pour styliser, avec précision mathématique.",
        "order": 1,
        "duration": "4 heures",
        "content": "CSS (Cascading Style Sheets) fonctionne sur deux dogmes : l'Héritage (un enfant hérite des styles typographiques de son parent) et la Cascade (règles de résolution des conflits). Pour styliser, le moteur de rendu a besoin d'une cible. Les sélecteurs primitifs sont : l'Élément (ex: `p`), la Classe (`.carte-profil`, réutilisable à l'infini) et l'Identifiant (`#menu-principal`, unique dans le DOM). La best practice moderne interdit presqu'entièrement le stylage par ID (trop lourd en spécificité). On liera le fichier via `<link rel=\"stylesheet\" href=\"style.css\">`.",
        "objectives": [
          "Lier une feuille de style externe au HTML.",
          "Maîtriser le triptyque : Sélecteur d'élément, Classe et Identifiant.",
          "Saisir pourquoi la classe est l'unité de mesure préférentielle de facto."
        ],
        "exercises": [
          {
            "title": "Priorité de Classe",
            "description": "Ciblez une classe '.texte-urgent' et donnez au texte la couleur rouge 'red' et un fond 'black'.",
            "difficulty": "Facile",
            "solution": ".texte-urgent {\\n  color: red;\\n  background-color: black;\\n}",
            "hints": [
              "N'appliquez jamais de majuscules aux noms de vos classes, préférez le kebab-case (mots-séparés-par-tirets)."
            ]
          }
        ],
        "resources": [
          {
            "title": "La Spécificité CSS (MDN)",
            "type": "article",
            "url": "https://developer.mozilla.org/fr/docs/Web/CSS/Specificity"
          }
        ]
      },
      {
        "title": "2. Typographie et Philosophie des Couleurs",
        "description": "Hiérarchie visuelle, espaces et gestion du spectre colorimétrique.",
        "order": 2,
        "duration": "4 heures",
        "content": "La lecture est l'action #1 sur le Web. Les propriétés typographiques fondamentales incluent `font-family` (la pile de polices avec fallbacks natifs), `font-size` (la taille, idéalement en `rem` pour l'accessibilité), `font-weight` (la graisse, de 100 à 900) et `line-height` (l'interlignage pour faire respirer le texte). Les couleurs se définissent traditionnellement en codes Hexadécimaux (ex: `#1a1a1a`), mais le web moderne favorise grandement `rgb/rgba` et surtout `hsl` (Teinte, Saturation, Luminosité) pour créer des palettes mathématiquement cohérentes.",
        "objectives": [
          "Varier la graisse d'un texte et nettoyer le style de base.",
          "Configurer les couleurs via la fonction hsl() avec alpha (transparence).",
          "Aérer un paragraphe pour le rendre lisible."
        ],
        "exercises": [
          {
            "title": "Titre Aérien et Opaque",
            "description": "Ciblez tous les <h1>. Centrer le texte, mettre la taille à 40px et forcer une opacité couleur (color) fondé sur rgb() rouge (255, 0, 0).",
            "difficulty": "Moyen",
            "solution": "h1 {\\n  text-align: center;\\n  font-size: 40px;\\n  color: rgb(255, 0, 0);\\n}",
            "hints": [
              "Le rgb prend trois arguments de 0 à 255."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Le Modèle de Boîte (Box Model)",
        "description": "Padding, Border, Margin : le dogme dimensionnel du Web.",
        "order": 3,
        "duration": "6 heures",
        "content": "Tout élément rendu en HTML est un rectangle. Le CSS gère les distances de ce rectangle via un oignon mathématique à 3 couches partant du texte vers l'extérieur : Le `padding` (le rembourrage ou espace intérieur), la `border` (la bordure potentiellement visible et tracée), et finalement la `margin` (la marge repoussante extérieure qui n'a ni couleur ni fond, son seul but est l'espacement). Par défaut, Width = Contenu + Padding + Border. Pour éviter les maux de tête de calcul, le web entier applique le reset universel `* { box-sizing: border-box; }` qui force la largeur donnée à englober la bordure et le padding.",
        "objectives": [
          "Disséquer le layout navigateur pour y comprendre le Box Model.",
          "Créer un bouton harmonieux avec des Paddings plus importants sur l'axe horizontal.",
          "Appliquer universellement le Reset border-box."
        ],
        "exercises": [
          {
            "title": "Construction de Boîte",
            "description": "Ciblez l'id '#carte'. Mettez un padding global de 20px, une bordure solide de 2px noire (black), et une marge basse de 15px.",
            "difficulty": "Moyen",
            "solution": "#carte {\\n  padding: 20px;\\n  border: 2px solid black;\\n  margin-bottom: 15px;\\n}",
            "hints": [
              "La bordure demande 3 valeurs: épaisseur, type de ligne, couleur."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Le Flux Normal : Inline vs Block",
        "description": "Comprendre pourquoi certains éléments sautent des lignes et d'autres non.",
        "order": 4,
        "duration": "4 heures",
        "content": "Dans le flux normal de rendu de la page, tout élément possède une valeur `display` native. Les éléments `block` (comme `<div>`, `<h1>`, `<p>`) s'empilent verticalement, prennent 100% de la largeur du parent par défaut et forcent un saut de ligne. Les éléments `inline` (comme `<span>`, `<a>`, `<strong>`) cohabitent sur la même ligne, enveloppent leur contenu stricto-sensu, et ignorent purement et simplement les marges hautes et basses (`margin-top`/`margin-bottom`) ou largeurs manuelles associées qu'on essaierait de leur imposer ! D'où l'existence hybride magique de `inline-block` pour les boutons.",
        "objectives": [
          "Savoir pourquoi un width imposé sur un lien <a> ne fonctionne pas nativement.",
          "Métamorphoser un élément 'Inline' en 'Block' pour lui imposer des dimensions.",
          "Transformer un <div> pour côtoyer un voisin sur sa droite horizontale."
        ],
        "exercises": [
          {
            "title": "Le Span Rebelle",
            "description": "Ciblez un élément <span> générique. Forcez-le à agir comme un block et donnez-lui une largeur de 200px exactement.",
            "difficulty": "Facile",
            "solution": "span {\\n  display: block;\\n  width: 200px;\\n}",
            "hints": [
              "Sans le display block, la déclaration de width sera jetée à la poubelle par le moteur."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "CSS - Niveau Intermédiaire",
    "description": "Orchestrez l'architecture et la structuration géométrique. Maîtrisez Flexbox, les positionnements hors-flux et l'architecture CSS OOCSS/BEM.",
    "category": "Web",
    "level": "Intermédiaire",
    "duration": "24 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 4.9,
    "students": 22000,
    "language": "french",
    "isFree": true,
    "tags": [
      "Flexbox",
      "Architecture",
      "BEM",
      "Positionnement",
      "Layouts"
    ],
    "chapters": [
      {
        "title": "1. Le Saint Graal Unidimensionnel : Flexbox",
        "description": "Le layout modulable, l'alignement divin et la répartition des espaces.",
        "order": 1,
        "duration": "8 heures",
        "content": "Le Flexible Box Module (Flexbox) a pulvérisé les Hacks mortuaires historiques (Float, Table-layout). Déclaré sur un container parent `display: flex;`, il transforme sur-le-champ l'axe du repère. Ses enfants (les flex-items) se placent en file indienne (`flex-direction: row` ou `column`). L'entité fondamentale pilote la distribution des espaces vierges horizontaux sur l'axe principal via `justify-content` (ex: `center`, `space-between`) et aligne verticalement avec `align-items` (axe transversal).",
        "objectives": [
          "Centrer indubitablement n'importe quel élément logiquement et verticalement avec 3 lignes de code.",
          "Renverser l'axe de progression (column-reverse).",
          "Ajuster la croissance flex (flex-grow) d'un enfant unique pour remplir l'espace rémanent."
        ],
        "exercises": [
          {
            "title": "Le Parfait Centrage",
            "description": "Ciblez une classe '.hero-section', assignez-lui flex, et centrez absolument tout son contenu verticalement et horizontalement.",
            "difficulty": "Difficile",
            "solution": ".hero-section {\\n  display: flex;\\n  justify-content: center;\\n  align-items: center;\\n}",
            "hints": [
              "Assurez-vous de manipuler l'alignement sur les DEUX axes (principal et croisé)."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "2. Spacialisation Hors-Flux : Positionnement Manuel",
        "description": "Briser la physique de la page en décrochant des éléments du sol avec Relative, Absolute et Fixed.",
        "order": 2,
        "duration": "6 heures",
        "content": "Lorsqu'on assigne à un élément une `position: relative`, sa case mémoire dans l'arbre ne bouge pas, mais on peut le décaler visuellement avec `top`, `bottom`, `left`, `right`. En l'assignant en `position: absolute`, le bloc déchire ses chaînes physiques : tout le layout se reforme comme s'il n'avait jamais existé. Il se colle alors aux bords géométriques de son prmier parent dit 'positionné' (souvent rendu Relative à cet effet). La `position: fixed` fait la même magie mais par rapport à un parent invariant immuable : l'Écran Vieport de verre du navigateur, parfait pour une Navbar statique au scroll.",
        "objectives": [
          "Créer une info-bulle flottante au-dessus d'une carte d'utilisateur sans détruire le CSS avoisinant.",
          "Maîtriser le triptyque : le Parent est 'Relative', l'Enfant 'Absolute'.",
          "Orchestrer l'indexation de profondeur avec le redoutable 'z-index'."
        ],
        "exercises": [
          {
            "title": "Pastille Notification",
            "description": "Ciblez la classe '.pastille'. Détachez-la du flux normal (absolute) pour la pincer mathématiquement à 0px du nord (top) et 0px de l'est (right).",
            "difficulty": "Moyen",
            "solution": ".pastille {\\n  position: absolute;\\n  top: 0;\\n  right: 0;\\n}",
            "hints": [
              "En position Absolute, le display inline/block naturel devient obsolète."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Sticky et Fondamentaux d'Architecture (BEM)",
        "description": "L'hybride collant et comment ne pas pondre une soupe CSS spaghetti de mille lignes inmaintenable.",
        "order": 3,
        "duration": "6 heures",
        "content": "La `position: sticky` est une évolution de l'ingénierie CSS moderne. Relative lors du comportement naturel, elle se pétrifie en Fixed instantanément si le défilement navigateur tend à l'expulser de la vue (tel un header de tableur). Cependant, le défi du design CSS n'est pas ce que réalise une technologie, mais comment elle sera perçu par 5 autres codeurs ! L'intégration de la méthodologie BEM (Block, Element, Modifier) norme notre écriture. Une carte est `.card`, son image interne dépendante `.card__image`, et sa version danger rouge mutée devient `.card--danger`.",
        "objectives": [
          "Manipuler Sticky pour construire un layout de lecture fluide (Table Of Contents).",
          "Implémenter une nomenclature de naming des classes BEM rigoureuse.",
          "Interdire psychologiquement l'utilisation de sélecteurs imbriqués brutaux ('nav ul li a:hover') pour l'OOCSS flat (orienté objet CSS)."
        ],
        "exercises": [
          {
            "title": "Syntaxe BEM Stricte",
            "description": "Écrivez une classe pour manipuler la couleur bleu d'un élément Modifier (qui caractérise le succès) de la composante 'bouton'.",
            "difficulty": "Facile",
            "solution": ".bouton--succes {\\n  background-color: blue;\\n}",
            "hints": [
              "Un Modifier s'écrit toujours avec le parent suivi d'un double tiret '--' selon le dogme BEM."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Esthétique Graphique : Ombres, Dégradés et Filtres",
        "description": "Atteindre la claque visuelle du Glassmorphism en CSS pur natif.",
        "order": 4,
        "duration": "4 heures",
        "content": "CSS donne un panel graphique digne de Photoshop. La propriété complexe `box-shadow: X Y Blur Spread Couleur` ajoute de la consistance aux cartes. Les typologies de fond ne se limitent plus à la simple teinte flat : la fonction native algorithmique `linear-gradient` dessine par interpolation. Les filtres CSS récents via `backdrop-filter: blur(10px)` permettent de flouter ce qui se trouve physiquement *derrière* une div semi-transparente, instaurant la tendance architecturale du Glassmorphism (l'illusion de verre poli) et l'effet OS d'Apple.",
        "objectives": [
          "Sculpter et affiner un Box-Shadow très léger et allongé (Modern Soft Shadow).",
          "Générer un Linear-gradient vectoriel diagonale à 45 degrés.",
          "Saisir l'interaction lourde en performance GPU de l'attribut backdrop-filter."
        ],
        "exercises": [
          {
            "title": "L'Ombre Soft",
            "description": "Appliquez à '.box' une ombre portée (box-shadow) axée Y vers le bas de 10px, sans décalage X (0), avec 15px de flou blur et colorée 'rgba(0,0,0,0.1)'.",
            "difficulty": "Moyen",
            "solution": ".box {\\n  box-shadow: 0 10px 15px rgba(0,0,0,0.1);\\n}",
            "hints": [
              "Les arguments sont dans l'ordre strict: ox, oy, blur, couleur."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "CSS - Niveau Expert (Avancé)",
    "description": "Devenez un Ingénieur de Rendu CSS. Maîtrisez la grille mathématique CSS Grid, l'interactivité dynamique via Keyframes 3D, Custom Properties pour les thèmes OS, et les requêtes réactives modernes.",
    "category": "Web",
    "level": "Avancé",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1542831371-29b0f74f9713?w=800&q=80",
    "rating": 5,
    "students": 15400,
    "language": "french",
    "isFree": true,
    "tags": [
      "CSS Grid",
      "Animations Keyframes",
      "Variables Natives",
      "Media Queries",
      "Container Queries"
    ],
    "chapters": [
      {
        "title": "1. La Singularité Bidimensionnelle : CSS Grid Layout",
        "description": "Le summum de la distribution spatiale pour les tableaux de bord matriciels complexes.",
        "order": 1,
        "duration": "8 heures",
        "content": "Si Flexbox est unidimensionnel, Grid est omnipotent. Avec `display: grid;`, vous déclarez un échiquier conceptuel. La commande `grid-template-columns: repeat(3, 1fr)` crée sur ordre trois pistes de 33% chacune. Mais la révolution absolue de puissance s'observe via l'asymétrie avec `grid-template-areas` pour faire du Layout visuel à base de chaîne de caractères ASCII : `'header header' 'sidebar main' 'footer footer'`. Ce paradigme rend les Wireframes de designers vivants sans aucun div inutile d'encapsulation (wrapping markup).",
        "objectives": [
          "Comprendre l'unité Fr (Fractional Space) régissant la philosophie Grid.",
          "Positionner un composant précis au millimètre (grid-column: 1 / 3).",
          "Construire la maquette classique Holy Grail avec 'grid-template-areas'."
        ],
        "exercises": [
          {
            "title": "La Grille Auto-Adaptative 12 Colonnes",
            "description": "Créez une classe '.grille'. Forcez-la en display grid et exigez l'apparition de 12 colonnes, chacune de 1 fraction d'espace.",
            "difficulty": "Difficile",
            "solution": ".grille {\\n  display: grid;\\n  grid-template-columns: repeat(12, 1fr);\\n}",
            "hints": [
              "La fonction repeat() économise de la dette visuelle dans votre CSS."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "2. Mouvement Cinétique : Transitions & Animations (@keyframes)",
        "description": "Lisser l'Axe Temporel UX et animer les vecteurs sans javascript lourd.",
        "order": 2,
        "duration": "8 heures",
        "content": "Les micro-interactions fidélisent fortement. L'attribut combiné universel `transition: all 0.3s ease-in-out;` fluidifie les altérations arbitraires lors de pseudo-classes `:hover` ou `:focus`. Pour les séquences chorégraphiques autonomes, nous utilisons la syntaxe `@keyframes name_anim { 0% { ... } 100% { ... } }`. Le processeur graphique CSS implémente `transform: translate()` et `scale()`. Attention : Seules les propriétés d'Opacité et de Transformation doivent être animées, car toute modification temporelle de Margin ou Contenu recompose toute la grille vectorielle de la page à 60 Fps, entraînant de majeurs Drop-Frames UX (Jank effect).",
        "objectives": [
          "Créer une Timeline temporelle purement CSS avec @keyframes.",
          "Invoquer la courbe de Bézier paramétrique (Cubic-Bezier) de l'animation.",
          "Savoir pourquoi animer Width est mortel pour les performances CPU client vs Scale GPU."
        ],
        "exercises": [
          {
            "title": "La Pulsation du Cœur",
            "description": "Créez une règle keyframes nommée 'pulse' qui, à son apogée absolue de 50%, provoque un scale() d'un coefficient 1.2 sur les éléments.",
            "difficulty": "Difficile",
            "solution": "@keyframes pulse {\\n  50% {\\n    transform: scale(1.2);\\n  }\\n}",
            "hints": [
              "N'oubliez pas l'identificateur (nom) strict de votre groupe à côté de @keyframes."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Architecture Thématique & Custom Properties (Variables CSS)",
        "description": "Centralisation des sources de vérité et mise en œuvre du Dark Mode par mutation native.",
        "order": 3,
        "duration": "6 heures",
        "content": "SASS/SCSS ont créé l'industrie de la variable précompilée statique. Mais les Custom Properties HTML5 (`--ma-variable: 10px;`) vivent en Direct-Memory au rendu Client Navigateur (Runtime). Elles s'encapsulent typiquement dans le scope root de priorité maximale `:root`. Leur immense puissance apparait face à JavaScript car on peut muter de l'UI entière (`document.documentElement.style.setProperty('--fond', 'black')`) sur toute une application React/Vue. Découpez une charte : Primitives (Bleu-500) encapsulées dans la Semanticité (Bouton-Action-Couleur).",
        "objectives": [
          "Manipuler une cascade avec double-dash et la fonction de fallback d'affectation var(--x, red).",
          "Redéfinir le scope temporel de la variable au niveau du Media Query d'ombre.",
          "Différencier la primitive du token de sémantique design système."
        ],
        "exercises": [
          {
            "title": "Bouton Thématique Primaire",
            "description": "Dans la classe statique :root, définissez la variable --primary à '#007bff'. Puis utiliser var() pour mettre la background-color de '.btn' à la primitive primary.",
            "difficulty": "Moyen",
            "solution": ":root {\\n  --primary: #007bff;\\n}\\n.btn {\\n  background-color: var(--primary);\\n}",
            "hints": [
              "En cascade, la fonction est rigoureusement var(nom)."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Élasticité Moderne (Media Queries vs Container Queries)",
        "description": "L'intelligence redoutable contextuelle. Comment s'adapter aux Viewports d'appareils et, l'ultime norme : s'adapter à l'espace Parent immédiat.",
        "order": 4,
        "duration": "8 heures",
        "content": "La règle historique `@media screen and (max-width: 768px)` modifie de façon globale toutes les classes du fichier à l'aune restrictive de la dimension du Screen Window du téléphone. Le paradigme actuel est cependant le *Mobile First* : nous concevons le rendu Mobile de facto par défaut hors-blocue, et nous améliorons l'UX en interceptant progressivement (Progressive Enhancement) les tablettes en Desktop via la syntaxe ascendante (`min-width`). La nouvelle révolution atomique se nomme les **Container Queries** (`@container`) : Un composant Modulaire carte ne lit plus son adaptation à l'écran Windows en largeur, mais scrute la taille disponible dynamique de son strict Conteneur Parent (le Grid Box dans lequel on le jette). Cela favorise une résilience absolue et un Component-Driven Design impitoyable.",
        "objectives": [
          "Gérer un workflow CSS fluide en conception Strictement Formelle Mobile-First.",
          "Altérer radicalement un affichage Navbar display:flex vers flex-direction: column sous la passe mobile de 600px breakpoint.",
          "Saisir la philosophie disruptive de la règle en conteneur locale (@container)."
        ],
        "exercises": [
          {
            "title": "Interception Ascendante Desktop (Mobile First)",
            "description": "Écrivez une requête de média (@media) ciblant au minimum une taille d'écran (min-width) de 1024px. À l'intérieur du bloc géré, forcez une classe '.titre' à utiliser une police de 5rem sur gros écran informatique.",
            "difficulty": "Difficile",
            "solution": "@media (min-width: 1024px) {\\n  .titre {\\n    font-size: 5rem;\\n  }\\n}",
            "hints": [
              "Le 'min-width' force l'exécution du bloc interne quand le moteur sortira de la sphère des petits modems web portables pour afficher un support large."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "Bash Linux - Niveau Débutant : La Ligne de Commande",
    "description": "Maîtrisez l'interface originelle de l'informatique. Abandonnez la souris, comprenez l'arborescence UNIX et devenez plus rapide que la lumière pour manipuler votre machine.",
    "category": "DevOps",
    "level": "Débutant",
    "duration": "25 heures",
    "image": "https://images.unsplash.com/photo-1629654297299-c8506221ca97?w=800&q=80",
    "rating": 4.8,
    "students": 7200,
    "language": "bash",
    "isFree": true,
    "tags": [
      "bash",
      "linux",
      "terminal",
      "débutant",
      "shell"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : L'Arbre Généalogique UNIX et le Kernel",
        "description": "Le terminal n'est qu'un interprète. Comprenez la différence entre OS, Kernel et Shell.",
        "order": 1,
        "duration": "5 heures",
        "content": "Avant de taper une commande, il faut comprendre l'architecture en couches de Linux. 1) Le Matériel (CPU, RAM). 2) Le Noyau (Kernel), le chef d'orchestre absolu qui gère le matériel. 3) Le Shell (Bash, Zsh, Sh), un programme traducteur qui prend le texte humain et le convertit en appels systèmes pour le Kernel. 4) Les Utilitaires (GNU coreutils comme ls, cp, mv). Nous explorerons l'arborescence standard (`/`, `/home`, `/etc`, `/var`, `/bin`) et le concept vital de chemin Absolu (depuis la racine) versus chemin Relatif (depuis la position actuelle `pwd`).",
        "objectives": [
          "Distinguer Kernel et Shell",
          "Naviguer à l'aveugle via chemins relatifs (`../`) et absolus (`/`)",
          "Déchiffrer le rôle critique de `/etc` et `/bin`"
        ],
        "exercises": [
          {
            "title": "Navigation Ascendante",
            "description": "Vous êtes dans `/var/log/nginx`. Quelle commande unique permet de revenir dans le dossier `/var` sans utiliser de chemin absolu ?",
            "difficulty": "Facile",
            "solution": "`cd ..` ou `cd ../` qui signifie 'Change Directory vers le Parent'.",
            "hints": [
              "Les deux points `..` représentent toujours le dossier parent."
            ]
          },
          {
            "title": "L'Espace Vital",
            "description": "À quoi sert exactement le répertoire `~` (Tilde) en Bash ?",
            "difficulty": "Moyen",
            "solution": "Le Tilde `~` est un raccourci global qui pointe strictement vers le dossier personnel (Home Directory) de l'utilisateur actuellement connecté (ex: `/home/alice`). Taper `cd ~` ramène toujours à la maison.",
            "hints": [
              "Où sont stockés vos documents personnels sous Linux ?"
            ]
          }
        ],
        "resources": [
          {
            "title": "Comprendre FHS (Filesystem Hierarchy Standard)",
            "type": "article",
            "url": "https://fr.wikipedia.org/wiki/Filesystem_Hierarchy_Standard"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Les Commandes Fondamentales (CRUD Fichiers)",
        "description": "La survie basique : Créer, Lire, Mettre à jour, Détruire.",
        "order": 2,
        "duration": "7 heures",
        "content": "L'ingénieur système passe 50% de son temps à manipuler des fichiers. Nous décortiquerons les utilitaires GNU essentiels avec leurs options capitales (flags). La création silencieuse (`touch`), l'effacement récursif définitif (`rm -rf` /!\\ Danger mortel sans corbeille), la copie d'arborescences (`cp -R`), et le déplacement ou renommage magique (`mv`). Vous maîtriserez la visualisation complète avec `ls -la` (fichiers cachés commençant par un point) et la lecture de texte (`cat`, `less`, `head`, `tail -f` pour le suivi des logs en direct).",
        "objectives": [
          "Manipuler brutalement des dossiers imbriqués",
          "Créer un dossier et ses parents en une fois (`mkdir -p`)",
          "Suivre un fichier log en production avec `tail`"
        ],
        "exercises": [
          {
            "title": "Le Renommage Furtif",
            "description": "Comment renommer le fichier `ancien.txt` en `nouveau.txt` en Bash ? Indice : il n'y a pas de commande 'rename' native de base.",
            "difficulty": "Moyen",
            "solution": "On utilise la commande Move : `mv ancien.txt nouveau.txt`. Deplacer un fichier dans le même dossier sous un autre nom est la définition UNIX du renommage.",
            "hints": [
              "Déplacer un objet au même endroit, mais avec une étiquette différente."
            ]
          },
          {
            "title": "Le Dossier Profond",
            "description": "Comment créer l'arborescence complète `/app/src/components` si `app` n'existe pas encore, en une seule commande ?",
            "difficulty": "Facile",
            "solution": "`mkdir -p /app/src/components`. Le flag `-p` (parents) dit de créer tous les dossiers intermédiaires manquants sans planter.",
            "hints": [
              "Consultez le manuel `man mkdir`."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Les Permissions UNIX et Utilisateurs (Chmod/Chown)",
        "description": "La sécurité est la première brique d'un OS Multi-utilisateurs. Protégez vos serveurs.",
        "order": 3,
        "duration": "8 heures",
        "content": "UNIX est conçu depuis 1970 pour que des milliers de personnes se connectent au même supercalculateur. La matrice des permissions est vitale. Nous étudierons le triumvirat de la possession : `User` (Propriétaire), `Group` (Le Groupe), `Others` (Le Reste du Monde). Les 3 droits fondamentaux : `r` (Read), `w` (Write), `x` (Execute). Vous apprendrez à lire le masque `drwxr-xr--` (754 en octal) et à verrouiller des fichiers SSH bloquants via la légendaire commande `chmod`. Nous aborderons la toute-puissance de `root` (l'UID 0) et l'usurpation temporaire légale via `sudo` et `su`.",
        "objectives": [
          "Lire et calculer parfaitement les droits Octaux (ex: chmod 777, chmod 644)",
          "Transférer la possession via `chown`",
          "Comprendre pourquoi `x` sur un Dossier permet d'entrer dedans (cd)"
        ],
        "exercises": [
          {
            "title": "Octal Calculator : Le Droit 755",
            "description": "Traduisez la commande `chmod 755 script.sh` en droits lisibles rwx.",
            "difficulty": "Moyen",
            "solution": "7 (User) = 4(r) + 2(w) + 1(x) = rwx.\n5 (Group) = 4(r) + 0(w) + 1(x) = r-x.\n5 (Others) = 4(r) + 0(w) + 1(x) = r-x.\nLe résultat est `rwxr-xr-x`. Le propriétaire peut tout faire, les autres peuvent seulement lire et exécuter.",
            "hints": [
              "Lecture vaut 4, Écriture vaut 2, Exécution vaut 1. Faites les additions."
            ]
          }
        ],
        "resources": [
          {
            "title": "Explication Chmod et Chown Mathématiques",
            "type": "article",
            "url": "https://fr.wikipedia.org/wiki/Chmod"
          }
        ]
      },
      {
        "title": "Chapitre 4 : Wildcards, Redirections et le Pipe Magique (|)",
        "description": "Le chaînage des commandes : L'invention géniale qui fait la puissance infinie du Bash.",
        "order": 4,
        "duration": "5 heures",
        "content": "Chaque commande UNIX fait Une seule chose et la fait bien (Philosophie KISS). La magie intervient quand on les connecte. Nous étudierons les Flux d'Entrée/Sortie Standard (Stdin `0`, Stdout `1`, Stderr `2`). Vous apprendrez à rediriger la sortie d'une commande vers un fichier (`>`, `>>` pour append), et surtout, à rediriger la sortie visuelle d'un binaire comme entrée d'un autre via le Pipeline `|`. Vous étudierez les Globbings/Wildcards (`*`, `?`) pour affecter des milliers de fichiers en une frappe.",
        "objectives": [
          "Rediriger les erreurs système (Stderr 2) vers `/dev/null` (Le Trou Noir)",
          "Combiner 3 commandes en un seul Pipe",
          "Rechercher du texte massif dans le terminal avec `grep` chaîné"
        ],
        "exercises": [
          {
            "title": "Sourd Mute les Erreurs",
            "description": "Une commande `find / -name \"secret\"` va afficher des centaines de lignes 'Permission refused'. Comment envoyer *uniquement* ces erreurs à la poubelle (`/dev/null`) pour ne voir que les résultats valides ?",
            "difficulty": "Difficile",
            "solution": "`find / -name \"secret\" 2> /dev/null`. L'opérateur `2>` ordonne de rediriger spécifiquement le flux d'erreur standard (Stderr, ID 2) vers le fichier device virtuel `/dev/null`.",
            "hints": [
              "Connaissez-vous l'ID du flux d'erreur par rapport à l'Output normal ?"
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "Bash Linux - Niveau Intermédiaire : L'Automatisation Shell",
    "description": "Arrêtez de retaper les mêmes commandes. Devenez Développeur Shell. Écrivez des scripts autonomes, des boucles conditionnelles et des variables d'environnement planétaires.",
    "category": "DevOps",
    "level": "Intermédiaire",
    "duration": "45 heures",
    "image": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800&q=80",
    "rating": 4.9,
    "students": 5100,
    "language": "bash",
    "isFree": true,
    "tags": [
      "bash",
      "scripting",
      "automatisation",
      "intermédiaire"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Syntaxe, Shebang et Variables d'Environnement",
        "description": "Un script est un fichier texte rendu vivant. Créez vos premiers exécutables.",
        "order": 1,
        "duration": "10 heures",
        "content": "Vous entrerez dans l'univers de l'automatisation en créant des fichiers `.sh`. Tout commence par le Shebang `#!/bin/bash` qui dicte au Kernel quel interpréteur utiliser. Vous manipulerez les variables Shell (sans espace autour du signe égal !), les guillemets stricts (Double Quotes interpolent les variables, Single Quotes bloquent tout en littéral). Nous aborderons les Variables d'Environnement globales exportées (env, `$PATH`, `$USER`) qui configurent l'âme de l'OS sur lequel vos scripts vont tourner.",
        "objectives": [
          "Rendre un script exécutable (chmod u+x)",
          "Manipuler le `$PATH` pour créer vos propres commandes globales",
          "Sécuriser les concaténations de variables avec les accolades `${var}`"
        ],
        "exercises": [
          {
            "title": "Le Piège de l'Espace",
            "description": "Pourquoi la définition `NOM = \"Alice\"` (avec des espaces) plante-t-elle le script en Bash avec l'erreur 'NOM: command not found' ?",
            "difficulty": "Moyen",
            "solution": "Parce que le Bash est un interpréteur d'expressions délimitées par des espaces. S'il voit un espace après NOM, il pense que NOM est un programme binaire qu'il doit lancer, et que `=` est son premier argument. L'affectation s'écrit formellement `NOM=\"Alice\"`.",
            "hints": [
              "En Bash, le premier mot d'une ligne est TOUJOURS considéré comme un exécutable."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Conditions, Tests (if/else) et Arguments CLI",
        "description": "Rendre le script intelligent selon le contexte et les entrées utilisateur.",
        "order": 2,
        "duration": "10 heures",
        "content": "Les scripts dynamiques prennent des arguments. L'accès à `$1`, `$2`, `$@` (tous les arguments), `$#` (le nombre d'arguments fournis). Vous maîtriserez la fameuse commande `test` représentée par les crochets `[ condition ]` pour vérifier des chaînes, des nombres (avec -eq, -lt, -gt) et des fichiers (`-f` existe, `-d` est dossier). Nous traiterons du code de retour silencieux. Chaque programme Linux renvoie secrètement un 'Exit Status' lorsqu'il meurt (0 = Succès, >0 = Erreur). Nous le capturerons via la variable secrète `$?`.",
        "objectives": [
          "Vérifier si l'utilisateur a oublié un argument critique",
          "Évaluer le succès silencieux de la dernière commande système exécutée",
          "Faire des scripts robustes conditionnels (Fail-fast)"
        ],
        "exercises": [
          {
            "title": "L'Assurance de l'Argument",
            "description": "Écrire les 3 lignes de Bash au début d'un script pour arrêter le programme immédiatement (avec un exit 1) si l'utilisateur n'a fourni aucun argument dans le Terminal.",
            "difficulty": "Moyen",
            "solution": "if [ $# -eq 0 ]; then\n  echo \"Erreur : Argument manquant\"\n  exit 1\nfi",
            "hints": [
              "La variable magique qui compte les entités fournies au script."
            ]
          },
          {
            "title": "Vérifier l'Existence d'un Fichier",
            "description": "Le test conditionnel flag pour vérifier si `/etc/passwd` existe et est un fichier régulier ?",
            "difficulty": "Facile",
            "solution": "if [ -f /etc/passwd ]; then ...",
            "hints": [
              "Cherchez le flag File test op."
            ]
          }
        ],
        "resources": [
          {
            "title": "Comprendre Base GNU Bash Test",
            "type": "article",
            "url": "https://www.gnu.org/software/bash/manual/html_node/Bash-Conditional-Expressions.html"
          }
        ]
      },
      {
        "title": "Chapitre 3 : Itérations : Boucles For/While et Sécurité",
        "description": "Automatiser des backups réseau sur 500 serveurs en une boucle féroce.",
        "order": 3,
        "duration": "12 heures",
        "content": "La boucle `for i in liste; do ... done` est le tractopelle du Bash. Elle itère magiquement sur tous les mots retournés (ex: for fichier in *.txt). Vous apprendrez le nettoyage par lot, et l'usage de la boucle `while read line` pour parser textuellement un fichier ligne par ligne sans explosion mémoire (Buffer sécurisé). Nous évoquerons la Substitution de Commande en backticks `` ou `$(commande)` : exécuter un sous-shell, capturer sa réponse et l'injecter comme paramètre dans la grande boucle de votre pipeline.",
        "objectives": [
          "Lancer des ping asynchrones massifs",
          "Parcourir un fichier config.csv ligne par ligne proprement",
          "Capturer la sortie de commandes internes (Subshells)"
        ],
        "exercises": [
          {
            "title": "Le Backup Massif",
            "description": "Écrivez une simple boucle for qui renomme (backup) tous les fichiers `.log` du dossier actuel en ajoutant `.bak` à leur nom (ex: error.log devient error.log.bak).",
            "difficulty": "Moyen",
            "solution": "for f in *.log; do\n  mv \"$f\" \"$f.bak\"\ndone",
            "hints": [
              "Utilisez le globbing *.log pour cibler. Sécurisez avec des guillemets doubles $f au cas où un fichier possède un espace (error 1.log)."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Job Control, Processus en Arrière-Plan et Cron (Planification)",
        "description": "Détachez vos scripts de votre écran. Rendez-les immortels sur le serveur.",
        "order": 4,
        "duration": "13 heures",
        "content": "Lancer un script qui dure 10 heures bloque votre terminal SSH. Vous étudierez le Job Control : lancer en tâche de fond (ajouter un `&` à la fin), suspendre (`Ctrl+Z`), remettre au premier plan (`fg`), ou laisser en fond (`bg`) ou utiliser `nohup` pour que le script ne meure pas quand vous éteignez votre PC. Nous introduisons l'outil majeur de l'administrateur : Le Démon CRON et la syntaxe tabulaire (Crontab) pour planifier des tâches à la minute, l'heure, ou le jour de manière infiniment asynchrone.",
        "objectives": [
          "Planifier des Dump de Bases de données automatiques via Cron",
          "Déconnecter un long compilateur sans tuer l'action (Nohup/Screen/Tmux)",
          "Tuer des Zombies et Processes Récalcitrants (Kill -9)"
        ],
        "exercises": [
          {
            "title": "Le Mythe du Cron",
            "description": "Traduisez la syntaxe crontab extrêmement courante : `0 2 * * * /backup.sh`",
            "difficulty": "Facile",
            "solution": "Le script /backup.sh s'exécutera tous les jours, de chaque mois, à 2:00 du matin précise.",
            "hints": [
              "Minute, Heure, Jour, Mois, JourDeSemaine."
            ]
          },
          {
            "title": "Tueur Fantôme (Kill -9)",
            "description": "Pourquoi utilise-t-on la commande fatale `kill -9` (`SIGKILL`) seulement en dernier recours par rapport au `kill` normal (`SIGTERM`) ?",
            "difficulty": "Difficile",
            "solution": "Le `kill` classique (Signal 15) demande poliment au processus de procéder lui-même à sa destruction, lui laissant le temps de sauvegarder, de fermer les bases de données et les fichiers. Il peut refuser. Le `kill -9` (Signal 9) ordonne au Kernel d'exécuter à mort le processus instantanément sans l'avertir. Si ce processus écrivait dans une BDD MongoDB, le fichier sera totalement corrompu.",
            "hints": [
              "Politesse contre Exécution Sommaire Brute de l'OS."
            ]
          }
        ],
        "resources": [
          {
            "title": "Les Signaux OS UNIX",
            "type": "article",
            "url": "https://fr.wikipedia.org/wiki/Signal_(informatique)"
          }
        ]
      }
    ]
  },
  {
    "title": "Bash Linux - Niveau Expert Mondiale : Sed, Awk, et DevOps Ninja",
    "description": "Transformez-vous en Architecte Cloud. Parsez des Giga-octets d'archives en nano-secondes via les expressions régulières. L'ingénierie absolue d'Amazon AWS.",
    "category": "DevOps",
    "level": "Avancé",
    "duration": "65 heures",
    "image": "https://images.unsplash.com/photo-1518770660439-4636190af475?w=800&q=80",
    "rating": 5,
    "students": 2100,
    "language": "bash",
    "isFree": true,
    "tags": [
      "bash",
      "awk",
      "sed",
      "expert",
      "regex",
      "devops"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Expressions Régulières (RegEx) Avancées (Grep/Egrep)",
        "description": "Le langage universel universel de la recherche de motifs complexes dans le Big Data.",
        "order": 1,
        "duration": "10 heures",
        "content": "Chercher un mot, c'est facile. Mais comment chercher toutes les adresses e-mails sénégalaises valides dans un fichier de 50 millions de lignes texte ? Les RegEx sont le code-barres de la vérification String. Nous aborderons les métacaractères : `^` (Début Ligne), `$` (Fin Ligne), `[a-z]` (Plages), `+` (Au moins un), `*` (Zéro ou plusieurs), et les quantificateurs `.{3}`. La commande puissante `grep -E` deviendra votre scanner d'inclusions/exclusions réseau.",
        "objectives": [
          "Protéger les strings via Regex et extraction d'anomalies Log",
          "Utiliser un extracteur regex Inverse (Pipelining Grep -v)"
        ],
        "exercises": [
          {
            "title": "Le Validateur d'IP",
            "description": "Quelle Regex théorique partielle permet de détecter une série de 4 nombres chiffrés séparés de points (Ex: format IPv4 non-analysé 192.168.1.1) ?",
            "difficulty": "Difficile",
            "solution": "`^[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}$`. (Un à trois chiffres, un point littéral échappé, répété).",
            "hints": [
              "Protégez bien les vrais points (\\.) du Wildcard RegEx (.)."
            ]
          }
        ],
        "resources": [
          {
            "title": "Testeur Regex Interactif Universel",
            "type": "article",
            "url": "https://regex101.com/"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Sed - Le Stream Editor Destructeur",
        "description": "Le chirurgien de texte en temps réel, modifiant des gigaoctets à la volée.",
        "order": 2,
        "duration": "15 heures",
        "content": "Ouvrir un dump SQL de 80 Go dans VSCode fait exploser le processeur et la RAM. La commande formelle `sed` (Stream Editor) lit la cible flux par flux. Nous verrons son utilisation mondiale pour le Search & Replace massif dans des configurations d'applications : `sed 's/ANCIEN/NOUVEAU/g'`. Vous maîtriserez la modification In-Place (`sed -i`) qui altère discrètement le fichier. L'ingénieur doit comprendre comment sed gère les délimiteurs customisés pour éviter 'l'enfer des échappements de slashs' lors des modifications de chemins URL.",
        "objectives": [
          "Mettre à jour massivement 50 URL obsolètes d'un projet Git via Sed",
          "Supprimer des milliers de lignes vides ou commentées pour épurer une config",
          "Ajouter des lignes à un intervalle spécifique"
        ],
        "exercises": [
          {
            "title": "Substitution Pipelée",
            "description": "Via `sed`, remplacez toutes les occurrences de 'http' par 'https' dans un flux textuel globalement.",
            "difficulty": "Moyen",
            "solution": "`sed 's/http/https/g'`. Le 's' est la commande substitution. Le 'g' final (global) demande de le faire pour toutes les occurrences sur une même ligne (pas juste la première).",
            "hints": [
              "Substitute / Target / Result / Global flag."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : AWK - Le Langage Data-Science Embarqué",
        "description": "Un langage de programmation entier dissimulé dans un binaire UNIX depuis les années 80. Traiter les données colonnes et Tableurs CSV.",
        "order": 3,
        "duration": "20 heures",
        "content": "Avant Node.js et Python DataFrame, le traitement des tableurs tabulaires colossaux était exécuté par l'Aho-Weinberger-Kernighan (AWK). Un pur bijou orienté 'Parsing de Ligne et Champs'. Vous apprendrez comment awk voit un fichier en Enregistrements (Records / Lignes) et en Champs (Fields / `$1`, `$2`, `$3`). Nous allons modifier les variables primitives FS (Field Separator, ex: virgule pour CSV) et OFS (Séparateur en Sortie), puis coder des conditions et blocs algorithmiques complexes ou calculs mathématiques (comme additionner des salaires en lisant une simple colonne sur AWS EC2).",
        "objectives": [
          "Tirer des Stats d'accès WebLog Apache via awk",
          "Structurer des scripts awk avec `BEGIN { } main { } END { }`",
          "Remplacer l'usage d'Excel par le bash terminal"
        ],
        "exercises": [
          {
            "title": "Le Tueur CSV",
            "description": "Soit un fichier `data.csv` avec séparateur `,` (Nom, Age, Ville). Si on veut extraire UNIQUEMENT la ville (3ème colonne), quelle commande AWK utiliser ?",
            "difficulty": "Moyen",
            "solution": "`awk -F',' '{print $3}' data.csv`. Le flag -F impose que le limiteur est une virgule et non plus l'espace classique des commandes. `$3` extrait spécifiquement le troisième token.",
            "hints": [
              "Field Separator Option et Print Variable 3."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Scripting DevOps Avancé - Xargs, Curl, Jq",
        "description": "Faire le pont entre l'OS local et la puissance du Cloud API World Wide Web.",
        "order": 4,
        "duration": "20 heures",
        "content": "L'art ultime pour piloter Docker, SSH massif, ou API REST externes en 3 lignes. L'utilisation colossale de la commande API : `curl`. Vous téléchargerez le Web, testerez des Header (Tokens, Authorization Bearer), ou passerez des Payloads POST massifs en CLI. Et pour comprendre les réponses serveur ? Vous manierez `jq`, le couteau suisse JSON pour Terminal, filtrant des API monstrueuses en Objets simplifiés (Comme un Graph QL côté terminal). Enfin l'arme destructrice, `xargs`, qui convertit de force l'Output texte d'en une liste d'arguments parallèles pour un Threading de process ultra rapide.",
        "objectives": [
          "Communiquer avec Github REST Api via Curl",
          "Extraire la valeur JSON '{ \"token\" : \"...\"}' via jq",
          "Optimiser le multithreading applicatif sur un million de fichiers (xargs -P)"
        ],
        "exercises": [
          {
            "title": "Le Casse-tête de la Limite Argument (Argument list too long)",
            "description": "Pourquoi faire un idiot `rm *` plante-t-il sur un dossier avec 300 000 fichiers (Argument list too long), et comment `ls | xargs rm` résout-il la crise mondialement ?",
            "difficulty": "Difficile",
            "solution": "Le noyau Linux fixe une taille maximale imposée sur le buffer de la ligne de commande (souvent 128 Ko pour la taille de TOUS les strings arguments cumulés du shell). Si le globbing * envoie 300 000 noms à `rm`, la limite Kernel écrase l'action. L'alternative : le pipeline stream. La commande `ls` jette tranquillement les noms un par un dans le tube Pipe. Le binaire malin `xargs` les réceptionne et va appeler répétitivement le binaire `rm` avec des blocs sûrs (ex: `rm fichier1 à fichier500`, puis `rm fichier501 à f1000`). Xargs tronçonne pour survivre aux limites brutes système.",
            "hints": [
              "Les tampons mémoire C et la fragmentation des arguments de execve() Kernel..."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "JavaScript - Niveau Débutant",
    "description": "Le Mouvement et la Logique. Apprenez le seul langage exécutable nativement par tous les navigateurs web. Maîtrisez la syntaxe moderne ES6+ et les fondements algorithmiques.",
    "category": "Web",
    "level": "Débutant",
    "duration": "20 heures",
    "image": "https://images.unsplash.com/photo-1579468458835-cd73b7b7dfd5?w=800&q=80",
    "rating": 4.8,
    "students": 52000,
    "language": "french",
    "isFree": true,
    "tags": [
      "JavaScript",
      "ES6+",
      "Logique",
      "Variables",
      "Débutant"
    ],
    "chapters": [
      {
        "title": "1. L'Écosystème et la Déclaration (Let & Const)",
        "description": "L'abandon total de 'var' au profit des portées de bloc modernes (Block Scoping).",
        "order": 1,
        "duration": "4 heures",
        "content": "JavaScript a été conçu en 10 jours en 1995, mais a drastiquement évolué depuis l'ES6 (ECMAScript 2015). La déclaration historique `var` engendrait des fuites de portée (Hoisting) fatales. Aujourd'hui, on déclare exclusivement des variables muables via `let` et des constantes immuables (dont la réaffectation est bloquée en mémoire) par `const`. Par défaut, un ingénieur JS utilise `const` à 90%, basculant sur `let` uniquement si une boucle mathématique l'exige. Tout s'exécute dans l'Engine du navigateur (V8 pour Chrome) et s'affiche aux développeurs via F12 (`console.log()`).",
        "objectives": [
          "Saisir la différence fondamentale entre portée de bloc (let/const) et portée de fonction (var).",
          "Comprendre le fonctionnement du Hoisting JS et la 'Temporal Dead Zone'.",
          "Déclarer une constante impossible à réassigner mathématiquement."
        ],
        "exercises": [
          {
            "title": "La Constante Universelle",
            "description": "Créez une constante 'TAUX' valant 1.20 et logguez-la dans la console système.",
            "difficulty": "Facile",
            "solution": "const TAUX = 1.20;\\nconsole.log(TAUX);",
            "hints": [
              "Les primitives numériques s'écrivent sans guillemets, contrairement aux Strings."
            ]
          }
        ],
        "resources": [
          {
            "title": "Let, Const et Hoisting (MDN)",
            "type": "article",
            "url": "https://developer.mozilla.org/fr/docs/Web/JavaScript/Reference/Statements/let"
          }
        ]
      },
      {
        "title": "2. Types Primitifs et Égalité Stricte (===)",
        "description": "Le typage dynamique et le piège de la coercition de type JS.",
        "order": 2,
        "duration": "5 heures",
        "content": "JS est un langage à typage dynamique faible. Une variable peut naître 'String' et mourir 'Number'. Les primitives sont : String (texte), Number (entiers et flottants confondus), Boolean (true/false), Undefined (déclaré mais vide de valeur matérielle) et Null (vide intentionnel imposé par le développeur). Le plus grand danger du langage est la coercition de type implicite : l'opérateur `==` affirmera que `5 == '5'` est *vrai*. C'est pourquoi l'industrie impose l'opérateur d'égalité stricte `===` (qui vérifie la valeur ET le type matériel), rendant `5 === '5'` heureusement *faux*.",
        "objectives": [
          "Manipuler les types primitifs sans erreur d'affectation.",
          "Savoir pourquoi typeof null retourne curieusement 'object' (bug historique JS).",
          "Bannir l'égalité souple == au profit de l'égalité stricte ===."
        ],
        "exercises": [
          {
            "title": "Le Gardien Stricte",
            "description": "Écrivez une condition (if) vérifiant strictement qu'une variable (déjà définie) 'age' (Number 18) est égale à 18, et loguez 'Majeur'.",
            "difficulty": "Moyen",
            "solution": "if (age === 18) {\\n  console.log('Majeur');\\n}",
            "hints": [
              "Utilisez les trois signes égal pour bloquer la coercition chaîne vers nombre."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Le Contrôle du Flux d'Exécution",
        "description": "Opérateurs Logiques, If/Else, Switch et structures itératives (Boucles).",
        "order": 3,
        "duration": "6 heures",
        "content": "Le processeur lit le code séquentiellement. Pour bifurquer, on utilise `if/else if/else`. On combine les prédicats via les opérateurs logiques ET `&&` (tous vrais) ou OU `||` (un seul vrai). Si les embranchements sont multiples sur la même variable, le `switch(variable)` est sémantiquement supérieur, nécessitant explicitement un mot-clé `break` sous peine d'exécuter les cas suivants en cascade (Fall-through). Pour l'itération, la boucle `for(let i=0; i<10; i++)` exécute un bloc un nombre connu de fois, tandis que `while(condition)` tourne tant que la condition perdure (risque de boucle infinie).",
        "objectives": [
          "Évaluer les valeurs 'Truthy' et 'Falsy' en JavaScript (0, '', null, undefined, NaN sont Falsy).",
          "Construire un Switch Case avec Break et Default.",
          "Implémenter une boucle For ascendante."
        ],
        "exercises": [
          {
            "title": "La Boucle d'Incrémentation",
            "description": "Créez une boucle for classique qui logue les chiffres stricts de 0 à 4 (soit 5 itérations exactes).",
            "difficulty": "Moyen",
            "solution": "for (let i = 0; i < 5; i++) {\\n  console.log(i);\\n}",
            "hints": [
              "L'initialisation crée i, la condition teste i < 5, l'expression finale incrémente i++."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Les Fonctions et l'Émergence du Fat Arrow (=>)",
        "description": "Des machines à réutiliser du code à l'ingénierie moderne fonctionnelle.",
        "order": 4,
        "duration": "5 heures",
        "content": "Les fonctions encapsulent des algorithmes. Historiquement déclarées via mot conventionnel `function carre(x) { return x*x; }` (qui subissait le Hoisting au sommet du fichier). L'ES6 a introduit la syntaxe de fonction fléchée (Arrow Function) : `const carre = (x) => { return x*x; }`. Ou, si l'on retourne directement une valeur simple (Return Implicite) : `const carre = x => x*x;`. Cette syntaxe est dorénavant ubiquitaire en React car elle ne lie pas (bind) de nouveau contexte local virtuel `this`, elle hérite de la réalité de l'environnement matériel parent (Portée Lexicale).",
        "objectives": [
          "Convertir mentalement toute fonction classique en fonction fléchée ES6.",
          "Exploiter le retour explicite et le retour implicite d'une Arrow Function.",
          "Saisir le rôle de l'argument et du paramètre d'exécution."
        ],
        "exercises": [
          {
            "title": "La Flèche Multiplicatrice",
            "description": "Déclarez une Arrow Function constante nommée 'multi' prenant les paramètres (a, b) et retournant (implicitement sans crochet) leur multiplication.",
            "difficulty": "Difficile",
            "solution": "const multi = (a, b) => a * b;",
            "hints": [
              "Omettez les accolades {} et le mot-clé return pour profiter du mode implicite direct."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "JavaScript - Niveau Intermédiaire",
    "description": "L'ingénieur du Document. Parcourez l'arbre DOM, capturez des événements, manipulez des Objets complexes et maîtrisez les méthodes de Tableaux de Haut Niveau (Map, Filter, Reduce).",
    "category": "Web",
    "level": "Intermédiaire",
    "duration": "25 heures",
    "image": "https://images.unsplash.com/photo-1579468458835-cd73b7b7dfd5?w=800&q=80",
    "rating": 4.9,
    "students": 39000,
    "language": "french",
    "isFree": true,
    "tags": [
      "DOM",
      "Events",
      "Array Methods",
      "Objets",
      "Intermédiaire"
    ],
    "chapters": [
      {
        "title": "1. Structuration Complexe : Objets et Tableaux (Arrays)",
        "description": "Maniement de la donnée structurée, Déstructuration et Spread Operator.",
        "order": 1,
        "duration": "6 heures",
        "content": "Un Tableau (Array) est une liste indexée : `const tab = [10, 20]`. Un Objet Litteral dicte un dictionnaire Paire Clé/Valeur brut : `const user = { name: 'Bob', role: 'Admin' }`. L'ES6 a introduit deux révolutions : La **Déstructuration** permet d'extraire chirurgicalement les données (`const { name } = user;`). L'opérateur de décomposition, le **Spread/Rest Operator** (`...`), permet de cloner nativement des objets ou tableaux par valeur pour éviter le désastreux passage par référence JS : `const cloneTab = [...tab];`. Idéal pour l'immutabilité exigée par Redux.",
        "objectives": [
          "Créer et invoquer des propriétés d'Obélisques JavaScript Object via le point (`user.name`) ou les crochets (`user['name']`).",
          "Déstructurer un objet complexe sur une seule ligne pure.",
          "Cloner formellement un tableau en détruisant sa référence mémoire via const new = [...old]."
        ],
        "exercises": [
          {
            "title": "Extraction par Déstructuration",
            "description": "Étant donné un objet 'data' au préalable défini contenant x et y. Déstructurez x et y sur une seule ligne.",
            "difficulty": "Moyen",
            "solution": "const { x, y } = data;",
            "hints": [
              "Le nom de votre variable entre { } DOIT matcher exactement la clé de l'objet source."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "2. Les Fonctions Arrays de Haut Ordre (HOF)",
        "description": "Remplacer purement les boucles 'for' avec Map, Filter et Reduce.",
        "order": 2,
        "duration": "7 heures",
        "content": "En JS Moderne (Déclaratif), on ne gère plus la mutation d'index avec les boucles `for/while` sur des listes. On utilise des méthodes natives qui retournent toujours *un nouveau tableau*, respectant l'immutabilité. L'itérateur **map()** transforme chaque élément et renvoie un tableau de même taille : `[1,2].map(x => x*2)` donne `[2,4]`. L'extracteur **filter()** passe la liste dans un crible boolean pour ne garder que le vrai : `[1,2,3].filter(x => x>1)` donne `[2,3]`. L'agrégateur mathématique absolu **reduce()** compile un tableau vers une valeur unique primitive terminale (ex: une somme).",
        "objectives": [
          "Bannir l'utilisation de for() ou forEach() lors d'une mutation de retour globale.",
          "Appliquer brillamment la chaine d'opérateurs array.filter().map().",
          "Comprendre le fonctionnement mathématique de l'accumulateur JS Array.reduce()."
        ],
        "exercises": [
          {
            "title": "Filtrage Positif",
            "description": "Vous avez un argument 'nombres' (tableau). Créez une constante 'positifs' en lui appliquant un filter() pour ne garder que les x strictement supérieurs à 0.",
            "difficulty": "Moyen",
            "solution": "const positifs = nombres.filter(x => x > 0);",
            "hints": [
              "Filter prend une callback (x => boolean). Si c'est vrai, l'élément est conservé dans le nouveau tableau rendu."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Mutation du DOM (Document Object Model)",
        "description": "Prendre le contrôle du squelette HTML sans recharger.",
        "order": 3,
        "duration": "6 heures",
        "content": "Le navigateur transforme le code HTML statique en un gigantesque Objet hiérarchique : le DOM. JS manipule cet univers. On cible un nœud grâce à l'implacable `document.querySelector('.ma-classe')` (remplaçant les anciens getElementById fastidieux). Une fois l'entité extraite, on modifie son contenu brutal via `element.textContent`, son contenu balisé via `element.innerHTML` (dangereux si les datas viennent des utilisateurs : failles XSS Cross-Site Scripting). On change l'UI classe en invoquant `element.classList.add('actif')` ou `.toggle('cache')`.",
        "objectives": [
          "Identifier les limitations d'un NodeList renvoyé par querySelectorAll (n'est pas un vrai Array entierement).",
          "Remplacer le texte formel d'un Header h1 ciblé dynamiquement.",
          "Créer un noeud ex-nihilo via document.createElement() et l'injecter via append()."
        ],
        "exercises": [
          {
            "title": "Interrupteur de Classe",
            "description": "Ciblez une id '#menu' et utilisez sa classList pour forcer l'ajout (.add) d'une classe 'open'.",
            "difficulty": "Moyen",
            "solution": "document.querySelector('#menu').classList.add('open');",
            "hints": [
              "L'attribut classList natif possède ses propres méthodes d'ajout (add), de retrait (remove) et de bascule (toggle)."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Architecture Événementielle (DOM Events)",
        "description": "L'Event Loop réagit aux actions humaines Client.",
        "order": 4,
        "duration": "6 heures",
        "content": "La page web est un système d'écoute. Écouter un bouton se fait par le biais exclusif de la méthode attente : `element.addEventListener('click', callback)`. Le bloc Callback (souvent une fat arrow) reçoit toujours en premier paramètre `e` (l'objet Event). Celui-ci contient la mine d'or vitale : `e.target` (le focus exact du clic physique), `e.preventDefault()` (pour stopper le rechargement navigateur automatique d'un `<form>` Submit par défaut), ou `e.stopPropagation()` (bloquer la bulle événementielle montante, ou Bubbling, qui remonte sur les parents collatéraux).",
        "objectives": [
          "Câbler un EventListener robuste réactif Click ou Keydown clavier.",
          "Stopper l'anarchie formelle d'un formulaire via objet e formel preventDefault().",
          "Saisir le concept avancé de 'Event Delegation' (placer le listener sur le conteneur lointain Père plutôt que 100 enfants Fils séparés)."
        ],
        "exercises": [
          {
            "title": "Stopper L'Envoi",
            "description": "Supposons un élément 'formulaire'. Ajoutez dessus un listener d'événement 'submit', prenant l'event d'argument (e), et appelez strictement sa méthode preventDefault().",
            "difficulty": "Difficile",
            "solution": "formulaire.addEventListener('submit', (e) => {\\n  e.preventDefault();\\n});",
            "hints": [
              "En JavaScript Natif (Vanilla), soumettre (Submit) un formulaire recharge violemment l'onglet intégral du User s'il n'est pas court-circuité par preventDefault() !"
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "JavaScript - Niveau Expert (Avancé)",
    "description": "L'Ingénierie Systémique asynchrone absolue. Maîtrisez la Single-Thread Event Loop, les requêtes HTTP (Fetch, JWT Authorization), la POO via Classes et le drame matériel Closures.",
    "category": "Web",
    "level": "Avancé",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1555949963-aa79dcee981c?w=800&q=80",
    "rating": 5,
    "students": 26500,
    "language": "french",
    "isFree": true,
    "tags": [
      "Asynchrone",
      "Promises",
      "Fetch API",
      "Event Loop",
      "Closures"
    ],
    "chapters": [
      {
        "title": "1. Mécanique Quantique : Asynchronisme et Promesses",
        "description": "Sortir du Callback Hell et résoudre le drame du thread JavaScript.",
        "order": 1,
        "duration": "8 heures",
        "content": "Le JavaScript moteur (V8) est rigoureusement Single-Threadé et synchrone. Il n'a qu'un canal (Call Stack). Si une opération de temporisation (Timer) ou de base de données durait 2 secondes, tout le site devrait crasher et freezer en permanence (Blocking IO). Le Backend Browser sauve avec le transfert du Timer en tâche d'arrière-plan par le navigateur. Historiquement on gérait ce retour d'exécution au hasard dans l'avenir via les fameux Callbacks. Aujourd'hui on utilise la Forme d'Objet `Promise`. Une variable Promesse existe sous 3 états matriciels stricts : En attente (Pending), Résolue Succès (Fulfilled/Resolve), ou bien Crash/Erreur violente réseau (Rejected). On intercepte classiquement le bloc data de réussite par `.then(res => ...)` et l'erreur d'exceptions HTTP par son bloc garde-fou `.catch(err => ...)`.",
        "objectives": [
          "Théoriser pourquoi JS est Single-Thread Synchrone.",
          "Saisir la puissance magique asynchrone de l'API navigateur WebAPI.",
          "Construire formellement et manuellement `new Promise((resolve, reject) => {...})`."
        ],
        "exercises": [
          {
            "title": "Promesse Mathématique Simple",
            "description": "Assignez à une variable 'check' une Nouvelle Promesse (new Promise). Elle prendra en paramètres natifs les arguments fonctionnels resolve et reject, et exécutera toujours de suite la méthode fonction 'resolve(\"OK\")'.",
            "difficulty": "Difficile",
            "solution": "const check = new Promise((resolve, reject) => {\\n  resolve('OK');\\n});",
            "hints": [
              "L'instanciation de l'objet Promise demande le mot-clé class 'new', suivi des deux fonctions vitales (callbacks de control) dans son expression."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "2. La Révolution ES8 : Async / Await",
        "description": "Muter l'apparence asynchrone complexe en un script synchrone ultra-lisible.",
        "order": 2,
        "duration": "6 heures",
        "content": "L'escalade des syntaxes `.then().then().then()` produisait vite un code laborieux à déboguer humainement. L'introduction massive des mots clés de contrôle `async` et `await` modifie complètement le méta-paradigme. Toute fonction préfixée d'un `async` renvoie implicitement au compilateur une Promesse enrobée (même sans new Promise interne). À l'intérieur du corps (body) de cette fonction, le mot bloquant `await` force le moteur d'exécution local de la ligne à *suspendre son Threading propre logiquement* le temps d'attendre (Awaiting) que la tâche matérielle de fond se résolve intégralement ! L'équivalent humain strict est d'avoir du code séquentiel simple. On protègera cela en l'englobant fatalement d'un lourd bloc de gestion d'erreur formel en béton massif `try { ... } catch (error) { ... }`.",
        "objectives": [
          "Traduire formellement des blocs chaînes 'Then()' en code Linéaire Syncron-like 'Await'.",
          "Sécuriser la capture d'erreur asynchrone d'API (Network Request) par bloc try/catch local.",
          "Comprendre le piège du parallélisme avec blocage d'await cascades (l'appel de Promise.all)."
        ],
        "exercises": [
          {
            "title": "Récupération Suspendue (Try/Catch Local)",
            "description": "Dans une fonction async 'run', créez un bloc try contenant const res valant l'await de fetch('/data'), et un bloc catch(err) qui log l'erreur console.",
            "difficulty": "Difficile",
            "solution": "const run = async () => {\\n  try {\\n    const res = await fetch('/data');\\n  } catch (err) {\\n    console.log(err);\\n  }\\n};",
            "hints": [
              "Si fetch crash en réseau global, le JS est suspendu et déroute au catch local."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "3. Communication HTTP Mondiale : L'API Native Fetch",
        "description": "Le composant crucial client-serveur pour le développement WEB REST.",
        "order": 3,
        "duration": "8 heures",
        "content": "Pour que le FrontEnd (React/JSVanilla) discute avec un Backend (NodeJS/Django/Spring), le standard natif implémenté mondialement se nomme `fetch()`. Fetch lance une transmission en requête Request de méthode Verbe HTTP (GET par défaut passif) via le réseau TCP, puis ramène une Response. La particularité critique : c'est un flux Stream asynchrone brut illisible ! Pour extraire et lire l'enveloppe JSON matérielle venue du Backend, le JS Front exige une *seconde phase async* de transformation, d'où la syntaxe iconique double de décodage serveur (`await fetch('url')` PUIS `await reponseData.json()`). En cas de requête de mutation (création POST au Serveur, Update locale PUT), le fetch nécessite un Object Argument deuxième très lourd contenant le verbe Method, les Headers cruciaux ('Content-Type': 'application/json') et enfin le corps Stringifié formellement pour transfert ('body: JSON.stringify(object_js)').",
        "objectives": [
          "Décoder les méandres du flux REST Client-Serveur Bidirectionnel.",
          "Saisir la subtilité absolue du stringify formel lors des mutations réseau backend Data.",
          "Injecter méthodologiquement le Header formel 'Authorization: Bearer TokenJWT' pour accès route privée Admin."
        ],
        "exercises": [
          {
            "title": "Le Double Décodage Fetch Await API",
            "description": "Dans un bloc local, récupérez const res = await fetch('url'). Sur l'instruction stricte qui suit, créez et remplissez const donneesFormelles valant la Promesse décodée asyncrone matérielle locale issue de res.json() !",
            "difficulty": "Difficile",
            "solution": "const res = await fetch('url');\\nconst donneesFormelles = await res.json();",
            "hints": [
              "Ne JAMAIS oublier le fait mathématique que .json() renvoie elle-aussi d'elle-même une nouvelle Promesse demandant impérativement son Await."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "4. Concepts Ingénieurs JS : Closures (Fermetures) & Classes POO",
        "description": "Pénétration absolue de l'architecture bas niveau (Lexical Environment) et syntaxe Orientée Objet ES2015+.",
        "order": 4,
        "duration": "8 heures",
        "content": "Les fonctions JavaScript sont de Premières Class Citoyennes, c-à-d elles agissent comme n'importe variable. Plus troublant : la fonction enfant d'une autre fonction **se souviendra mathématiquement toujours éternellement des valeurs variables locales de sa mère**, *MÊME une fois que la fonction mère s'est finie et a été détruite du CallStack Garbage Collector* ! C'est ce miracle fondamental d'isolation mémoire qu'on appelle historiquement 'Closure'. Les patterns design de pointe en découlent (React Hooks useState natifs). Plus formellement aujourd'hui sur ES6, JS apporte du Syntactic Sugar avec l'intégration du système de Class type JAVA (`class Humain {}`), le polymorphisme d'héritage (`class Magicien extends Humain {}`), les constructeurs (`constructor(nom) {}`), et l'immuable encapsulation de classe `#methodeprivee` pour structurer logiquement les grosses applications complexes en Composants d'ingénierie Logicielle formels purs OOP.",
        "objectives": [
          "Identifier formellement des zones critiques Closures isolées (Privatisation Lexicale globale sans classe).",
          "Construire, initier via Constructeur de Classe et hériter Polymorphe.",
          "Invoquer avec super() l'instance de modèle constructeur classe de Parents globaux."
        ],
        "exercises": [
          {
            "title": "Syntaxe de Classe de Base (OOP Class)",
            "description": "Dans le scope, déclarez une class JS nommée simple 'User'. Déclarez à l'intérieur la méthode locale typique 'constructor(nom)' qui mettra formellement local sur scope 'this.name' l'argument reçu 'nom'.",
            "difficulty": "Moyen",
            "solution": "class User {\\n  constructor(nom) {\\n    this.name = nom;\\n  }\\n}",
            "hints": [
              "En Programmation Objet Classique JS, `this` invoque le contexte spatial de l'objet qui viendra plus tard en être formellement instancié nativement."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "PHP - Niveau Débutant : La Dynamique du Web",
    "description": "Découvrez le langage qui propulse 80% d'internet. Apprenez à transformer des pages HTML statiques en applications web vivantes et interactives.",
    "category": "Programmation",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1599507593499-a3f7d1d94211?w=800&q=80",
    "rating": 4.7,
    "students": 18000,
    "language": "php",
    "isFree": true,
    "tags": [
      "PHP",
      "backend",
      "web",
      "débutant",
      "html"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Architecture Client-Serveur et Premier Script",
        "description": "Comprenez comment le code PHP s'exécute sur le serveur avant d'atteindre le navigateur.",
        "order": 1,
        "duration": "6 heures",
        "content": "Contrairement au HTML/CSS, PHP est un langage de script côté serveur. Lorsqu'un utilisateur demande une page `.php`, le serveur (Apache/Nginx) traite les balises `<?php ... ?>` et renvoie du HTML pur au navigateur. Nous aborderons la configuration de l'environnement (XAMPP/Docker), la déclaration de variables avec `$`, et l'utilisation de `echo` pour l'affichage. Vous apprendrez également l'importance du point-virgule et les commentaires.",
        "objectives": [
          "Installer et configurer un serveur local PHP",
          "Intégrer du PHP dans un fichier HTML",
          "Utiliser les variables et les types scalaires (string, int, float, bool)"
        ],
        "exercises": [
          {
            "title": "Votre Premier Echo Dynamique",
            "description": "Créez une variable `$nom` et affichez la phrase 'Bienvenue sur Mysterious Learn, [nom]' en utilisant la concaténation.",
            "difficulty": "Facile",
            "solution": "<?php\n$nom = \"Apprenti\";\necho \"Bienvenue sur Mysterious Learn, \" . $nom;\n?>",
            "hints": [
              "Utilisez le point (.) pour relier deux chaînes de caractères."
            ]
          }
        ],
        "resources": [
          {
            "title": "PHP: The Right Way - Getting Started",
            "type": "article",
            "url": "https://phptherightway.com/"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Logique de Contrôle et Tableaux Associatifs",
        "description": "Maîtrisez les conditions, les boucles et la structure de données reine du PHP : l'Array.",
        "order": 2,
        "duration": "8 heures",
        "content": "Un programme sans condition n'est qu'une simple liste. Nous étudierons `if`, `else`, `elseif` et le `switch`. Nous passerons ensuite aux tableaux, pilier du langage. C++ a ses vecteurs, PHP a ses **Tableaux Associatifs** (`['clé' => 'valeur']`). Vous apprendrez à utiliser `foreach` pour itérer élégamment sur ces données, une compétence vitale pour afficher des listes d'articles ou de produits.",
        "objectives": [
          "Structurer des conditions complexes",
          "Manipuler des tableaux multidimensionnels",
          "Utiliser foreach comme un pro pour parser des données"
        ],
        "exercises": [
          {
            "title": "Le Menu Dynamique",
            "description": "Soit un tableau `$menu = ['Accueil' => 'index.php', 'Profil' => 'profile.php']`. Générez une liste HTML `<ul><li>` via une boucle foreach.",
            "difficulty": "Moyen",
            "solution": "<ul>\n<?php foreach($menu as $nom => $url): ?>\n  <li><a href='<?= $url ?>'><?= $nom ?></a></li>\n<?php endforeach; ?>\n</ul>",
            "hints": [
              "Utilisez la syntaxe alternative des boucles (`:`, `endforeach`) pour une meilleure lisibilité dans le HTML."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Fonctions, Portée et Passage de Paramètres",
        "description": "Organisez votre code en blocs réutilisables. Comprenez la portée globale vs locale.",
        "order": 3,
        "duration": "8 heures",
        "content": "Ne vous répétez pas (DRY). Nous apprendrons à créer des fonctions personnalisées avec des paramètres par défaut et des types de retour (PHP 7/8). Nous aborderons le piège du mot-clé `global` et pourquoi il faut l'éviter au profit de l'injection d'arguments. Nous introduirons également les fonctions anonymes (closures) et leur utilité dans les rappels.",
        "objectives": [
          "Écrire des fonctions typées proprement",
          "Comprendre la différence entre passage par valeur et par référence (&$var)",
          "Utiliser return pour renvoyer des résultats complexes"
        ],
        "exercises": [
          {
            "title": "Le Formateur de Prix",
            "description": "Écrivez une fonction `formatPrix` qui prend un nombre et retourne une chaîne avec le symbole '€' et deux décimales.",
            "difficulty": "Facile",
            "solution": "function formatPrix(float $prix): string {\n  return number_format($prix, 2) . \" €\";\n}",
            "hints": [
              "Utilisez la fonction native number_format() de PHP."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Gestion des Formulaires et Sécurité XSS",
        "description": "Récupérez les données utilisateur via $_GET et $_POST. Apprenez à neutraliser les injections de scripts.",
        "order": 4,
        "duration": "8 heures",
        "content": "Le web est interactif grâce aux formulaires. Nous étudierons comment PHP intercepte ces données via les superglobales. **Sécurité Critique :** Ne jamais faire confiance à l'utilisateur. Vous apprendrez à utiliser `htmlspecialchars()` pour prévenir les failles Cross-Site Scripting (XSS). Nous aborderons également le nettoyage (sanitization) des données avant traitement.",
        "objectives": [
          "Choisir entre GET et POST selon le cas d'usage",
          "Valider la présence des données avec empty() et isset()",
          "Appliquer une protection systématique sur les affichages dynamiques"
        ],
        "exercises": [
          {
            "title": "Le Formulaire de Contact Sécure",
            "description": "Interceptez un champ 'message' envoyé en POST et affichez-le en vous protégeant contre les injections HTML.",
            "difficulty": "Moyen",
            "solution": "<?php\nif(!empty($_POST['message'])) {\n  echo \"Votre message : \" . htmlspecialchars($_POST['message']);\n} ?>",
            "hints": [
              "L'injection de `<script>` dans un formulaire est la menace N°1 des débutants."
            ]
          }
        ],
        "resources": [
          {
            "title": "OWASP: Preventing XSS in PHP",
            "type": "article",
            "url": "https://owasp.org/www-community/attacks/xss/"
          }
        ]
      }
    ]
  },
  {
    "title": "PHP - Niveau Intermédiaire : Base de Données & Sessions",
    "description": "Passez au backend professionnel. Connectez-vous à MySQL avec PDO, gérez l'authentification des utilisateurs et structurez votre code en MVC.",
    "category": "Programmation",
    "level": "Intermédiaire",
    "duration": "45 heures",
    "image": "https://images.unsplash.com/photo-1599507593499-a3f7d1d94211?w=800&q=80",
    "rating": 4.8,
    "students": 14000,
    "language": "php",
    "isFree": true,
    "tags": [
      "PHP",
      "PDO",
      "sessions",
      "MySQL",
      "intermédiaire",
      "MVC"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : PDO et Requêtes Préparées (Anti-Injection SQL)",
        "description": "Connectez PHP à MySQL de manière moderne. Éradiquez les injections SQL définitivement.",
        "order": 1,
        "duration": "12 heures",
        "content": "L'ancienne extension `mysql_` est morte. Nous utiliserons **PDO (PHP Data Objects)**. C'est une interface d'abstraction qui permet de changer de base de données sans réécrire tout le code. Point crucial : les **Requêtes Préparées**. En séparant la structure de la requête des données de l'utilisateur, on rend les injections SQL physiquement impossibles. Vous maîtriserez `prepare()`, `bindValue()` et `execute()`.",
        "objectives": [
          "Établir une connexion robuste via DSN",
          "Exécuter des SELECT, INSERT et UPDATE sécurisés",
          "Gérer les erreurs de base de données via les exceptions PDO"
        ],
        "exercises": [
          {
            "title": "Récupération d'un Utilisateur",
            "description": "Écrivez le code PDO pour récupérer un utilisateur par son ID en utilisant une requête préparée.",
            "difficulty": "Difficile",
            "solution": "$stmt = $db->prepare(\"SELECT * FROM users WHERE id = ?\");\n$stmt->execute([$id]);\n$user = $stmt->fetch();",
            "hints": [
              "Le marqueur '?' ou les paramètres nommés (:id) sont obligatoires pour la sécurité."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Sessions, Cookies et Authentification",
        "description": "Rendez le serveur intelligent. Gérez la connexion des utilisateurs et les cookies de préférence.",
        "order": 2,
        "duration": "11 heures",
        "content": "HTTP est apatride (stateless). Pour qu'un site sache que vous êtes connecté, on utilise les **Sessions**. Nous étudierons `session_start()`, le stockage de données dans `$_SESSION` et le cycle de vie du cookie `PHPSESSID`. Vous apprendrez à créer un système de login complet avec hachage de mot de passe sécurisé via `password_hash()` (Argon2/Bcrypt) et vérification via `password_verify()`.",
        "objectives": [
          "Démarrer et détruire une session proprement",
          "Protéger une page avec une condition de connexion",
          "Ne jamais stocker de mots de passe en clair (Interdiction absolue)"
        ],
        "exercises": [
          {
            "title": "Le Gardien de Page",
            "description": "Écrivez le début d'un fichier `admin.php` qui redirige vers `login.php` si l'utilisateur n'a pas la clé 'user_id' en session.",
            "difficulty": "Moyen",
            "solution": "<?php\nsession_start();\nif(!isset($_SESSION['user_id'])) {\n  header('Location: login.php');\n  exit();\n} ?>",
            "hints": [
              "header('Location: ...') doit être suivi d'un exit() pour arrêter l'exécution."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Architecture MVC et Séparation des Responsabilités",
        "description": "Arrêtez le code spaghetti. Séparez votre logique métier de votre affichage HTML.",
        "order": 3,
        "duration": "12 heures",
        "content": "Le design pattern **MVC (Modèle-Vue-Contrôleur)** est le standard de l'industrie. 1) Le Modèle gère la donnée (requêtes SQL). 2) La Vue gère l'affichage (HTML/CSS). 3) Le Contrôleur fait le lien, traite les entrées et décide quoi afficher. Nous construirons une architecture simplifiée pour comprendre comment les grands frameworks (Symfony, Laravel) fonctionnent sous le capot.",
        "objectives": [
          "Refactorer un script monolithique en architecture MVC",
          "Comprendre le rôle du Routeur (Front Controller)",
          "Maintenir une base de code propre et évolutive"
        ],
        "exercises": [
          {
            "title": "Logique de Contrôleur",
            "description": "Dans un schéma MVC, quel composant doit contenir la vérification d'un formulaire et l'appel au modèle ?",
            "difficulty": "Facile",
            "solution": "Le Contrôleur.",
            "hints": [
              "Il agit comme le chef d'orchestre entre l'utilisateur et les données."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Manipulation de Fichiers et Upload Sécurisé",
        "description": "Gérez les avatars et les documents. Apprenez à valider les types MIME et les tailles de fichiers.",
        "order": 4,
        "duration": "10 heures",
        "content": "L'upload de fichiers est une zone critique pour la sécurité. Nous étudierons `$_FILES`, le déplacement des fichiers temporaires avec `move_uploaded_file()` et la validation stricte des extensions. Vous apprendrez pourquoi renommer un fichier uploadé est une mesure de sécurité indispensable pour éviter l'écrasement ou l'exécution de scripts malveillants.",
        "objectives": [
          "Vérifier la taille et le type réel (MIME) d'un fichier",
          "Générer des noms de fichiers uniques",
          "Sécuriser le dossier de destination"
        ],
        "exercises": [
          {
            "title": "Vérifier l'Extension",
            "description": "Utilisez `pathinfo()` pour vérifier que le fichier uploadé a bien une extension '.jpg' ou '.png'.",
            "difficulty": "Moyen",
            "solution": "$ext = pathinfo($_FILES['img']['name'], PATHINFO_EXTENSION);\nif(!in_array($ext, ['jpg', 'png'])) die('Refusé');",
            "hints": [
              "Ne vous fiez jamais uniquement au type MIME envoyé par le navigateur."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "PHP - Niveau Expert Mondiale : Programmation Orientée Objet & Frameworks",
    "description": "Maîtrisez le PHP moderne de 2024. Plongez dans la POO avancée, les Namespaces, Composer, et les standards PSR utilisés par les ingénieurs Facebook et Slack.",
    "category": "Programmation",
    "level": "Avancé",
    "duration": "65 heures",
    "image": "https://images.unsplash.com/photo-1599507593499-a3f7d1d94211?w=800&q=80",
    "rating": 5,
    "students": 9000,
    "language": "php",
    "isFree": true,
    "tags": [
      "PHP",
      "OOP",
      "Composer",
      "PSR",
      "Symfony",
      "Laravel",
      "Expert"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : POO Avancée : Classes, Héritage et Interfaces",
        "description": "Pensez en Objets. Maîtrisez la visibilité, les méthodes statiques et les contrats d'interfaces.",
        "order": 1,
        "duration": "18 heures",
        "content": "Le PHP moderne est 100% orienté objet. Nous étudierons en profondeur : l'encapsulation réelle (`private` vs `protected`), l'héritage, et surtout les **Interfaces**. Une interface définit un contrat : toute classe qui l'implémente *doit* posséder certaines méthodes. C'est la base du découplage et de l'injection de dépendances. Nous aborderons également les **Traits**, une solution élégante au manque d'héritage multiple en PHP.",
        "objectives": [
          "Modéliser des systèmes complexes via des hiérarchies d'objets",
          "Implémenter le polymorphisme via les interfaces",
          "Utiliser le chaînage de méthodes (Fluent Interface)"
        ],
        "exercises": [
          {
            "title": "L'Interface de Paiement",
            "description": "Créez une interface `PaymentMethod` avec une méthode `pay(float $amt)`. Implémentez `Paypal` et `Stripe`.",
            "difficulty": "Difficile",
            "solution": "interface PaymentMethod { public function pay(float $amt); }\nclass Stripe implements PaymentMethod {\n  public function pay(float $amt) { /* Logique Stripe */ }\n}",
            "hints": [
              "L'interface force les développeurs à suivre une structure commune."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Namespaces, Autoloading et Composer",
        "description": "Organisez des projets massifs. Maîtrisez le gestionnaire de paquets Composer et le standard PSR-4.",
        "order": 2,
        "duration": "15 heures",
        "content": "Fini les `require` à chaque ligne. Les **Namespaces** isolent votre code pour éviter les collisions de noms de classes. Vous apprendrez à configurer **Composer**, l'outil indispensable de l'écosystème PHP, pour gérer vos dépendances (librairies externes) et l'autoloading automatique via le standard **PSR-4**. C'est ainsi que vous pourrez importer n'importe quel package (envoi de mail, gestion d'images, framework) en une commande.",
        "objectives": [
          "Installer et configurer Composer dans un projet",
          "Mettre en place un Autoloader PSR-4 personnalisé",
          "Utiliser des librairies tierces via Packagist"
        ],
        "exercises": [
          {
            "title": "Installer une librairie",
            "description": "Quelle commande Composer permet d'ajouter la librairie 'Guzzle' (requêtes HTTP) à votre projet ?",
            "difficulty": "Facile",
            "solution": "composer require guzzlehttp/guzzle",
            "hints": [
              "Composer recherche automatiquement sur Packagist.org."
            ]
          }
        ],
        "resources": [
          {
            "title": "Composer: Dependency Manager for PHP",
            "type": "article",
            "url": "https://getcomposer.org/"
          }
        ]
      },
      {
        "title": "Chapitre 3 : Exceptions, Typage Strict et PHP 8.x Features",
        "description": "Écrivez du code indestructible. Utilisez le typage strict (`declare(strict_types=1)`) et les nouvelles syntaxes (Readonly, Union Types).",
        "order": 3,
        "duration": "15 heures",
        "content": "PHP n'est plus le langage 'mou' du passé. Nous activerons le **mode strict** pour transformer les erreurs silencieuses en exceptions fatales immédiates. Nous explorerons les pépites de PHP 8 : les **Constructor Property Promotion** (réduit le code par 3), les **Attributs** (métadonnées), les **Union Types** (`string|int`) et l'opérateur **Nullsafe** (`$user?->getAddress()`). Apprendre ces syntaxes vous place instantanément dans le top 5% des développeurs PHP.",
        "objectives": [
          "Sécuriser le code via `strict_types`",
          "Utiliser les Match expressions au lieu des switch",
          "Manipuler les propriétés readonly pour l'immutabilité"
        ],
        "exercises": [
          {
            "title": "Promotion de Propriété",
            "description": "Réécrivez une classe User avec constructeur classique en utilisant la syntaxe 'Property Promotion' de PHP 8.",
            "difficulty": "Moyen",
            "solution": "class User {\n  public function __construct(public string $name) {}\n}",
            "hints": [
              "Il suffit d'ajouter la visibilité (public/private) devant l'argument du constructeur."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Création d'API REST et Middlewares",
        "description": "Transformez PHP en moteur de données pour React/Vue. Maîtrisez le JSON, les Headers CORS et les JWT.",
        "order": 4,
        "duration": "17 heures",
        "content": "Aujourd'hui, PHP ne génère pas toujours du HTML, il sert souvent d'API. Nous apprendrons à configurer les en-têtes HTTP pour renvoyer du JSON (`header('Content-Type: application/json')`). Nous aborderons le concept de **Middleware** pour filtrer les requêtes (auth, logs) avant qu'elles n'atteignent le contrôleur. Enfin, nous introduirons les **JWT (JSON Web Tokens)** pour une authentification sans état entre un frontend JS et votre backend PHP.",
        "objectives": [
          "Concevoir une architecture API Headless",
          "Gérer les requêtes pré-vol (CORS OPTIONS)",
          "Sécuriser une API via Token Authorization"
        ],
        "exercises": [
          {
            "title": "La Réponse JSON",
            "description": "Écrivez la ligne PHP pour transformer un tableau associatif en chaîne JSON et l'afficher.",
            "difficulty": "Facile",
            "solution": "echo json_encode(['status' => 'ok']);",
            "hints": [
              "Utilisez json_encode() pour l'encodage."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "MongoDB - Niveau Débutant : La Révolution NoSQL",
    "description": "Découvrez le monde NoSQL. Apprenez à manipuler une base de données orientée documents avec une souplesse totale face aux contraintes du SQL classique.",
    "category": "Data",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1544383835-bda2bc66a55d?w=800&q=80",
    "rating": 4.8,
    "students": 12500,
    "language": "mongodb",
    "isFree": true,
    "tags": [
      "MongoDB",
      "NoSQL",
      "Data",
      "JSON",
      "BSON",
      "débutant"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Introduction au NoSQL et format BSON",
        "description": "Oubliez les tables et jointures. Pensez en Documents et Collections.",
        "order": 1,
        "duration": "6 heures",
        "content": "MongoDB est une base de données orientée Documents. Contrairement au SQL qui utilise des lignes et des colonnes rigides, MongoDB utilise du **BSON** (Binary JSON). Cela permet de stocker des données imbriquées (tableaux, objets) directement dans un seul enregistrement. Nous aborderons la hiérarchie : Instance > Database > Collection > Document. Vous apprendrez pourquoi le NoSQL est le choix privilégié pour le Big Data et les applications à évolution rapide.",
        "objectives": [
          "Installer et configurer MongoDB (Community Server / Atlas)",
          "Comprendre la différence entre SQL et NoSQL",
          "Manipuler des documents JSON simples"
        ],
        "exercises": [
          {
            "title": "Comparaison de Vocabulaire",
            "description": "Quels sont les équivalents MongoDB d'une 'Table' et d'une 'Ligne' SQL ?",
            "difficulty": "Facile",
            "solution": "Table = Collection\nLigne = Document",
            "hints": [
              "Les documents sont regroupés dans des collections."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Opérations CRUD de base (Insert & Find)",
        "description": "Maîtrisez l'insertion et la récupération de données via le Shell MongoDB (mongosh).",
        "order": 2,
        "duration": "8 heures",
        "content": "Nous apprendrons à converser avec la base. `db.collection.insertOne()` pour créer, et l'incontournable `db.collection.find()` pour lire. Vous découvrirez l'**ObjectId** (`_id`), l'identifiant unique généré automatiquement par MongoDB qui inclut un timestamp. Nous aborderons le filtrage simple par égalité et l'utilisation de `pretty()` pour rendre les résultats lisibles.",
        "objectives": [
          "Insérer des documents avec des champs dynamiques",
          "Filtrer des résultats par un attribut simple",
          "Limiter et projeter les champs (ne récupérer que les noms)"
        ],
        "exercises": [
          {
            "title": "Premier Insert",
            "description": "Écrivez la commande pour insérer un utilisateur nommé 'Boss Fall' avec l'âge 35 dans la collection 'users'.",
            "difficulty": "Facile",
            "solution": "db.users.insertOne({ name: 'Boss Fall', age: 35 });",
            "hints": [
              "Utilisez les accolades {} pour définir l'objet JSON."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Mise à jour Dynamique et Opérateurs ($set, $inc)",
        "description": "Modifiez vos documents sans les écraser. Maîtrisez la mise à jour atomique de champs spécifiques.",
        "order": 3,
        "duration": "8 heures",
        "content": "Mettre à jour un document en NoSQL est puissant grâce aux opérateurs atomiques. `$set` change une valeur, `$inc` incrémente un nombre (parfait pour les scores ou les stocks), `$push` ajoute un élément à un tableau. Vous apprendrez à utiliser `updateOne()` et `updateMany()` avec précision. **Attention :** Oublier un opérateur comme `$set` peut écraser l'intégralité du document par un nouvel objet !",
        "objectives": [
          "Incrémenter une valeur numérique sans la lire au préalable",
          "Ajouter un tag à une liste d'intérêts via $push",
          "Utiliser l'option upsert pour créer si inexistant"
        ],
        "exercises": [
          {
            "title": "Incrémentation de Score",
            "description": "Écrivez la commande pour ajouter 10 points au score de l'utilisateur ayant l'id 101.",
            "difficulty": "Moyen",
            "solution": "db.users.updateOne({ _id: 101 }, { $inc: { score: 10 } });",
            "hints": [
              "$inc est l'opérateur de calcul atomique."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Filtrage Avancé et Opérateurs de Comparaison",
        "description": "Allez au-delà de l'égalité. Filtrez par plage de valeurs, présence dans un tableau ou expressions régulières.",
        "order": 4,
        "duration": "8 heures",
        "content": "MongoDB utilise des opérateurs de comparaison préfixés par `$`. `$gt` (Greater Than), `$lt` (Less Than), `$in` (parmi une liste), `$exists` (présence d'un champ). Nous étudierons également la logique booléenne avec `$or` et `$and`. Vous apprendrez à requêter à l'intérieur de tableaux imbriqués, une fonctionnalité où le NoSQL écrase le SQL en termes de simplicité syntaxique.",
        "objectives": [
          "Rechercher des utilisateurs ayant entre 18 et 30 ans",
          "Trouver des documents possédant un tag spécifique dans une liste",
          "Rechercher par texte partiel via $regex"
        ],
        "exercises": [
          {
            "title": "Filtre de Majorité",
            "description": "Trouvez tous les utilisateurs dont l'âge est supérieur ou égal à 18.",
            "difficulty": "Moyen",
            "solution": "db.users.find({ age: { $gte: 18 } });",
            "hints": [
              "$gte signifie 'Greater Than or Equal'."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "MongoDB - Niveau Intermédiaire : Mongoose & Modélisation",
    "description": "Mettez de l'ordre dans le NoSQL. Apprenez à utiliser Mongoose pour structurer vos applications Node.js et à optimiser vos recherches via les index.",
    "category": "Data",
    "level": "Intermédiaire",
    "duration": "45 heures",
    "image": "https://images.unsplash.com/photo-1544383835-bda2bc66a55d?w=800&q=80",
    "rating": 4.8,
    "students": 8500,
    "language": "mongodb",
    "isFree": true,
    "tags": [
      "MongoDB",
      "Mongoose",
      "Node.js",
      "Indexation",
      "intermédiaire"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Mongoose ODM : Schémas et Modèles",
        "description": "Donnez une structure à vos données. Apprenez à valider et typer vos documents côté application.",
        "order": 1,
        "duration": "12 heures",
        "content": "Le NoSQL est 'Schemaless', ce qui peut mener au chaos. **Mongoose** est un ODM (Object Data Modeling) qui permet de définir des schémas stricts en JavaScript. Nous apprendrons à définir des types, des valeurs par défaut, et des validateurs personnalisés (ex: email valide). Vous découvrirez les **Middlewares Mongoose** (pre/post save) pour automatiser des tâches comme le hachage de mot de passe avant insertion.",
        "objectives": [
          "Connecter Node.js à MongoDB via Mongoose",
          "Définir un schéma avec des contraintes required et unique",
          "Utiliser les modèles pour effectuer des opérations CRUD asynchrones"
        ],
        "exercises": [
          {
            "title": "Le Schéma Produit",
            "description": "Définissez un schéma Mongoose pour un produit avec un 'nom' (string, obligatoire) et un 'prix' (number, min 0).",
            "difficulty": "Moyen",
            "solution": "const productSchema = new mongoose.Schema({\n  nom: { type: String, required: true },\n  prix: { type: Number, min: 0 }\n});",
            "hints": [
              "Utilisez l'objet de configuration pour ajouter des validateurs comme min."
            ]
          }
        ],
        "resources": [
          {
            "title": "Mongoose Official Documentation",
            "type": "article",
            "url": "https://mongoosejs.com/docs/guide.html"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Indexation et Performance",
        "description": "Accélérez vos requêtes. Comprenez comment les index transforment un parcours de collection lent en une recherche instantanée.",
        "order": 2,
        "duration": "11 heures",
        "content": "Par défaut, MongoDB parcourt chaque document pour trouver un match (Collection Scan). Un **Index** est une structure de données (B-Tree) ordonnée qui pointe vers les documents. Nous apprendrons à créer des index simples, uniques et composites. Vous utiliserez la méthode `.explain('executionStats')` pour comparer les performances avec et sans index et comprendre la différence entre un COLLSCAN et un IXSCAN.",
        "objectives": [
          "Identifier les champs à indexer en priorité",
          "Créer des index pour accélérer le tri (Sort)",
          "Comprendre le coût des index sur les opérations d'écriture"
        ],
        "exercises": [
          {
            "title": "L'Index Unique",
            "description": "Quelle commande Mongoose permet de s'assurer qu'un index unique est créé sur le champ 'email' ?",
            "difficulty": "Facile",
            "solution": "email: { type: String, unique: true }",
            "hints": [
              "Mongoose gère la création de l'index MongoDB basé sur cette propriété."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Relations entre Documents (Populate vs Embedding)",
        "description": "Jointures NoSQL ? Apprenez quand imbriquer les données et quand utiliser les références (Population).",
        "order": 3,
        "duration": "12 heures",
        "content": "Il n'y a pas de JOIN automatique en MongoDB. Deux stratégies existent : 1) **Embedding** : Stocker l'adresse *dans* le document utilisateur (Performance de lecture maximale). 2) **Referencing** : Stocker l'ID de l'adresse et utiliser `.populate()` dans Mongoose pour 'recoller' les morceaux. Vous apprendrez à choisir la meilleure stratégie selon la cardinalité (1-1, 1-N, N-N).",
        "objectives": [
          "Implémenter la population de documents liés",
          "Maîtriser les tableaux de sous-documents",
          "Éviter le piège des documents trop lourds (>16 Mo)"
        ],
        "exercises": [
          {
            "title": "Récupérer avec Auteur",
            "description": "Soit un modèle Post avec un champ author (ObjectId). Utilisez .populate pour récupérer le post ET l'objet auteur complet.",
            "difficulty": "Difficile",
            "solution": "await Post.find().populate('author');",
            "hints": [
              "Le champ doit être défini avec 'ref' dans le schéma."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Méthodes de Instance et Virtuels",
        "description": "Ajoutez de l'intelligence à vos modèles. Créez des propriétés calculées qui n'encombrent pas la base de données.",
        "order": 4,
        "duration": "10 heures",
        "content": "Mongoose permet d'ajouter des méthodes à vos instances d'objets (ex: `user.comparePassword()`). Plus puissant encore : les **Virtuels**. Ce sont des propriétés qui n'existent pas dans MongoDB mais qu'on peut lire (ex: `user.fullName` combinant prénom et nom). Vous apprendrez à transformer vos documents en objets intelligents, simplifiant grandement le code de votre contrôleur.",
        "objectives": [
          "Créer des champs virtuels (getters/setters)",
          "Ajouter des méthodes statiques au modèle",
          "Personnaliser le format JSON de sortie (toJSON)"
        ],
        "exercises": [
          {
            "title": "Le Virtuel Nom Complet",
            "description": "Créez un virtuel 'fullname' qui retourne la concaténation de 'firstname' et 'lastname'.",
            "difficulty": "Moyen",
            "solution": "schema.virtual('fullname').get(function() {\n  return `${this.firstname} ${this.lastname}`;\n});",
            "hints": [
              "Les virtuels ne sont pas stockés en base, ils sont calculés à la volée."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "MongoDB - Niveau Expert Mondiale : Aggregation & Architectures",
    "description": "Maîtrisez le pipeline d'agrégation, le traitement massif de données et la haute disponibilité. Devenez un expert du Big Data et des clusters distribués.",
    "category": "Data",
    "level": "Avancé",
    "duration": "65 heures",
    "image": "https://images.unsplash.com/photo-1544383835-bda2bc66a55d?w=800&q=80",
    "rating": 4.9,
    "students": 4000,
    "language": "mongodb",
    "isFree": true,
    "tags": [
      "MongoDB",
      "Aggregation",
      "Pipelines",
      "Sharding",
      "ReplicaSet",
      "avancé"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Le Framework d'Agrégation (Aggregation Pipeline)",
        "description": "Le processeur de données de MongoDB. Apprenez à transformer, grouper et filtrer des millions de documents en étapes successives.",
        "order": 1,
        "duration": "20 heures",
        "content": "L'agrégation est l'outil le plus puissant de MongoDB. Au lieu d'un simple `find`, on utilise un tableau d'étapes (`stages`). `$match` pour filtrer, `$group` pour calculer des stats, `$sort`, `$limit`, et surtout `$lookup` pour effectuer des jointures complexes. Vous apprendrez à construire des pipelines d'analyse de données capables de générer des rapports financiers ou des statistiques d'utilisation en temps réel directement sur le serveur de base de données.",
        "objectives": [
          "Maîtriser le passage de données entre les étapes du pipeline",
          "Effectuer des jointures multi-collections avec $lookup",
          "Utiliser $unwind pour traiter les éléments d'un tableau individuellement"
        ],
        "exercises": [
          {
            "title": "Chiffre d'Affaire par Client",
            "description": "Créez un pipeline qui filtre les ventes 'complétées', les groupe par 'client_id' et fait la somme du champ 'montant'.",
            "difficulty": "Difficile",
            "solution": "db.sales.aggregate([\n  { $match: { status: 'completed' } },\n  { $group: { _id: '$client_id', total: { $sum: '$montant' } } }\n]);",
            "hints": [
              "Utilisez le préfixe $ pour référencer un nom de champ dans une étape d'agrégation."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Indexation Avancée (Multikey, Text, TTL)",
        "description": "Gérez les cas spéciaux. Accélérez les recherches dans les tableaux, le texte plein et gérez l'expiration automatique des données.",
        "order": 2,
        "duration": "15 heures",
        "content": "Les index standards ne suffisent pas toujours. Nous explorerons : 1) **Text Indexes** pour la recherche par mots-clés (moteur de recherche basique). 2) **TTL Indexes** (Time To Live) pour supprimer automatiquement les documents (ex: sessions, logs) après un délai. 3) **Partial Indexes** pour n'indexer qu'une partie de la collection (gain de place). Vous apprendrez également à gérer l'indexation des tableaux via les **Multikey Indexes**.",
        "objectives": [
          "Implémenter une recherche textuelle floue",
          "Configurer une mise en cache auto-expirante via TTL",
          "Optimiser l'espace disque avec les index partiels"
        ],
        "exercises": [
          {
            "title": "Suppression Automatique",
            "description": "Créez un index TTL qui supprime les documents de la collection 'logs' 3600 secondes après leur création.",
            "difficulty": "Moyen",
            "solution": "db.logs.createIndex({ createdAt: 1 }, { expireAfterSeconds: 3600 });",
            "hints": [
              "Le champ doit être de type Date ou ISODate."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Replica Sets (Haute Disponibilité)",
        "description": "Zéro temps d'arrêt. Apprenez à répliquer vos données sur plusieurs serveurs pour survivre aux pannes matérielles.",
        "order": 3,
        "duration": "15 heures",
        "content": "En production, un serveur seul est un risque. Un **Replica Set** est un groupe d'instances MongoDB qui maintiennent le même jeu de données. Nous étudierons le mécanisme d'élection : si le Master (Primary) meurt, les Secondaries élisent un nouveau chef en quelques secondes de manière transparente pour l'application. Vous apprendrez à configurer la **Read Preference** pour orienter les lectures vers les secondaires et soulager le master.",
        "objectives": [
          "Configurer un Replica Set local de 3 nœuds",
          "Comprendre le Write Concern pour garantir l'écriture sur plusieurs serveurs",
          "Gérer les problèmes de cohérence éventuelle (Eventual Consistency)"
        ],
        "exercises": [
          {
            "title": "Le Rôle du Primaire",
            "description": "Dans un Replica Set, quelle est la seule instance autorisée à recevoir les opérations d'Écriture (Write) ?",
            "difficulty": "Facile",
            "solution": "L'instance Primary.",
            "hints": [
              "Les instances Secondary sont en lecture seule par défaut."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Sharding (Passage à l'Échelle Horizontale)",
        "description": "Gérez des péta-octets de données. Apprenez à distribuer une collection unique sur des dizaines de serveurs physiques.",
        "order": 4,
        "duration": "15 heures",
        "content": "Quand une seule machine ne suffit plus pour stocker ou traiter vos données, on utilise le **Sharding**. C'est le découpage horizontal des données. Nous étudierons le rôle des **Shard Keys**, du **Config Server** et du routeur **Mongos**. Vous apprendrez comment MongoDB répartit dynamiquement les morceaux de données (chunks) entre les serveurs pour équilibrer la charge. C'est le sommet de l'ingénierie database distribuée.",
        "objectives": [
          "Identifier une bonne Shard Key pour éviter les points chauds (Hotspots)",
          "Comprendre l'architecture d'un cluster sharded",
          "Suivre les performances d'un cluster distribué"
        ],
        "exercises": [
          {
            "title": "Choix de Shard Key",
            "description": "Pourquoi l'ID auto-incrémenté ou un Timestamp est généralement une MAUVAISE Shard Key ?",
            "difficulty": "Difficile",
            "solution": "Parce que toutes les nouvelles écritures iront vers le même Shard (le plus récent), créant un goulot d'étranglement alors que les autres serveurs restent inactifs.",
            "hints": [
              "On cherche une clé qui distribue les données de manière aléatoire ou uniforme sur tout le cluster."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "MySQL - Niveau Débutant : Maîtriser le SQL Fondamental",
    "description": "Apprenez le langage universel des données. De la création de tables aux requêtes de sélection complexes, forgez les bases de votre carrière de développeur backend.",
    "category": "Data",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=800&q=80",
    "rating": 4.8,
    "students": 15400,
    "language": "mysql",
    "isFree": true,
    "tags": [
      "MySQL",
      "SQL",
      "Data",
      "relationnel",
      "débutant",
      "backend"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Le Modèle Relationnel et Conception de Schéma",
        "description": "Comprenez pourquoi le SQL domine le monde. Apprenez à structurer des Tables, Lignes et Colonnes avec précision.",
        "order": 1,
        "duration": "6 heures",
        "content": "MySQL est un SGBDR (Système de Gestion de Bases de Données Relationnelles). Contrairement au vrac du NoSQL, ici tout est structuré. Nous explorerons les types de données fondamentaux : `INT` pour les calculs, `VARCHAR` pour le texte variable, `DATETIME` pour le temps. Vous apprendrez le concept vital de **Clé Primaire (Primary Key)** : l'identifiant unique et immuable de chaque ligne. Nous aborderons également l'auto-incrémentation pour automatiser la gestion des IDs.",
        "objectives": [
          "Installer et se connecter à un serveur MySQL (Workbench/CLI)",
          "Créer une base de données et sa première table",
          "Choisir les types de colonnes optimaux pour la mémoire"
        ],
        "exercises": [
          {
            "title": "La Table Utilisateurs",
            "description": "Écrivez la requête `CREATE TABLE` pour une table 'users' avec un id auto-incrémenté, un email unique de 100 caractères, et une date de création par défaut.",
            "difficulty": "Facile",
            "solution": "CREATE TABLE users (\n  id INT AUTO_INCREMENT PRIMARY KEY,\n  email VARCHAR(100) UNIQUE NOT NULL,\n  created_at DATETIME DEFAULT CURRENT_TIMESTAMP\n);",
            "hints": [
              "N'oubliez pas les contraintes NOT NULL pour les champs obligatoires."
            ]
          }
        ],
        "resources": [
          {
            "title": "SQL Basics: The Relational Model",
            "type": "article",
            "url": "https://sqlbolt.com/"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Manipulation de Données (CRUD) et Filtrage WHERE",
        "description": "Le cœur de l'interaction : Insérer, Lire, Mettre à jour et Supprimer des données avec des conditions strictes.",
        "order": 2,
        "duration": "8 heures",
        "content": "Tout développeur doit maîtriser les 4 verbes SQL. `INSERT INTO` pour alimenter, `SELECT` pour interroger. Nous étudierons en profondeur la clause `WHERE` et ses opérateurs (`=`, `<>`, `>`, `LIKE`, `IN`). **Attention :** Un `UPDATE` ou un `DELETE` sans `WHERE` est une catastrophe professionnelle qui efface ou modifie l'intégralité de la base. Vous apprendrez à utiliser l'opérateur `AND` et `OR` pour des filtrages multi-critères chirurgicaux.",
        "objectives": [
          "Insérer plusieurs lignes en une seule requête",
          "Utiliser le wildcard % avec LIKE pour les recherches textuelles",
          "Effectuer des mises à jour sécurisées sur des IDs spécifiques"
        ],
        "exercises": [
          {
            "title": "Le Filtre de Mail",
            "description": "Écrivez un SELECT pour trouver tous les utilisateurs dont l'email finit par '@gmail.com'.",
            "difficulty": "Facile",
            "solution": "SELECT * FROM users WHERE email LIKE '%@gmail.com';",
            "hints": [
              "Le signe % représente n'importe quelle suite de caractères."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Tri, Limitation et Pagination de Résultats",
        "description": "Contrôlez l'affichage de vos données. Apprenez à trier par date, par prix et à paginer pour le web.",
        "order": 3,
        "duration": "8 heures",
        "content": "Sur un site web, on n'affiche jamais 1 million de lignes d'un coup. Nous utiliserons `ORDER BY` pour classer (ASC/DESC) et `LIMIT` pour restreindre. Vous apprendrez la technique de l'**Offset** pour créer une pagination (ex: afficher les résultats 20 à 40). Nous aborderons également l'utilisation de `DISTINCT` pour supprimer les doublons visuels dans vos sélections.",
        "objectives": [
          "Classer des produits par prix décroissant",
          "Implémenter une logique de pagination SQL via LIMIT/OFFSET",
          "Éviter les doublons dans les rapports avec DISTINCT"
        ],
        "exercises": [
          {
            "title": "Les 5 Derniers Inscrits",
            "description": "Sélectionnez l'email des 5 derniers utilisateurs inscrits dans la table (basé sur l'id ou la date).",
            "difficulty": "Moyen",
            "solution": "SELECT email FROM users ORDER BY created_at DESC LIMIT 5;",
            "hints": [
              "Trier par date descendante met les plus récents en premier."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Fonctions d'Agrégation et Groupement (GROUP BY)",
        "description": "Devenez un analyste de données. Apprenez à compter, additionner et moyenner des millions de lignes instantanément.",
        "order": 4,
        "duration": "8 heures",
        "content": "Le SQL n'est pas qu'un stockage, c'est un moteur de calcul. Nous étudierons les fonctions d'agrégation : `COUNT()` pour dénombrer, `SUM()` pour totaliser, `AVG()` pour la moyenne, `MIN/MAX` pour les bornes. La puissance décuple avec `GROUP BY`, qui permet de sortir des statistiques par catégorie (ex: 'Chiffre d'affaires par pays'). Vous apprendrez la différence cruciale entre `WHERE` (filtre avant calcul) et `HAVING` (filtre après agrégation).",
        "objectives": [
          "Compter le nombre d'utilisateurs par domaine de mail",
          "Calculer le panier moyen d'une table de commandes",
          "Utiliser HAVING pour filtrer les groupes ayant plus de X éléments"
        ],
        "exercises": [
          {
            "title": "Stats par Catégorie",
            "description": "Soit une table 'produits' avec une colonne 'categorie'. Comptez combien de produits il y a dans chaque catégorie.",
            "difficulty": "Moyen",
            "solution": "SELECT categorie, COUNT(*) FROM produits GROUP BY categorie;",
            "hints": [
              "Chaque colonne sélectionnée qui n'est pas agrégée doit figurer dans le GROUP BY."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "MySQL - Niveau Intermédiaire : Jointures & Relations",
    "description": "Exploitez la puissance du relationnel. Apprenez à lier les tables entre elles, à garantir l'intégrité des données et à construire des schémas de données complexes.",
    "category": "Data",
    "level": "Intermédiaire",
    "duration": "45 heures",
    "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=800&q=80",
    "rating": 4.8,
    "students": 11000,
    "language": "mysql",
    "isFree": true,
    "tags": [
      "MySQL",
      "Jointures",
      "FOREIGN KEY",
      "intermédiaire",
      "DB Design"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Clés Étrangères et Intégrité Référentielle",
        "description": "Le ciment de vos données. Apprenez à lier un article à son auteur et à empêcher les orphelins dans votre DB.",
        "order": 1,
        "duration": "10 heures",
        "content": "Une **Clé Étrangère (Foreign Key)** est une colonne qui pointe vers la Clé Primaire d'une autre table. C'est ce qui crée la 'Relation'. Nous étudierons les contraintes d'intégrité : que se passe-t-il si on supprime un parent ? Vous apprendrez à configurer le `ON DELETE CASCADE` (suppression automatique des enfants) ou `ON DELETE SET NULL` pour maintenir une base de données cohérente et sans erreurs de pointeurs logiques.",
        "objectives": [
          "Concevoir une relation One-to-Many (Un vers Plusieurs)",
          "Mettre en place des contraintes de clés étrangères robustes",
          "Comprendre les moteurs de stockage (InnoDB vs MyISAM)"
        ],
        "exercises": [
          {
            "title": "Liaison Article/Auteur",
            "description": "Créez une table 'articles' possédant une clé étrangère 'user_id' pointant vers 'users.id'.",
            "difficulty": "Moyen",
            "solution": "CREATE TABLE articles (\n  id INT PRIMARY KEY AUTO_INCREMENT,\n  titre VARCHAR(200),\n  user_id INT,\n  FOREIGN KEY (user_id) REFERENCES users(id)\n);",
            "hints": [
              "Le type de la clé étrangère doit être strictement identique à celui de la clé primaire référencée."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 2 : Les Jointures (INNER, LEFT, RIGHT JOIN)",
        "description": "Reconstruisez l'information éclatée. Fusionnez plusieurs tables en une seule vue logique pour vos applications.",
        "order": 2,
        "duration": "14 heures",
        "content": "Le SQL prend tout son sens avec les jointures. `INNER JOIN` pour ne garder que les correspondances parfaites. `LEFT JOIN` pour garder tout le côté gauche, même sans correspondance (très utile pour lister tous les inscrits, même ceux sans message). Vous apprendrez à utiliser les **Alias** (`AS`) pour simplifier vos requêtes et à lever l'ambiguïté des colonnes ayant le même nom dans deux tables différentes.",
        "objectives": [
          "Maîtriser la condition ON pour fusionner les lignes",
          "Identifier les cas d'usage du LEFT JOIN (détection de données manquantes)",
          "Réaliser des jointures sur 3 tables ou plus"
        ],
        "exercises": [
          {
            "title": "Liste des Commandes Client",
            "description": "Affichez le 'nom' du client et la 'date_commande' via une jointure INNER JOIN entre 'clients' et 'commandes'.",
            "difficulty": "Moyen",
            "solution": "SELECT c.nom, o.date_commande \nFROM clients AS c \nINNER JOIN commandes AS o ON c.id = o.client_id;",
            "hints": [
              "Utilisez des alias courts (c, o) pour une requête plus lisible."
            ]
          }
        ],
        "resources": [
          {
            "title": "Visualizing SQL Joins",
            "type": "article",
            "url": "https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/"
          }
        ]
      },
      {
        "title": "Chapitre 3 : Sous-requêtes et Opérateurs d'Ensemble",
        "description": "Des requêtes dans des requêtes. Apprenez à utiliser le résultat d'un SELECT comme filtre pour un autre.",
        "order": 3,
        "duration": "11 heures",
        "content": "Parfois, une simple jointure ne suffit pas. Nous étudierons les **Sous-requêtes** scalaires et de liste (`WHERE id IN (SELECT ...)`). Vous apprendrez à utiliser les opérateurs d'ensemble comme `UNION` pour fusionner les résultats de deux tables différentes (ex: fusionner une table 'clients' et 'prospects' pour un envoi de mail groupé).",
        "objectives": [
          "Filtrer des données en fonction d'un calcul dynamique externe",
          "Utiliser UNION et UNION ALL correctement",
          "Comprendre les sous-requêtes corrélées (performance warning)"
        ],
        "exercises": [
          {
            "title": "Moyenne Supérieure",
            "description": "Sélectionnez les produits dont le prix est strictement supérieur à la moyenne de tous les prix.",
            "difficulty": "Difficile",
            "solution": "SELECT * FROM produits WHERE prix > (SELECT AVG(prix) FROM produits);",
            "hints": [
              "La sous-requête entre parenthèses est calculée en premier."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Vues (VIEWS) et Procédures Stockées de base",
        "description": "Simplifiez la complexité. Enregistrez vos requêtes les plus lourdes sous forme de tables virtuelles.",
        "order": 4,
        "duration": "10 heures",
        "content": "Si vous tapez une jointure complexe de 20 lignes tous les jours, il est temps de créer une **Vue (`VIEW`)**. Une vue agit comme une table virtuelle sécurisée, masquant la complexité du schéma réel aux développeurs frontend. Nous introduirons également les **Procédures Stockées**, permettant d'exécuter des blocs de logique directement dans le moteur de la base de données pour une performance optimale.",
        "objectives": [
          "Créer et maintenir des Vues SQL",
          "Sécuriser les données sensibles via des vues restreintes",
          "Comprendre l'intérêt des procédures pour l'automatisation"
        ],
        "exercises": [
          {
            "title": "Création de Vue Rapport",
            "description": "Créez une vue 'v_rapport_ventes' qui contient le nom du produit et le total des ventes associées.",
            "difficulty": "Moyen",
            "solution": "CREATE VIEW v_rapport_ventes AS \nSELECT p.nom, SUM(v.total) \nFROM produits p JOIN ventes v ON p.id = v.produit_id GROUP BY p.nom;",
            "hints": [
              "Une vue se consulte ensuite comme une simple table : SELECT * FROM v_rapport_ventes;"
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "MySQL - Niveau Expert Mondiale : Performance & Administration",
    "description": "Devenez un Database Engineer (DBA). Maîtrisez les Transactions ACID, les Triggers, l'indexation B-Tree et l'optimisation de requêtes à haut trafic.",
    "category": "Data",
    "level": "Avancé",
    "duration": "65 heures",
    "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=800&q=80",
    "rating": 4.9,
    "students": 6500,
    "language": "mysql",
    "isFree": true,
    "tags": [
      "MySQL",
      "Transactions",
      "Triggers",
      "avancé",
      "ACID",
      "Index",
      "High Performance"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Transactions et Propriétés ACID",
        "description": "Le rempart contre la corruption de données. Apprenez ce qui rend une base de données 'industrielle'.",
        "order": 1,
        "duration": "15 heures",
        "content": "Imaginez un virement bancaire : si le débit réussit mais que le crédit échoue à cause d'une panne, l'argent s'évapore. C'est là qu'interviennent les **Transactions**. Nous étudierons les 4 piliers **ACID** (Atomicité, Cohérence, Isolation, Durabilité). Vous maîtriserez `START TRANSACTION`, `COMMIT` pour valider, et `ROLLBACK` pour annuler toute opération en cas d'erreur. C'est la base absolue de toute application financière ou critique.",
        "objectives": [
          "Implémenter des transactions multi-tables sécurisées",
          "Comprendre les niveaux d'isolation (Dirty Read, Phantom Read)",
          "Gérer les verrous (Locks) pour éviter les deadlocks"
        ],
        "exercises": [
          {
            "title": "Virement Bancaire Sécure",
            "description": "Écrivez le bloc SQL pour transférer 50€ d'un compte A vers un compte B en garantissant que si l'un échoue, rien n'est modifié.",
            "difficulty": "Difficile",
            "solution": "START TRANSACTION;\nUPDATE comptes SET solde = solde - 50 WHERE id = 1;\nUPDATE comptes SET solde = solde + 50 WHERE id = 2;\nCOMMIT;",
            "hints": [
              "Le COMMIT ne doit être appelé que si aucune erreur n'est survenue."
            ]
          }
        ],
        "resources": [
          {
            "title": "Understanding ACID Properties",
            "type": "article",
            "url": "https://en.wikipedia.org/wiki/ACID"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Indexation Profonde et Plans d'Exécution",
        "description": "Passez de 10 secondes à 0.001s par requête. Maîtrisez les index B-Tree et l'outil EXPLAIN.",
        "order": 2,
        "duration": "18 heures",
        "content": "Sans index, MySQL fait un 'Full Table Scan' (parcours ligne par ligne), ce qui tue les performances sur de gros volumes. Nous étudierons le fonctionnement interne des **Index B-Tree**. Vous apprendrez à utiliser la commande magique `EXPLAIN` pour voir comment MySQL prévoit d'exécuter votre requête. Vous découvrirez comment choisir les colonnes à indexer et pourquoi trop d'index peut ralentir vos écritures (`INSERT/UPDATE`).",
        "objectives": [
          "Diagnostiquer des requêtes lentes via EXPLAIN ANALYZE",
          "Créer des index composites optimaux",
          "Comprendre les index de couverture (Covering Indexes)"
        ],
        "exercises": [
          {
            "title": "La Commande de Diagnostic",
            "description": "Quelle commande préfixer à votre SELECT pour voir si MySQL utilise bien un index pour filtrer ?",
            "difficulty": "Facile",
            "solution": "EXPLAIN",
            "hints": [
              "Cherchez la colonne 'key' dans le résultat de l'EXPLAIN."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Triggers (Déclencheurs) et Automatisation",
        "description": "Faites réagir votre base de données automatiquement. Créez des logs d'audit et des calculs automatiques sans code backend.",
        "order": 3,
        "duration": "15 heures",
        "content": "Un **Trigger** est un bloc de code qui s'exécute automatiquement `BEFORE` ou `AFTER` un événement (Insert, Update, Delete). C'est l'outil parfait pour maintenir un historique de modifications ou mettre à jour des compteurs en temps réel. Nous apprendrons à manipuler les variables `OLD` (ancienne valeur) et `NEW` (nouvelle valeur) pour une logique de précision chirurgicale directement dans le moteur de données.",
        "objectives": [
          "Créer un log d'audit automatique des modifications de comptes",
          "Implémenter des contraintes de validation métier complexes via Triggers",
          "Gérer la récursion et les performances des déclencheurs"
        ],
        "exercises": [
          {
            "title": "Trigger d'Historique",
            "description": "Créez un trigger qui, après chaque update sur 'produits', insère l'ancien prix et le nouveau prix dans une table 'logs_prix'.",
            "difficulty": "Difficile",
            "solution": "CREATE TRIGGER after_prix_update AFTER UPDATE ON produits FOR EACH ROW\nBEGIN\n  INSERT INTO logs_prix (ancien, nouveau) VALUES (OLD.prix, NEW.prix);\nEND;",
            "hints": [
              "Utilisez OLD pour accéder à la donnée avant la modification."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Securité, Sauvegarde et Réplication",
        "description": "Protégez le trésor de l'entreprise. Gérez les privilèges GRANT, les dumps et la haute disponibilité.",
        "order": 4,
        "duration": "17 heures",
        "content": "Une base de données n'est rien sans sécurité. Nous étudierons la gestion des utilisateurs et des privilèges (`GRANT/REVOKE`). Vous apprendrez à effectuer des sauvegardes à chaud via `mysqldump` et à restaurer un système après un crash. Enfin, nous introduirons la **Réplication Master-Slave**, la technique utilisée par les géants du web pour répartir la charge de lecture et garantir que si un serveur meurt, les données survivent sur un autre.",
        "objectives": [
          "Appliquer le principe du moindre privilège aux utilisateurs applicatifs",
          "Mettre en place une stratégie de Backup/Restore professionnelle",
          "Comprendre les bases du Sharding et de la réplication"
        ],
        "exercises": [
          {
            "title": "Privilège Restreint",
            "description": "Donnez uniquement le droit de SELECT sur la table 'public_data' à l'utilisateur 'visiteur'.",
            "difficulty": "Moyen",
            "solution": "GRANT SELECT ON db_name.public_data TO 'visiteur'@'localhost';",
            "hints": [
              "Ne donnez jamais de droits ALL PRIVILEGES à un utilisateur Web."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "ReactJS - Niveau Débutant : Les Bases de l'UI Moderne",
    "description": "Apprenez la bibliothèque front-end N°1 mondiale. Maîtrisez le JSX, les composants et le flux de données unidirectionnel pour créer des interfaces ultra-rapides.",
    "category": "Web",
    "level": "Débutant",
    "duration": "30 heures",
    "image": "https://images.unsplash.com/photo-1633356122544-f134324a6cee5?w=800&q=80",
    "rating": 4.8,
    "students": 55000,
    "language": "react",
    "isFree": true,
    "tags": [
      "ReactJS",
      "frontend",
      "JSX",
      "composants",
      "débutant",
      "UI"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : L'Écosystème React et le JSX",
        "description": "Le mariage révolutionnaire du HTML et du JavaScript. Comprenez pourquoi le DOM Virtuel change tout.",
        "order": 1,
        "duration": "6 heures",
        "content": "React n'est pas un framework, c'est une bibliothèque. Son innovation majeure est le **JSX**, une extension syntaxique du JS qui permet d'écrire du HTML directement dans vos fonctions. Nous étudierons comment Babel compile ce code en appels `React.createElement`. Vous découvrirez le **Virtual DOM**, la copie légère du vrai DOM que React utilise pour calculer les changements minimaux avant de mettre à jour l'écran, garantissant une fluidité exceptionnelle.",
        "objectives": [
          "Configurer un projet React avec Vite",
          "Manipuler des expressions JavaScript dans le JSX via les accolades",
          "Comprendre la différence entre le DOM réel et le DOM virtuel"
        ],
        "exercises": [
          {
            "title": "Interpolation Dynamique",
            "description": "Créez une constante `nom = 'React'` et affichez-la dans une balise `<h1>` à l'intérieur d'un composant.",
            "difficulty": "Facile",
            "solution": "const App = () => {\n  const nom = 'React';\n  return <h1>Hello {nom}</h1>;\n}",
            "hints": [
              "Utilisez les accolades {} pour injecter du JS dans le HTML."
            ]
          }
        ],
        "resources": [
          {
            "title": "React Docs: Introducing JSX",
            "type": "article",
            "url": "https://react.dev/learn/writing-markup-with-jsx"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Composants et Props (Réutilisabilité)",
        "description": "Construisez votre interface comme un jeu de Legos. Apprenez à créer des composants modulaires et à leur passer des données.",
        "order": 2,
        "duration": "8 heures",
        "content": "Tout en React est un Composant. Une simple fonction JS qui retourne du JSX. Nous apprendrons à découper une page en petits morceaux réutilisables. Vous maîtriserez les **Props**, les paramètres que vous passez à un composant enfant (comme des arguments de fonction). Vous apprendrez que les props sont **read-only** (immuables) : un enfant ne doit jamais modifier ses propres props, garantissant un flux de données descendant prévisible.",
        "objectives": [
          "Créer des composants fonctionnels réutilisables",
          "Passer des données complexes (objets, tableaux) via les props",
          "Utiliser la destructuration d'objets pour clarifier vos composants"
        ],
        "exercises": [
          {
            "title": "Le Composant Bouton",
            "description": "Créez un composant `MonBouton` qui reçoit une prop `label` et l'affiche à l'intérieur d'une balise `<button>`.",
            "difficulty": "Facile",
            "solution": "const MonBouton = ({ label }) => (\n  <button>{label}</button>\n);",
            "hints": [
              "Utilisez la destructuration `{ label }` directement dans les arguments de la fonction."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : État Local avec le Hook useState",
        "description": "Rendez votre interface vivante. Apprenez à gérer les changements de données qui déclenchent un re-rendu automatique.",
        "order": 3,
        "duration": "8 heures",
        "content": "L'état (**State**) est la mémoire d'un composant. Contrairement aux variables classiques, modifier le State force React à re-dessiner le composant à l'écran. Nous étudierons le hook `useState`. Vous apprendrez la syntaxe de destructuration `const [val, setVal] = useState(initial)`. Nous aborderons les pièges classiques : l'asynchronisme des mises à jour et pourquoi il ne faut jamais modifier l'état directement (`state = 10` est interdit).",
        "objectives": [
          "Déclarer et mettre à jour un état simple",
          "Gérer les types complexes (objets/tableaux) dans le state",
          "Comprendre le cycle de re-rendu déclenché par le setter"
        ],
        "exercises": [
          {
            "title": "Le Compteur Interactif",
            "description": "Créez un bouton qui, à chaque clic, incrémente un nombre affiché à l'écran.",
            "difficulty": "Moyen",
            "solution": "const [count, setCount] = useState(0);\nreturn <button onClick={() => setCount(count + 1)}>{count}</button>;",
            "hints": [
              "N'oubliez pas d'importer { useState } de 'react'."
            ]
          }
        ],
        "resources": [
          {
            "title": "Beta React Docs: State: A Component's Memory",
            "type": "article",
            "url": "https://react.dev/learn/state-a-components-memory"
          }
        ]
      },
      {
        "title": "Chapitre 4 : Rendu Conditionnel et Listes (Map)",
        "description": "Affichez vos données intelligemment. Apprenez à boucler sur des tableaux et à masquer/afficher des éléments selon le contexte.",
        "order": 4,
        "duration": "8 heures",
        "content": "Dans le monde réel, les données viennent sous forme de listes. Nous utiliserons la méthode `.map()` du JS pour transformer un tableau de données en une liste de composants JSX. Point crucial : la prop **key**. Vous apprendrez pourquoi React en a besoin pour identifier chaque élément de manière unique dans le Virtual DOM. Nous aborderons également le rendu conditionnel via l'opérateur ternaire `? :` ou l'opérateur logique `&&`.",
        "objectives": [
          "Générer des listes dynamiques à partir de tableaux d'objets",
          "Utiliser des clés uniques pour optimiser les performances",
          "Masquer des éléments avec des conditions logiques simples"
        ],
        "exercises": [
          {
            "title": "La Liste de Tâches",
            "description": "Soit `todos = [{id: 1, text: 'A'}, {id: 2, text: 'B'}]`. Affichez-les dans des `<li>` via `.map()`.",
            "difficulty": "Moyen",
            "solution": "<ul>{todos.map(t => <li key={t.id}>{t.text}</li>)}</ul>",
            "hints": [
              "La clé 'key' doit être sur l'élément le plus à l'extérieur de la boucle."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "ReactJS - Niveau Intermédiaire : Cycle de Vie & Hooks",
    "description": "Allez au-delà de l'affichage passif. Maîtrisez les effets secondaires, les formulaires complexes et la communication avec les APIs externes.",
    "category": "Web",
    "level": "Intermédiaire",
    "duration": "45 heures",
    "image": "https://images.unsplash.com/photo-1633356122544-f134324a6cee5?w=800&q=80",
    "rating": 4.8,
    "students": 22000,
    "language": "react",
    "isFree": true,
    "tags": [
      "ReactJS",
      "useEffect",
      "Hooks",
      "intermédiaire",
      "Forms",
      "API"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Le Hook useEffect (Effets Secondaires)",
        "description": "Synchronisez votre composant avec le monde extérieur. Gérer le chargement de données et le nettoyage des ressources.",
        "order": 1,
        "duration": "12 heures",
        "content": "Certaines actions ne sont pas directement liées au rendu : fetch une API, lancer un timer, s'abonner à un socket. C'est le rôle de `useEffect`. Nous étudierons le **tableau de dépendances** : vide `[]` pour s'exécuter une fois au montage, rempli `[val]` pour réagir aux changements. Surtout, nous apprendrons la fonction de **cleanup** (le `return` de l'effet) pour éviter les fuites de mémoire et les bugs de synchronisation.",
        "objectives": [
          "Charger des données depuis une API REST au chargement de la page",
          "Nettoyer des intervals ou des event listeners",
          "Éviter les boucles infinies de re-rendu dans useEffect"
        ],
        "exercises": [
          {
            "title": "Chargement API",
            "description": "Utilisez useEffect pour faire un fetch vers 'api.com/users' et stocker le résultat dans un state local au chargement du composant.",
            "difficulty": "Difficile",
            "solution": "useEffect(() => {\n  fetch(url).then(r => r.json()).then(data => setUsers(data));\n}, []);",
            "hints": [
              "Le tableau de dépendances vide [] est la clé pour ne l'exécuter qu'une seule fois."
            ]
          }
        ],
        "resources": [
          {
            "title": "Synchronizing with Effects",
            "type": "article",
            "url": "https://react.dev/learn/synchronizing-with-effects"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Formulaires Contrôlés et Gestion d'Entrées",
        "description": "Oubliez le DOM natif. Apprenez à lier vos inputs HTML directement à l'état React pour une validation en temps réel.",
        "order": 2,
        "duration": "11 heures",
        "content": "Dans un formulaire contrôlé, React est la 'source unique de vérité'. La valeur de l'input est dictée par le state, et chaque frappe au clavier met à jour ce state via `onChange`. Cela permet une validation instantanée (ex: mot de passe trop court, mail invalide) et une manipulation simplifiée des données avant envoi. Nous aborderons également la gestion des formulaires complexes avec plusieurs champs via un seul objet d'état.",
        "objectives": [
          "Créer des inputs texte, cases à cocher et selects contrôlés",
          "Valider les données avant soumission",
          "Intercepter le submit avec e.preventDefault()"
        ],
        "exercises": [
          {
            "title": "Input en Direct",
            "description": "Créez un input texte dont le contenu est affiché en MAJUSCULES juste en dessous en temps réel.",
            "difficulty": "Moyen",
            "solution": "<input value={text} onChange={e => setText(e.target.value)} />\n<p>{text.toUpperCase()}</p>",
            "hints": [
              "Liez 'value' au state et déclenchez le setter dans 'onChange'."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Composition vs Héritage (Patterns UI)",
        "description": "Adoptez la philosophie React. Apprenez à créer des composants flexibles via la prop 'children' et les composants d'ordre supérieur basiques.",
        "order": 3,
        "duration": "11 heures",
        "content": "React privilégie la **Composition**. Au lieu de faire hériter une classe d'une autre, on imbrique les composants. Nous utiliserons la prop spéciale `children` pour créer des 'wrapper' (ex: une Card, une Modal) qui acceptent n'importe quel contenu. Vous apprendrez à créer des composants d'interface génériques et à les spécialiser via les props, rendant votre code infiniment plus flexible et robuste.",
        "objectives": [
          "Utiliser la prop children pour créer des layouts réutilisables",
          "Gérer la délégation de rendu",
          "Comprendre pourquoi la composition est plus puissante que l'héritage en UI"
        ],
        "exercises": [
          {
            "title": "Le Wrapper Card",
            "description": "Créez un composant `Card` qui entoure son contenu d'une `div` avec une bordure grise.",
            "difficulty": "Facile",
            "solution": "const Card = ({ children }) => (\n  <div style={{ border: '1px solid gray' }}>{children}</div>\n);",
            "hints": [
              "'children' est une prop automatique contenant tout ce qui est mis entre les balises du composant."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 4 : Manipulation de Références (useRef) et Portals",
        "description": "Sortez du Virtual DOM quand c'est nécessaire. Apprenez à accéder aux nœuds HTML réels et à rendre des éléments en dehors du conteneur parent.",
        "order": 4,
        "duration": "11 heures",
        "content": "Parfois, on a besoin de toucher au DOM réel : focaliser un input, mesurer une taille de div, intégrer une librairie externe (D3, Google Maps). C'est le rôle de `useRef`. Une référence est une boîte qui garde une valeur entre les rendus sans en provoquer de nouveau. Nous aborderons aussi les **Portals**, permettant de rendre un composant (comme une modale) tout en haut de l'arbre HTML (`<body>`) tout en gardant sa logique dans son parent React.",
        "objectives": [
          "Manipuler le focus HTML programmatiquement",
          "Stocker des valeurs persistantes hors-state",
          "Gérer les superpositions (Z-index) via les Portals"
        ],
        "exercises": [
          {
            "title": "Auto-Focus",
            "description": "Utilisez useRef pour donner le focus à un input dès qu'un bouton est cliqué.",
            "difficulty": "Moyen",
            "solution": "const inputRef = useRef();\n<input ref={inputRef} />\n<button onClick={() => inputRef.current.focus()}>Focus</button>",
            "hints": [
              "Accédez à l'élément via inputRef.current."
            ]
          }
        ],
        "resources": []
      }
    ]
  },
  {
    "title": "ReactJS - Niveau Expert Mondiale : Performance & Architecture Scalable",
    "description": "Devenez un architecte frontend. Maîtrisez le partage d'état global (Context/Redux), l'optimisation des rendus, les hooks personnalisés et les architectures d'entreprise.",
    "category": "Web",
    "level": "Avancé",
    "duration": "65 heures",
    "image": "https://images.unsplash.com/photo-1633356122544-f134324a6cee5?w=800&q=80",
    "rating": 4.9,
    "students": 11000,
    "language": "react",
    "isFree": true,
    "tags": [
      "React",
      "Redux",
      "Context API",
      "Optimization",
      "avancé",
      "Architecture"
    ],
    "chapters": [
      {
        "title": "Chapitre 1 : Partage d'État Global (Context API)",
        "description": "Éliminez le Prop-Drilling. Apprenez à créer un hub de données accessible par n'importe quel composant de votre application.",
        "order": 1,
        "duration": "18 heures",
        "content": "Passer des données à travers 10 niveaux de composants est un cauchemar. La **Context API** permet de créer un 'nuage' de données. Nous apprendrons à créer un `Provider` pour injecter les données (ex: thème sombre, utilisateur connecté) et à les consommer via `useContext`. Nous aborderons les patterns de 'Context splitting' pour éviter les re-rendus inutiles et l'utilisation de `useReducer` pour gérer des états complexes de manière structurée (Redux-like).",
        "objectives": [
          "Implémenter un système de thème (Dark/Light) global",
          "Gérer l'authentification centralisée",
          "Combiner Context et useReducer pour une gestion d'état robuste"
        ],
        "exercises": [
          {
            "title": "Le Thème Global",
            "description": "Créez un ThemeContext et un bouton qui change la valeur 'theme' de 'light' à 'dark' pour toute l'app.",
            "difficulty": "Difficile",
            "solution": "const ThemeContext = createContext();\n// Provider: <ThemeContext.Provider value={{theme, toggleTheme}}>\n// Subscriber: const {theme} = useContext(ThemeContext);",
            "hints": [
              "N'oubliez pas d'envelopper votre application <App /> dans le Provider."
            ]
          }
        ],
        "resources": [
          {
            "title": "Passing Data Deeply with Context",
            "type": "article",
            "url": "https://react.dev/learn/passing-data-deeply-with-context"
          }
        ]
      },
      {
        "title": "Chapitre 2 : Custom Hooks (Logique Métier Réutilisable)",
        "description": "Bannissez la répétition de code. Apprenez à extraire votre propre logique complexe dans des fonctions 'useX' réutilisables partout.",
        "order": 2,
        "duration": "15 heures",
        "content": "Les **Hooks Personnalisés** sont l'outil d'abstraction ultime. Ils permettent d'extraire la logique (state, effets) d'un composant pour la réutiliser ailleurs. Nous construirons des hooks comme `useFetch` (gestion de chargement/erreur API), `useLocalStorage` (persistance automatique), ou `useAuth`. Cela permet de garder vos composants visuels 'purs' et de tester votre logique métier indépendamment.",
        "objectives": [
          "Extraire la logique de fetch dans un hook useFetch",
          "Gérer les formulaires via un hook useForm",
          "Composer plusieurs hooks entre eux"
        ],
        "exercises": [
          {
            "title": "Le Hook useToggle",
            "description": "Écrivez un hook `useToggle` qui retourne un booléen et une fonction pour l'inverser.",
            "difficulty": "Moyen",
            "solution": "function useToggle(init) {\n  const [v, setV] = useState(init);\n  const toggle = () => setV(!v);\n  return [v, toggle];\n}",
            "hints": [
              "Commencez toujours le nom par 'use' pour respecter les règles des hooks."
            ]
          }
        ],
        "resources": []
      },
      {
        "title": "Chapitre 3 : Optimisation des Performances (Memo, useMemo, useCallback)",
        "description": "Dites adieu aux lenteurs. Apprenez à empêcher les re-rendus inutiles et à mémoriser les calculs lourds.",
        "order": 3,
        "duration": "15 heures",
        "content": "React est rapide, mais sur des apps massives, les re-rendus superflus peuvent geler l'UI. Nous étudierons : 1) **React.memo** pour ne pas re-dessiner un composant si ses props n'ont pas changé. 2) **useMemo** pour mettre en cache un calcul mathématique lourd. 3) **useCallback** pour maintenir l'identité d'une fonction et éviter de casser les optimisations des enfants. Vous apprendrez à profiler votre app avec les DevTools pour débusquer les goulots d'étranglement.",
        "objectives": [
          "Identifier les re-rendus inutiles via le Profiler",
          "Optimiser le rendu de listes massives",
          "Maîtriser le passage de fonctions stables aux composants fils"
        ],
        "exercises": [
          {
            "title": "Mémorisation de Calcul",
            "description": "Utilisez useMemo pour ne recalculer le factoriel d'un grand nombre que si ce nombre change.",
            "difficulty": "Moyen",
            "solution": "const result = useMemo(() => calculLourd(n), [n]);",
            "hints": [
              "Le deuxième argument est le tableau de dépendances, comme useEffect."
            ]
          }
        ],
        "resources": [
          {
            "title": "Skipping Re-renders with useMemo",
            "type": "article",
            "url": "https://react.dev/reference/react/useMemo"
          }
        ]
      },
      {
        "title": "Chapitre 4 : Architecture Avancée et Testing (Jest/RTL)",
        "description": "Prêt pour la production. Apprenez à structurer vos dossiers, à gérer les erreurs avec Error Boundaries et à tester vos composants.",
        "order": 4,
        "duration": "17 heures",
        "content": "Une app scalable nécessite une structure rigoureuse (Atomic Design, Feature-based). Nous explorerons les **Error Boundaries** pour capturer les crashs sans faire sauter toute l'app. Enfin, nous aborderons le **Testing**. Avec Jest et React Testing Library, vous apprendrez à simuler des clics utilisateur et à vérifier que vos composants se comportent comme prévu avant de les déployer. C'est l'assurance qualité indispensable de tout ingénieur senior.",
        "objectives": [
          "Mettre en place un Error Boundary global",
          "Écrire des tests unitaires pour vos composants et hooks",
          "Implémenter le Lazy Loading et le Code Splitting (React.lazy)"
        ],
        "exercises": [
          {
            "title": "Test de Rendu",
            "description": "Écrivez un test RTL simple qui vérifie qu'un composant affiche bien le texte 'Bonjour'.",
            "difficulty": "Moyen",
            "solution": "test('affiche bonjour', () => {\n  render(<App />);\n  expect(screen.getByText('Bonjour')).toBeInTheDocument();\n});",
            "hints": [
              "Utilisez 'screen.getByText' pour cibler les éléments."
            ]
          }
        ],
        "resources": []
      }
    ]
  }
]